// AnimBlueprintGeneratedClass ABP_FP_Dwarf.ABP_FP_Dwarf_C
// Size: 0x2ae8 (Inherited: 0x450)
struct UABP_FP_Dwarf_C : UPlayerFPAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x450(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x458(0x30)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x488(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x4d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x4f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x520(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x548(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x570(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x598(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x5c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x5e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x610(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x638(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x660(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x688(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x6b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x6d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x700(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x728(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x750(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x778(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x7a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x7c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x7f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x818(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x840(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x868(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x890(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x8b8(0x28)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7; // 0x8e0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11; // 0x900(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7; // 0xa08(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0xa28(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0xaa0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0xad0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0xb48(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0xb78(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0xbf0(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0xc20(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0xc48(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0xcc0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0xcf0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0xd68(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0xd98(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0xe10(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0xe40(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0xeb8(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0xee8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0xf88(0x78)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10; // 0x1000(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6; // 0x1108(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6; // 0x1128(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x1148(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x11c0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x11f0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x1268(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x1298(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x1310(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x1340(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x13b8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x1458(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x14d0(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9; // 0x1500(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0x1608(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0x1628(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x1648(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x16c0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x1760(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x17d8(0x30)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x1808(0xc8)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x18d0(0x18)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x18e8(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x19a8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x1a20(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x1a98(0xa0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8; // 0x1b38(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x1c40(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x1c60(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x1c80(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x1cf8(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x1d70(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x1e10(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x1e40(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1eb8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1ee8(0xb0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x1f98(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0x1fb8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x20c0(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x20e0(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2198(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x21c0(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x2208(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x2310(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x2418(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x2520(0x108)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x2628(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x26c8(0x78)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x2740(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x2760(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x2780(0x108)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2888(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x2928(0x78)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x29a0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x29c0(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2ac8(0x20)

	void AnimGraph(struct FPoseLink AnimGraph); // Function ABP_FP_Dwarf.ABP_FP_Dwarf_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x158ca90
	void AnimNotify_Mine(); // Function ABP_FP_Dwarf.ABP_FP_Dwarf_C.AnimNotify_Mine // (BlueprintCallable|BlueprintEvent) // @ game+0x158ca90
	void StartInspectWeapon(); // Function ABP_FP_Dwarf.ABP_FP_Dwarf_C.StartInspectWeapon // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void StopInspectWeapon(); // Function ABP_FP_Dwarf.ABP_FP_Dwarf_C.StopInspectWeapon // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void AnimNotify_BeginBuild(); // Function ABP_FP_Dwarf.ABP_FP_Dwarf_C.AnimNotify_BeginBuild // (BlueprintCallable|BlueprintEvent) // @ game+0x158ca90
	void AnimNotify_EndBuild(); // Function ABP_FP_Dwarf.ABP_FP_Dwarf_C.AnimNotify_EndBuild // (BlueprintCallable|BlueprintEvent) // @ game+0x158ca90
	void ExecuteUbergraph_ABP_FP_Dwarf(int32_t EntryPoint); // Function ABP_FP_Dwarf.ABP_FP_Dwarf_C.ExecuteUbergraph_ABP_FP_Dwarf // (Final|UbergraphFunction) // @ game+0x158ca90
};

