// AnimBlueprintGeneratedClass ABP_TP_Dwarf.ABP_TP_Dwarf_C
// Size: 0x691c (Inherited: 0x5f0)
struct UABP_TP_Dwarf_C : UPlayerTPAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x5f0(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x5f8(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29; // 0x628(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28; // 0x650(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x678(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x6a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x6c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x6f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x718(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x740(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x768(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x790(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x7b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x7e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x808(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x830(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x858(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x880(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x8a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x8d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x8f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x920(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x948(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x970(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x998(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x9c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x9e8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_49; // 0xa10(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_48; // 0xab0(0xa0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0xb50(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_8; // 0xc18(0x48)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0xc60(0xc8)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7; // 0xd28(0x48)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6; // 0xd70(0x48)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5; // 0xdb8(0x48)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4; // 0xe00(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_9; // 0xe48(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0xe90(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0xf98(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0xfb8(0x20)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0xfd8(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_47; // 0x1008(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_46; // 0x10a8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66; // 0x1148(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65; // 0x11c0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64; // 0x1238(0x78)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x12b0(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63; // 0x1370(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62; // 0x13e8(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_45; // 0x1460(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x1500(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x1530(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x1638(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x1740(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x1760(0x20)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_6; // 0x1780(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_44; // 0x1820(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61; // 0x18c0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60; // 0x1938(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x19b0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59; // 0x19e0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x1a58(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58; // 0x1a88(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x1b00(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57; // 0x1b30(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x1ba8(0x30)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3; // 0x1bd8(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x1c20(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56; // 0x1c50(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x1cc8(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_43; // 0x1cf8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_42; // 0x1d98(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55; // 0x1e38(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54; // 0x1eb0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53; // 0x1f28(0x78)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x1fa0(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52; // 0x2060(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51; // 0x20d8(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_41; // 0x2150(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x21f0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50; // 0x2220(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x2298(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49; // 0x22c8(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_40; // 0x2340(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48; // 0x23e0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x2458(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47; // 0x2488(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_39; // 0x2500(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46; // 0x25a0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x2618(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_38; // 0x2648(0xa0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x26e8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x27f0(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x2810(0x20)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_5; // 0x2830(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45; // 0x28d0(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_37; // 0x2948(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_36; // 0x29e8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_35; // 0x2a88(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_34; // 0x2b28(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44; // 0x2bc8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43; // 0x2c40(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_33; // 0x2cb8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42; // 0x2d58(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41; // 0x2dd0(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_32; // 0x2e48(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_31; // 0x2ee8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40; // 0x2f88(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39; // 0x3000(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_30; // 0x3078(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38; // 0x3118(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37; // 0x3190(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_29; // 0x3208(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36; // 0x32a8(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_28; // 0x3320(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35; // 0x33c0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34; // 0x3438(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_27; // 0x34b0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0x3550(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_26; // 0x35c8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_25; // 0x3668(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0x3708(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0x3780(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24; // 0x37f8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x3898(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x3910(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23; // 0x3988(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22; // 0x3a28(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21; // 0x3ac8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x3b68(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x3be0(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20; // 0x3c58(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x3cf8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x3d70(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19; // 0x3de8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18; // 0x3e88(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_8; // 0x3f28(0x48)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17; // 0x3f70(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x4010(0x78)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x4088(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x4148(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x41c0(0x78)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive; // 0x4238(0xd0)
	struct FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive; // 0x4308(0x38)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x4340(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x4368(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x4390(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x43b8(0x28)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0x43e0(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x4428(0x30)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x4458(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x44a0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x44d0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x4548(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x4578(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x4628(0x78)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x46a0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x46c0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x47c8(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x48d0(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x48f0(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16; // 0x4968(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x4a08(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x4a80(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15; // 0x4af8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x4b98(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x4c10(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14; // 0x4c88(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x4d28(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x4da0(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0x4e18(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x4eb8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x4f30(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x4fa8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x5048(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x50c0(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0x5138(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x51d8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x5250(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0x52c8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x5368(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x53e0(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0x5458(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x54f8(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0x5570(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x5610(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x5688(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x5700(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x57a0(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x5840(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x58e0(0xa0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x5980(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x59a0(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x5aa8(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x5ac8(0xa0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x5b68(0xb0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_4; // 0x5c18(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_3; // 0x5cb8(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone_2; // 0x5d58(0xa0)
	struct FAnimNode_RotateRootBone AnimGraphNode_RotateRootBone; // 0x5df8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5e98(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x5ec8(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0x5f78(0x48)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x5fc0(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x6060(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x6118(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x6140(0xc0)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0x6200(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x6248(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x6290(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x62b8(0xb8)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x6370(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x63b8(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x6400(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x6428(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x64c8(0x28)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0x64f0(0x188)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x6678(0x188)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x6800(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x6848(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x6890(0x78)
	float StrafeBlendDuration; // 0x6908(0x04)
	bool LeftFootIKOn; // 0x690c(0x01)
	char pad_690D[0x3]; // 0x690d(0x03)
	struct FVector LeftFootIKLocation; // 0x6910(0x0c)

	void AnimGraph(struct FPoseLink AnimGraph); // Function ABP_TP_Dwarf.ABP_TP_Dwarf_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x158ca90
	void AnimNotify_StartBuild(); // Function ABP_TP_Dwarf.ABP_TP_Dwarf_C.AnimNotify_StartBuild // (BlueprintCallable|BlueprintEvent) // @ game+0x158ca90
	void AnimNotify_EndBuild(); // Function ABP_TP_Dwarf.ABP_TP_Dwarf_C.AnimNotify_EndBuild // (BlueprintCallable|BlueprintEvent) // @ game+0x158ca90
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function ABP_TP_Dwarf.ABP_TP_Dwarf_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void BlueprintInitializeAnimation(); // Function ABP_TP_Dwarf.ABP_TP_Dwarf_C.BlueprintInitializeAnimation // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void AnimNotify_Mine(); // Function ABP_TP_Dwarf.ABP_TP_Dwarf_C.AnimNotify_Mine // (BlueprintCallable|BlueprintEvent) // @ game+0x158ca90
	void BlueprintBeginPlay(); // Function ABP_TP_Dwarf.ABP_TP_Dwarf_C.BlueprintBeginPlay // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void ExecuteUbergraph_ABP_TP_Dwarf(int32_t EntryPoint); // Function ABP_TP_Dwarf.ABP_TP_Dwarf_C.ExecuteUbergraph_ABP_TP_Dwarf // (Final|UbergraphFunction) // @ game+0x158ca90
};

