// BlueprintGeneratedClass BP_DeepDive_SEQ_DropPod.BP_DeepDive_SEQ_DropPod_C
// Size: 0x290 (Inherited: 0x220)
struct ABP_DeepDive_SEQ_DropPod_C : AActor {
	struct UParticleSystemComponent* ParticleSystem; // 0x220(0x08)
	struct USceneComponent* hull; // 0x228(0x08)
	struct USkeletalMeshComponent* SK_DropPod_Drill; // 0x230(0x08)
	struct USkeletalMeshComponent* SK_DropPod_Airlock; // 0x238(0x08)
	struct UStaticMeshComponent* Spot2; // 0x240(0x08)
	struct UStaticMeshComponent* Spot1; // 0x248(0x08)
	struct USceneComponent* Scene; // 0x250(0x08)
	struct UStaticMeshComponent* Cone2; // 0x258(0x08)
	struct USpotLightComponent* SpotLight2; // 0x260(0x08)
	struct USpotLightComponent* SpotLight1; // 0x268(0x08)
	struct UStaticMeshComponent* Cone1; // 0x270(0x08)
	struct UStaticMeshComponent* SM_DropPod_Hull; // 0x278(0x08)
	struct UStaticMeshComponent* SM_DropPod_Hull_NoCol; // 0x280(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x288(0x08)
};

