// Class FSD.AcceptInviteBlueprintCallProxy
// Size: 0x88 (Inherited: 0x30)
struct UAcceptInviteBlueprintCallProxy : UOnlineBlueprintCallProxyBase {
	struct FMulticastInlineDelegate OnSuccess; // 0x30(0x10)
	struct FMulticastInlineDelegate OnFailure; // 0x40(0x10)
	struct UObject* WorldContextObject; // 0x50(0x08)
	char pad_58[0x30]; // 0x58(0x30)

	struct UAcceptInviteBlueprintCallProxy* AcceptInvite(struct UObject* WorldContextObject, struct FString ListName, struct FString UserId); // Function FSD.AcceptInviteBlueprintCallProxy.AcceptInvite // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x107af20
};

// Class FSD.Objective
// Size: 0x178 (Inherited: 0xb0)
struct UObjective : UActorComponent {
	struct FMulticastInlineDelegate OnObjectiveUpdated; // 0xb0(0x10)
	char pad_C0[0x8]; // 0xc0(0x08)
	struct UObjectiveWidget* ObjectiveWidgetClass; // 0xc8(0x08)
	struct FMissionShouts MissionShouts; // 0xd0(0x38)
	struct FText MissionDescription; // 0x108(0x18)
	int32_t CompletionRewardInCredits; // 0x120(0x04)
	int32_t CompletionRewardInXP; // 0x124(0x04)
	bool ScaleObjectiveToMission; // 0x128(0x01)
	bool RequiredReturnObjectiveCompleted; // 0x129(0x01)
	char pad_12A[0x6]; // 0x12a(0x06)
	struct UMissionStat* ObjectiveCompletedStat; // 0x130(0x08)
	SoftClassProperty OptionalObjectiveWidgetClass; // 0x138(0x28)
	int32_t IsPrimaryObjective; // 0x160(0x04)
	float MissionScale; // 0x164(0x04)
	struct TArray<struct UBiome*> BannedInBiomes; // 0x168(0x10)

	void SignalObjectiveUpdated(); // Function FSD.Objective.SignalObjectiveUpdated // (Final|Native|Protected|BlueprintCallable) // @ game+0x10c9930
	void Receive_StartTracking(); // Function FSD.Objective.Receive_StartTracking // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void OnRep_IsPrimaryObjective(); // Function FSD.Objective.OnRep_IsPrimaryObjective // (Final|Native|Protected) // @ game+0x11a2220
	bool IsTutorialObjective(); // Function FSD.Objective.IsTutorialObjective // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x109f010
	bool IsPrimary(); // Function FSD.Objective.IsPrimary // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11a1e30
	bool IsObjectiveResource(struct UResourceData* InResource); // Function FSD.Objective.IsObjectiveResource // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x11a1d90
	bool IsFinalBattle(); // Function FSD.Objective.IsFinalBattle // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11a1d60
	bool IsCompleted(); // Function FSD.Objective.IsCompleted // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11a1d30
	bool HasReplicated(); // Function FSD.Objective.HasReplicated // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11a1d00
	struct UObjectiveWidget* GetWidgetClassOrDefault(struct UObjectiveWidget* DefaultWidgetClass); // Function FSD.Objective.GetWidgetClassOrDefault // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x11a1c70
	int32_t GetRewardXP(); // Function FSD.Objective.GetRewardXP // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11a1c00
	struct FCreditsReward GetRewardCredits(); // Function FSD.Objective.GetRewardCredits // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11a1b70
	struct UOptionalObjectiveWidget* GetOptionalMissionWidget(); // Function FSD.Objective.GetOptionalMissionWidget // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x11a1b30
	struct FText GetObjectiveText(); // Function FSD.Objective.GetObjectiveText // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11a1a90
	struct UTexture2D* GetObjectiveIconFromClass(struct UObjective* objectiveClass); // Function FSD.Objective.GetObjectiveIconFromClass // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x11a1a10
	struct UTexture2D* GetObjectiveIcon(); // Function FSD.Objective.GetObjectiveIcon // (Event|Public|BlueprintEvent|Const) // @ game+0x158ca90
	struct FText GetObjectiveDescriptionFromClass(struct UObjective* objectiveClass, float missionLength); // Function FSD.Objective.GetObjectiveDescriptionFromClass // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x11a18f0
	struct FText GetObjectiveDescription(float missionLength); // Function FSD.Objective.GetObjectiveDescription // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	int32_t GetObjectiveAmountFromClass(struct UObjective* objectiveClass, float missionLength); // Function FSD.Objective.GetObjectiveAmountFromClass // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x11a1820
	int32_t GetObjectiveAmount(float missionLength); // Function FSD.Objective.GetObjectiveAmount // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x158ca90
	struct FObjectiveMissionIcon GetMissionIcon(); // Function FSD.Objective.GetMissionIcon // (Event|Public|BlueprintEvent|Const) // @ game+0x158ca90
	struct FText GetInMissionText(); // Function FSD.Objective.GetInMissionText // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x11a1640
	struct FText GetInMissionCounterText(); // Function FSD.Objective.GetInMissionCounterText // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x11a15a0
	struct UTexture2D* GetInMissionCounterIcon(); // Function FSD.Objective.GetInMissionCounterIcon // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x11a1570
};

// Class FSD.ActivationOjective
// Size: 0x180 (Inherited: 0x178)
struct UActivationOjective : UObjective {
	int32_t ObjectivesFound; // 0x178(0x04)
	int32_t ObjectivesToFind; // 0x17c(0x04)

	void OnRep_ObjectivesToFind(int32_t prevAmount); // Function FSD.ActivationOjective.OnRep_ObjectivesToFind // (Final|Native|Protected) // @ game+0x107ea10
	void OnRep_ObjectivesFound(int32_t prevAmount); // Function FSD.ActivationOjective.OnRep_ObjectivesFound // (Final|Native|Protected) // @ game+0x107ea10
};

// Class FSD.ActivationObject
// Size: 0x230 (Inherited: 0x220)
struct AActivationObject : AActor {
	struct USingleUsableComponent* Usable; // 0x220(0x08)
	bool HasBeenUsed; // 0x228(0x01)
	char pad_229[0x7]; // 0x229(0x07)

	void OnUsedBy(struct APlayerCharacter* User, enum class EInputKeys Key); // Function FSD.ActivationObject.OnUsedBy // (Final|Native|Protected) // @ game+0x107ea90
};

// Class FSD.ActivitySubSystem
// Size: 0x58 (Inherited: 0x30)
struct UActivitySubSystem : UGameInstanceSubsystem {
	char pad_30[0x28]; // 0x30(0x28)

	void StartActivity(struct APlayerState* PlayerState, struct UGameActivityType* activity); // Function FSD.ActivitySubSystem.StartActivity // (Final|Native|Public|BlueprintCallable) // @ game+0x107f0c0
	void ShowPlayerReviewUI(bool ReviewActiveMatch); // Function FSD.ActivitySubSystem.ShowPlayerReviewUI // (Final|Native|Public|BlueprintCallable) // @ game+0x107f030
	bool PlayerReviewUIAvailable(bool ReviewActiveMatch); // Function FSD.ActivitySubSystem.PlayerReviewUIAvailable // (Final|Native|Public|BlueprintCallable) // @ game+0x107ee80
	void EndActivity(struct APlayerState* PlayerState, struct UGameActivityType* activity); // Function FSD.ActivitySubSystem.EndActivity // (Final|Native|Public|BlueprintCallable) // @ game+0x107be80
};

// Class FSD.GameActivitySettings
// Size: 0x40 (Inherited: 0x30)
struct UGameActivitySettings : UDataAsset {
	struct TArray<struct TSoftObjectPtr<struct UGameActivityType>> GameActivites; // 0x30(0x10)
};

// Class FSD.GameActivityType
// Size: 0x58 (Inherited: 0x30)
struct UGameActivityType : UDataAsset {
	struct FString ActivityId; // 0x30(0x10)
	enum class EActivityType ActivityType; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
	struct TArray<struct FGameActivitySubTask> SubTasks; // 0x48(0x10)
};

// Class FSD.GameActivityAssignmentType
// Size: 0x60 (Inherited: 0x58)
struct UGameActivityAssignmentType : UGameActivityType {
	char pad_58[0x8]; // 0x58(0x08)
};

// Class FSD.GameActivityMissionType
// Size: 0x80 (Inherited: 0x58)
struct UGameActivityMissionType : UGameActivityType {
	struct TSoftObjectPtr<struct UMissionTemplate> ActivityMission; // 0x58(0x28)
};

// Class FSD.Reward
// Size: 0x30 (Inherited: 0x30)
struct UReward : UDataAsset {
};

// Class FSD.ActivityCardReward
// Size: 0x38 (Inherited: 0x30)
struct UActivityCardReward : UReward {
	struct UGameActivityType* activity; // 0x30(0x08)
};

// Class FSD.ActorFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UActorFunctionLibrary : UBlueprintFunctionLibrary {

	void UnlockSpecificCharacters(struct UObject* WorldContextObject, struct TArray<struct APlayerCharacter*> Characters, enum class ECharacterState UnlockIf, enum class ECharacterState UnlockTo); // Function FSD.ActorFunctionLibrary.UnlockSpecificCharacters // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x107f2c0
	void UnlockCharacters(struct UObject* WorldContextObject); // Function FSD.ActorFunctionLibrary.UnlockCharacters // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x107f250
	float TimeSince(struct UObject* WorldContextObject, float Time); // Function FSD.ActorFunctionLibrary.TimeSince // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107f180
	void SetScalarParameters(struct FName ParameterName, float Value, struct TArray<struct UMaterialInstanceDynamic*> Materials); // Function FSD.ActorFunctionLibrary.SetScalarParameters // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x107ef10
	void PlayCueOnClient(struct APlayerController* Target, struct USoundCue* cue); // Function FSD.ActorFunctionLibrary.PlayCueOnClient // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x107edd0
	void PlayCueOnAll(struct UObject* WorldContextObject, struct USoundCue* cue); // Function FSD.ActorFunctionLibrary.PlayCueOnAll // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x107ed20
	float PingPong(float Time, float Length, bool normalize); // Function FSD.ActorFunctionLibrary.PingPong // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107ec20
	float MoveTowards(float current, float End, float step); // Function FSD.ActorFunctionLibrary.MoveTowards // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107e900
	void LockSpecificCharactersIfState(struct UObject* WorldContextObject, struct TArray<struct APlayerCharacter*> Characters, enum class ECharacterState stateToLock); // Function FSD.ActorFunctionLibrary.LockSpecificCharactersIfState // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x107e7b0
	void LockSpecificCharacters(struct UObject* WorldContextObject, struct TArray<struct APlayerCharacter*> Characters); // Function FSD.ActorFunctionLibrary.LockSpecificCharacters // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x107e6a0
	bool LockSpecificCharacterIfState(struct UObject* WorldContextObject, struct APlayerCharacter* Character, enum class ECharacterState LockIf, enum class ECharacterState LockTo); // Function FSD.ActorFunctionLibrary.LockSpecificCharacterIfState // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x107e570
	void LockCharacters(struct UObject* WorldContextObject); // Function FSD.ActorFunctionLibrary.LockCharacters // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x107e500
	struct UWindowWidget* LoadWindowWidgetClass(SoftClassProperty WidgetClass); // Function FSD.ActorFunctionLibrary.LoadWindowWidgetClass // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107e3f0
	struct UUserWidget* LoadWidgetClass(SoftClassProperty WidgetClass); // Function FSD.ActorFunctionLibrary.LoadWidgetClass // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107e2e0
	struct UObject* LoadClass(SoftClassProperty softReference); // Function FSD.ActorFunctionLibrary.LoadClass // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x107e1e0
	void KillActorWithEffects(struct AActor* Actor, struct USceneComponent* visualsToHide, struct USoundCue* deathSound, struct UFXSystemAsset* deathParticles, float particleScale, struct UPathfinderCollisionComponent* pathColliderToDisable); // Function FSD.ActorFunctionLibrary.KillActorWithEffects // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x107e030
	bool IsWeakPoint(struct UFSDPhysicalMaterial* Material); // Function FSD.ActorFunctionLibrary.IsWeakPoint // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107dfb0
	bool IsSingleplayer(struct UObject* WorldContextObject); // Function FSD.ActorFunctionLibrary.IsSingleplayer // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107df30
	bool IsInRangeOfLocalPlayer(struct AActor* toActor, float MinDistance, float MaxDistance); // Function FSD.ActorFunctionLibrary.IsInRangeOfLocalPlayer // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107de10
	bool IsCloseToLocalPlayer(struct AActor* toActor, float Distance); // Function FSD.ActorFunctionLibrary.IsCloseToLocalPlayer // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107dd40
	int32_t GetTotalHeroLevels(struct UObject* WorldContextObject, struct UPlayerCharacterID* characterID); // Function FSD.ActorFunctionLibrary.GetTotalHeroLevels // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107dc80
	struct FGuid GetSaveGameIDFromCharacterID(struct UPlayerCharacterID* characterID); // Function FSD.ActorFunctionLibrary.GetSaveGameIDFromCharacterID // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x107db60
	struct FGuid GetSavegameID(struct UObject* objectClass); // Function FSD.ActorFunctionLibrary.GetSavegameID // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x107dbf0
	struct TArray<struct APlayerCharacter*> GetPlayersInRange(struct UObject* WorldContextObject, struct FVector Origin, float Radius, bool MustBeAlive); // Function FSD.ActorFunctionLibrary.GetPlayersInRange // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x107d9b0
	struct UItemID* GetItemID(struct AActor* itemClass); // Function FSD.ActorFunctionLibrary.GetItemID // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107d8a0
	float GetHeroXP(struct UObject* WorldContextObject, struct UPlayerCharacterID* characterID); // Function FSD.ActorFunctionLibrary.GetHeroXP // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107d7e0
	struct FText GetHeroSwitchToMessage(struct APlayerCharacter* playerClass); // Function FSD.ActorFunctionLibrary.GetHeroSwitchToMessage // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107d6c0
	struct FString GetHeroSourceName(struct APlayerCharacter* playerClass); // Function FSD.ActorFunctionLibrary.GetHeroSourceName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107d5f0
	float GetHeroProgress(struct UObject* WorldContextObject, struct UPlayerCharacterID* characterID); // Function FSD.ActorFunctionLibrary.GetHeroProgress // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107d530
	struct FText GetHeroName(struct APlayerCharacter* playerClass); // Function FSD.ActorFunctionLibrary.GetHeroName // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107d450
	int32_t GetHeroLevel(struct UObject* WorldContextObject, struct UPlayerCharacterID* characterID); // Function FSD.ActorFunctionLibrary.GetHeroLevel // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107d390
	struct UInventoryList* GetHeroInventoryList(struct UPlayerCharacterID* characterID); // Function FSD.ActorFunctionLibrary.GetHeroInventoryList // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107d310
	struct FHeroInfo GetHeroInfo(struct APlayerCharacter* playerClass); // Function FSD.ActorFunctionLibrary.GetHeroInfo // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107d1b0
	struct UTexture2D* GetHeroImageSmall(struct APlayerCharacter* playerClass); // Function FSD.ActorFunctionLibrary.GetHeroImageSmall // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107d130
	struct UTexture2D* GetHeroImageFullSize(struct APlayerCharacter* playerClass); // Function FSD.ActorFunctionLibrary.GetHeroImageFullSize // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107d0b0
	struct UTexture2D* GetHeroImage(struct APlayerCharacter* playerClass); // Function FSD.ActorFunctionLibrary.GetHeroImage // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107d030
	struct FLinearColor GetHeroColor(struct APlayerCharacter* playerClass); // Function FSD.ActorFunctionLibrary.GetHeroColor // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x107cfa0
	struct UActorComponent* GetComponentFromClass(struct AActor* Actor, struct UActorComponent* ComponentClass); // Function FSD.ActorFunctionLibrary.GetComponentFromClass // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x107ce60
	struct UActorComponent* GetComponentByClass(struct AActor* Actor, struct UActorComponent* ComponentClass); // Function FSD.ActorFunctionLibrary.GetComponentByClass // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x107cda0
	struct UPlayerCharacterID* GetCharacterIDFromCharacter(struct APlayerCharacter* Character); // Function FSD.ActorFunctionLibrary.GetCharacterIDFromCharacter // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107cd20
	struct UPlayerCharacterID* GetCharacterID(struct APlayerCharacter* playerClass); // Function FSD.ActorFunctionLibrary.GetCharacterID // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107cca0
	struct TArray<struct APlayerCharacter*> GetAllPlayerCharacters(struct UObject* WorldContext); // Function FSD.ActorFunctionLibrary.GetAllPlayerCharacters // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107cbd0
	struct FVector GetActorTargetCenter(struct AActor* TargetActor); // Function FSD.ActorFunctionLibrary.GetActorTargetCenter // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x107cb40
	void FSDRemoveBlendable(struct UPostProcessComponent* PostProcessComponent, struct TScriptInterface<None> InBlendableObject); // Function FSD.ActorFunctionLibrary.FSDRemoveBlendable // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x107c1a0
	void FSDRemoveAllWidgets(struct UObject* WorldContextObject); // Function FSD.ActorFunctionLibrary.FSDRemoveAllWidgets // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x107c130
	void FSDDumpCallStack(struct FString Msg); // Function FSD.ActorFunctionLibrary.FSDDumpCallStack // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x107c0a0
	struct APlayerCharacter* FindNearestPlayerCharacter(struct UObject* WorldContextObject, struct FVector fromLocation, float MaxRadius, bool MustBeAlive, bool MustBeUnparalyzed, bool MustHaveLineOfSight); // Function FSD.ActorFunctionLibrary.FindNearestPlayerCharacter // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x107c970
	struct FVector FindLatejoinDroppodLocation(struct AFSDGameMode* GameMode); // Function FSD.ActorFunctionLibrary.FindLatejoinDroppodLocation // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x107c8e0
	struct AActor* FindClosestEnemyFromLocation(struct FVector fromLocation, float range, bool LineOfSightCheck, struct UObject* WorldContextObject, struct TArray<struct AActor*> IgnoredActors, struct FVector Offset); // Function FSD.ActorFunctionLibrary.FindClosestEnemyFromLocation // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x107c6e0
	struct AActor* FindClosestEnemyFromActor(struct AActor* FromActor, float range, bool LineOfSightCheck, struct FGameplayTagQuery tagQuery, struct FVector Offset); // Function FSD.ActorFunctionLibrary.FindClosestEnemyFromActor // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x107c4d0
	struct FVector FindCharacterTeleportLocation(struct UObject* WorldContextObject, struct FVector closeToLocation, float desiredDistance); // Function FSD.ActorFunctionLibrary.FindCharacterTeleportLocation // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x107c3b0
	void FadeMaterials(struct UObject* WorldContextObject, struct UMeshComponent* Mesh, float Duration); // Function FSD.ActorFunctionLibrary.FadeMaterials // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x107c2a0
	float EvaluateRuntimeCurve(struct UObject* WorldContextObject, struct FRuntimeFloatCurve Curve, float Time); // Function FSD.ActorFunctionLibrary.EvaluateRuntimeCurve // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x107bf40
	void DissolveMaterials(struct UObject* WorldContextObject, struct UMeshComponent* Mesh, float Duration); // Function FSD.ActorFunctionLibrary.DissolveMaterials // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x107bd70
	void DamagePlayersInArea(struct FVector Origin, struct AActor* Instigator, float Damage, float Radius, struct UDamageClass* DamageClass); // Function FSD.ActorFunctionLibrary.DamagePlayersInArea // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x107bbe0
	struct UHealthComponentBase* DamageIfInRange(float MaxDistance, float Damage, struct AActor* Target, struct AActor* Attacker, struct UDamageClass* DamageClass); // Function FSD.ActorFunctionLibrary.DamageIfInRange // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x107ba60
	void DamageAllInAreaExcept(struct FVector Origin, struct AActor* Instigator, float Damage, float BlastRadius, float MaxDamageRadius, float minDamagePercent, struct TArray<struct AActor*> IgnoreActors, float friendlyFireModifier, struct UDamageClass* DamageClass); // Function FSD.ActorFunctionLibrary.DamageAllInAreaExcept // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x107b7c0
	void DamageAllInArea(struct FVector Origin, struct AActor* Instigator, float Damage, float BlastRadius, float MaxDamageRadius, float minDamagePercent, float friendlyFireModifier, struct UDamageClass* DamageClass); // Function FSD.ActorFunctionLibrary.DamageAllInArea // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x107b570
	struct TArray<struct UMaterialInstanceDynamic*> CreateDynamicMaterialInstances(struct UMeshComponent* Mesh); // Function FSD.ActorFunctionLibrary.CreateDynamicMaterialInstances // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x107b4a0
	float AddHeroXP(struct UObject* WorldContextObject, struct UPlayerCharacterID* characterID, float Amount); // Function FSD.ActorFunctionLibrary.AddHeroXP // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x107b2e0
	void AddEnemyKill(struct APlayerCharacter* Instigator, struct UEnemyComponent* EnemyComponent, struct AFSDGameState* GameState); // Function FSD.ActorFunctionLibrary.AddEnemyKill // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x107b1f0
	bool ActorMatchesTagQuery(struct FGameplayTagQuery Query, struct AActor* InActor); // Function FSD.ActorFunctionLibrary.ActorMatchesTagQuery // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x107b0c0
};

// Class FSD.StatusEffectsFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UStatusEffectsFunctionLibrary : UBlueprintFunctionLibrary {

	float GetMaxResistance(struct UStatusEffect* StatusEffect); // Function FSD.StatusEffectsFunctionLibrary.GetMaxResistance // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107d920
	struct UDamageClass* GetDamageClass(struct UStatusEffect* StatusEffect); // Function FSD.StatusEffectsFunctionLibrary.GetDamageClass // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107cf20
	bool CanTrigger(struct UStatusEffect* StatusEffect, struct AActor* OtherActor); // Function FSD.StatusEffectsFunctionLibrary.CanTrigger // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107b3e0
};

// Class FSD.FrontendBlueprintLibrary
// Size: 0x28 (Inherited: 0x28)
struct UFrontendBlueprintLibrary : UBlueprintFunctionLibrary {

	void OpenURLInExternalBrowser(struct FString URL); // Function FSD.FrontendBlueprintLibrary.OpenURLInExternalBrowser // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x107eb50
	bool IsShippingBuild(); // Function FSD.FrontendBlueprintLibrary.IsShippingBuild // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107df00
	enum class EFSDTargetPlatform FSDTargetPlatform(); // Function FSD.FrontendBlueprintLibrary.FSDTargetPlatform // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x107c270
};

// Class FSD.ActorStateComponent
// Size: 0x100 (Inherited: 0xb0)
struct UActorStateComponent : UActorComponent {
	struct FMulticastInlineDelegate OnBeginState; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnTickState; // 0xc0(0x10)
	struct FMulticastInlineDelegate OnEndState; // 0xd0(0x10)
	struct UActorStateComponent* CurrentState; // 0xe0(0x08)
	struct UActorStateComponent* NextState; // 0xe8(0x08)
	struct UActorStateComponent* MasterState; // 0xf0(0x08)
	float StateActiveTime; // 0xf8(0x04)
	char pad_FC[0x4]; // 0xfc(0x04)

	void OnRep_CurrentState(struct UActorStateComponent* PreviousState); // Function FSD.ActorStateComponent.OnRep_CurrentState // (Final|Native|Protected) // @ game+0x1083e70
	bool IsStateActive(); // Function FSD.ActorStateComponent.IsStateActive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10836c0
	void GotoState(); // Function FSD.ActorStateComponent.GotoState // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x10835b0
};

// Class FSD.FSDUserWidget
// Size: 0x250 (Inherited: 0x230)
struct UFSDUserWidget : UUserWidget {
	struct FMulticastInlineDelegate OnVisibilityChanged; // 0x230(0x10)
	char pad_240[0x8]; // 0x240(0x08)
	struct APlayerCharacter* Character; // 0x248(0x08)

	void SetOpacity(float alpha); // Function FSD.FSDUserWidget.SetOpacity // (Final|Native|Protected|BlueprintCallable) // @ game+0x11399e0
	void ScaleByBaseResolution(); // Function FSD.FSDUserWidget.ScaleByBaseResolution // (Final|Native|Public|BlueprintCallable) // @ game+0x1139350
	void Refresh(); // Function FSD.FSDUserWidget.Refresh // (Native|Protected|BlueprintCallable) // @ game+0x1139330
	void ReceiveNewVisibility(enum class ESlateVisibility NewVisibility); // Function FSD.FSDUserWidget.ReceiveNewVisibility // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void OnCloseMenuReleased(bool Handled); // Function FSD.FSDUserWidget.OnCloseMenuReleased // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x158ca90
	void OnCloseMenuPressed(bool Handled); // Function FSD.FSDUserWidget.OnCloseMenuPressed // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x158ca90
	bool HasCharacter(); // Function FSD.FSDUserWidget.HasCharacter // (Final|Native|Protected|BlueprintCallable) // @ game+0x11384c0
	float GetOpacity(); // Function FSD.FSDUserWidget.GetOpacity // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x1137e70
	struct AFSDPlayerState* GetFSDPlayerState(); // Function FSD.FSDUserWidget.GetFSDPlayerState // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x1137a10
	struct AItem* GetEquippedItem(); // Function FSD.FSDUserWidget.GetEquippedItem // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x11379e0
	float GetBaseResolutionScale(); // Function FSD.FSDUserWidget.GetBaseResolutionScale // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1137890
	void BP_OnRefresh(); // Function FSD.FSDUserWidget.BP_OnRefresh // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
};

// Class FSD.ActorTrackingWidget
// Size: 0x278 (Inherited: 0x250)
struct UActorTrackingWidget : UFSDUserWidget {
	struct TWeakObjectPtr<struct USceneComponent> TargetComponent; // 0x250(0x08)
	float WorldHeightOffset; // 0x258(0x04)
	float ScaleBy; // 0x25c(0x04)
	struct FMargin ScreenMargin; // 0x260(0x10)
	int32_t WidgetZOrder; // 0x270(0x04)
	bool bTrackCenterOfMass; // 0x274(0x01)
	bool bHideWhenPlayerNearby; // 0x275(0x01)
	char pad_276[0x2]; // 0x276(0x02)

	void SetTargetComponent(struct USceneComponent* Component); // Function FSD.ActorTrackingWidget.SetTargetComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x10842d0
	void SetTarget(struct AActor* Actor); // Function FSD.ActorTrackingWidget.SetTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x1084250
	void OnTargetSet(struct AActor* NewTarget); // Function FSD.ActorTrackingWidget.OnTargetSet // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void OnTargetDistanceChanged(float Distance); // Function FSD.ActorTrackingWidget.OnTargetDistanceChanged // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void OnShow(); // Function FSD.ActorTrackingWidget.OnShow // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void OnInViewChanged(bool inView, float Angle); // Function FSD.ActorTrackingWidget.OnInViewChanged // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	struct AActor* GetTarget(); // Function FSD.ActorTrackingWidget.GetTarget // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1083540
	struct FVector2D GetRenderTranslation(); // Function FSD.ActorTrackingWidget.GetRenderTranslation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1083510
	bool FindScreenPosition(struct APlayerController* PlayerController, struct FVector WorldLocation, struct FMargin Margin, struct FVector ScreenCord, float Angle); // Function FSD.ActorTrackingWidget.FindScreenPosition // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1082ba0
	struct UActorTrackingWidget* CreateTrackingWidget(struct APlayerController* PlayerController, struct UActorTrackingWidget* WidgetType, struct USceneComponent* TargetComponent); // Function FSD.ActorTrackingWidget.CreateTrackingWidget // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1082ab0
};

// Class FSD.ActorTrackingComponent
// Size: 0x210 (Inherited: 0x1f0)
struct UActorTrackingComponent : USceneComponent {
	struct UActorTrackingWidget* WidgetType; // 0x1f0(0x08)
	bool VisibleOnHoldTAB; // 0x1f8(0x01)
	bool VisibleFromStart; // 0x1f9(0x01)
	bool bIconHidden; // 0x1fa(0x01)
	char pad_1FB[0x1]; // 0x1fb(0x01)
	struct TWeakObjectPtr<struct UActorTrackingWidget> Widget; // 0x1fc(0x08)
	char pad_204[0xc]; // 0x204(0x0c)

	void ToggleIcon(bool Visible); // Function FSD.ActorTrackingComponent.ToggleIcon // (Final|Native|Public|BlueprintCallable) // @ game+0x1083a80
	void OnHoldTAB(bool IsDown); // Function FSD.ActorTrackingComponent.OnHoldTAB // (Final|Native|Protected) // @ game+0x1083a80
	bool IsIconVisible(); // Function FSD.ActorTrackingComponent.IsIconVisible // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1083650
};

// Class FSD.AdicPuddle
// Size: 0x248 (Inherited: 0x220)
struct AAdicPuddle : AActor {
	struct USphereComponent* SphereTrigger; // 0x220(0x08)
	struct USoundBase* SpawnSound; // 0x228(0x08)
	struct UStatusEffect* InflictedStatusEffect; // 0x230(0x08)
	char pad_238[0x8]; // 0x238(0x08)
	float LifeTime; // 0x240(0x04)
	char pad_244[0x4]; // 0x244(0x04)

	void OnPuddleEndOverLap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function FSD.AdicPuddle.OnPuddleEndOverLap // (Native|Protected) // @ game+0x1083d10
	void OnPuddleBeginOverLap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function FSD.AdicPuddle.OnPuddleBeginOverLap // (Native|Protected|HasOutParms) // @ game+0x1083b10
};

// Class FSD.AdventureObjective
// Size: 0x178 (Inherited: 0x178)
struct UAdventureObjective : UObjective {
};

// Class FSD.AfflictionEffect
// Size: 0x28 (Inherited: 0x28)
struct UAfflictionEffect : UObject {

	bool ShouldInstantiate(); // Function FSD.AfflictionEffect.ShouldInstantiate // (Native|Event|Public|BlueprintEvent|Const) // @ game+0xbaf250
	void ReceiveEndEffect(struct UPawnAfflictionComponent* Target); // Function FSD.AfflictionEffect.ReceiveEndEffect // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void ReceiveBeginEffect(struct UPawnAfflictionComponent* Target); // Function FSD.AfflictionEffect.ReceiveBeginEffect // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
};

// Class FSD.PawnFrozenUniqueAfflictionEffect
// Size: 0x28 (Inherited: 0x28)
struct UPawnFrozenUniqueAfflictionEffect : UAfflictionEffect {
};

// Class FSD.PawnBurningUniqueAfflictionEffect
// Size: 0x28 (Inherited: 0x28)
struct UPawnBurningUniqueAfflictionEffect : UAfflictionEffect {
};

// Class FSD.SpawnAtLocationParticleAfflictionEffect
// Size: 0x38 (Inherited: 0x28)
struct USpawnAtLocationParticleAfflictionEffect : UAfflictionEffect {
	struct FScaledEffect ScaledParticleEffect; // 0x28(0x10)
};

// Class FSD.AttachedParticlesAfflictionEffect
// Size: 0x48 (Inherited: 0x28)
struct UAttachedParticlesAfflictionEffect : UAfflictionEffect {
	struct UFXSystemAsset* ParticleEffect; // 0x28(0x08)
	struct TArray<struct UFXSystemAsset*> ParticleEffects; // 0x30(0x10)
	enum class EAfflictionSocket Socket; // 0x40(0x01)
	bool ScaleToActor; // 0x41(0x01)
	bool UseVisibilityHack; // 0x42(0x01)
	char pad_43[0x5]; // 0x43(0x05)
};

// Class FSD.CharacterShoutAfflictionEffect
// Size: 0x30 (Inherited: 0x28)
struct UCharacterShoutAfflictionEffect : UAfflictionEffect {
	struct UDialogDataAsset* Shout; // 0x28(0x08)
};

// Class FSD.CameraParticleAfflictionEffect
// Size: 0x30 (Inherited: 0x28)
struct UCameraParticleAfflictionEffect : UAfflictionEffect {
	struct UParticleSystem* ParticleEffect; // 0x28(0x08)
};

// Class FSD.ShieldLinkedAfflictionEffect
// Size: 0x28 (Inherited: 0x28)
struct UShieldLinkedAfflictionEffect : UAfflictionEffect {
};

// Class FSD.SoundAfflictionEffect
// Size: 0x48 (Inherited: 0x28)
struct USoundAfflictionEffect : UAfflictionEffect {
	struct USoundCue* BeginSound; // 0x28(0x08)
	struct USoundCue* EndSound; // 0x30(0x08)
	bool Attach; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	struct FName AttachBone; // 0x3c(0x08)
	float FadeOnLoopEndDuration; // 0x44(0x04)
};

// Class FSD.AttachMeshesAfflictionEffect
// Size: 0x40 (Inherited: 0x28)
struct UAttachMeshesAfflictionEffect : UAfflictionEffect {
	struct TArray<struct FAttachMeshesAfflictionItem> AttachItems; // 0x28(0x10)
	struct UParticleSystem* OnRemoveEffect; // 0x38(0x08)
};

// Class FSD.FrozenAfflictionEffect
// Size: 0x58 (Inherited: 0x28)
struct UFrozenAfflictionEffect : UAfflictionEffect {
	struct TArray<struct FFrozenAfflictionItem> IceParts; // 0x28(0x10)
	struct UMaterialInterface* MaterialOverride; // 0x38(0x08)
	struct FName ParticleBone; // 0x40(0x08)
	struct TArray<struct UMaterialInterface*> IceMaterials; // 0x48(0x10)
};

// Class FSD.BurningAfflictionEffect
// Size: 0x30 (Inherited: 0x28)
struct UBurningAfflictionEffect : UAfflictionEffect {
	enum class EFrozenBitsSize FireParticleSize; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
};

// Class FSD.StaggeredAfflictionEffect
// Size: 0x30 (Inherited: 0x28)
struct UStaggeredAfflictionEffect : UAfflictionEffect {
	float StaggerStrength; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// Class FSD.BoneParticlesAfflictionEffect
// Size: 0x40 (Inherited: 0x28)
struct UBoneParticlesAfflictionEffect : UAfflictionEffect {
	struct TArray<struct UParticleSystem*> Particles; // 0x28(0x10)
	struct USoundCue* Sound; // 0x38(0x08)
};

// Class FSD.AnimatedItemParticleAfflictionEffect
// Size: 0x40 (Inherited: 0x28)
struct UAnimatedItemParticleAfflictionEffect : UAfflictionEffect {
	enum class EItemCategory ItemCategory; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
	struct UParticleSystem* ParticleEffect; // 0x30(0x08)
	struct FName Socket; // 0x38(0x08)
};

// Class FSD.PlayerCharacterMontageAfflictionEffect
// Size: 0x50 (Inherited: 0x28)
struct UPlayerCharacterMontageAfflictionEffect : UAfflictionEffect {
	struct UAnimMontage* FP_Montage; // 0x28(0x08)
	struct UAnimMontage* TP_Montage; // 0x30(0x08)
	float BlendOut; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct TArray<struct FName> RandomStarts; // 0x40(0x10)
};

// Class FSD.EnemySkinAfflictionEffect
// Size: 0x38 (Inherited: 0x28)
struct UEnemySkinAfflictionEffect : UAfflictionEffect {
	struct TArray<struct UMaterialInterface*> NewMaterials; // 0x28(0x10)
};

// Class FSD.EnemyScaleAfflictionEffect
// Size: 0x30 (Inherited: 0x28)
struct UEnemyScaleAfflictionEffect : UAfflictionEffect {
	float Scale; // 0x28(0x04)
	bool RevertOnEndEffect; // 0x2c(0x01)
	char pad_2D[0x3]; // 0x2d(0x03)
};

// Class FSD.HeroEnemyAfflictionEffect
// Size: 0x30 (Inherited: 0x28)
struct UHeroEnemyAfflictionEffect : UAfflictionEffect {
	struct FGameplayTag TagToAdd; // 0x28(0x08)
};

// Class FSD.FSDPawn
// Size: 0x2f0 (Inherited: 0x280)
struct AFSDPawn : APawn {
	char pad_280[0x18]; // 0x280(0x18)
	struct FMulticastInlineDelegate OnFrozenEvent; // 0x298(0x10)
	struct UStatusEffectsComponent* StatusEffects; // 0x2a8(0x08)
	struct UEnemyTemperatureComponent* Temperature; // 0x2b0(0x08)
	struct FGameplayTagContainer GameplayTags; // 0x2b8(0x20)
	struct UEnemyDescriptor* SpawnedFromDescriptor; // 0x2d8(0x08)
	bool IsFrozen; // 0x2e0(0x01)
	bool CanFlee; // 0x2e1(0x01)
	bool FleeInsteadOfBackingOff; // 0x2e2(0x01)
	bool IsFleeing; // 0x2e3(0x01)
	char pad_2E4[0x4]; // 0x2e4(0x04)
	struct UPawnStatsComponent* PawnStatsInstance; // 0x2e8(0x08)

	void UnFreeze(); // Function FSD.FSDPawn.UnFreeze // (Native|Public|BlueprintCallable) // @ game+0x1123df0
	void StopFleeing(); // Function FSD.FSDPawn.StopFleeing // (Native|Public|BlueprintCallable) // @ game+0x1123bc0
	void StartFleeing(struct FVector fromLocation); // Function FSD.FSDPawn.StartFleeing // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1123b10
	void SetAlerted(bool isAlerted); // Function FSD.FSDPawn.SetAlerted // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1123290
	void Receive_Alerted(); // Function FSD.FSDPawn.Receive_Alerted // (BlueprintAuthorityOnly|Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void OnUnFrozen(); // Function FSD.FSDPawn.OnUnFrozen // (Native|Event|Protected|BlueprintEvent) // @ game+0x1122630
	void OnStoppedFleeing(); // Function FSD.FSDPawn.OnStoppedFleeing // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void OnStartedFleeing(); // Function FSD.FSDPawn.OnStartedFleeing // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void OnRep_IsFrozen(); // Function FSD.FSDPawn.OnRep_IsFrozen // (Final|Native|Protected) // @ game+0x11223e0
	void OnFrozen(struct AActor* Source); // Function FSD.FSDPawn.OnFrozen // (Native|Event|Protected|BlueprintEvent) // @ game+0x11222d0
	void OnFirstHostileDamageTaken(); // Function FSD.FSDPawn.OnFirstHostileDamageTaken // (BlueprintAuthorityOnly|Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void OnEnemyScaled(float newScale); // Function FSD.FSDPawn.OnEnemyScaled // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void OnArmorShattered(struct FVector Location); // Function FSD.FSDPawn.OnArmorShattered // (Final|Native|Protected|HasOutParms|HasDefaults) // @ game+0x1122220
	void OnAlerted(); // Function FSD.FSDPawn.OnAlerted // (Final|Native|Protected) // @ game+0x1122200
	void MakeRagdollMesh(struct USkeletalMeshComponent* Mesh); // Function FSD.FSDPawn.MakeRagdollMesh // (Final|Native|Public|BlueprintCallable) // @ game+0x1122180
	void MakeElite(); // Function FSD.FSDPawn.MakeElite // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	bool GetIsAlerted(); // Function FSD.FSDPawn.GetIsAlerted // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11219b0
	struct UHealthComponentBase* GetHealthComponent(); // Function FSD.FSDPawn.GetHealthComponent // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1121860
	struct AFSDAIController* GetFSDAIController(); // Function FSD.FSDPawn.GetFSDAIController // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1121800
	enum class EPawnAttitude GetAttitude(); // Function FSD.FSDPawn.GetAttitude // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11217d0
	void Freeze(struct AActor* Source); // Function FSD.FSDPawn.Freeze // (Native|Public|BlueprintCallable) // @ game+0x1121740
	void ExplodePawn(); // Function FSD.FSDPawn.ExplodePawn // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1121670
	void BackOffFromLocation(struct FVector fromLocation); // Function FSD.FSDPawn.BackOffFromLocation // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1120960
};

// Class FSD.DeepPathfinderCharacter
// Size: 0x380 (Inherited: 0x2f0)
struct ADeepPathfinderCharacter : AFSDPawn {
	char pad_2F0[0x10]; // 0x2f0(0x10)
	struct UDeepPathfinderMovement* PathfinderMovement; // 0x300(0x08)
	struct USkeletalMeshComponent* Mesh; // 0x308(0x08)
	struct FName CenterMassSocketName; // 0x310(0x08)
	struct UDeepPatherFinderCharacterAfflictionComponent* Affliction; // 0x318(0x08)
	float AnimationOffset; // 0x320(0x04)
	bool CanPlayerStandOn; // 0x324(0x01)
	bool UseDormancy; // 0x325(0x01)
	char pad_326[0x2]; // 0x326(0x02)
	float StaggerDurationMultiplier; // 0x328(0x04)
	float StaggerImunityWindow; // 0x32c(0x04)
	bool StaggerPauseLogic; // 0x330(0x01)
	bool IsHidden; // 0x331(0x01)
	bool IsStaggered; // 0x332(0x01)
	bool FrozenPauseLogic; // 0x333(0x01)
	char pad_334[0x1c]; // 0x334(0x1c)
	float AttackerRadius; // 0x350(0x04)
	char pad_354[0x4]; // 0x354(0x04)
	struct TArray<struct UMaterialInterface*> CachedMaterials; // 0x358(0x10)
	float AllowedInFormationChance; // 0x368(0x04)
	char pad_36C[0x14]; // 0x36c(0x14)

	bool TryJoinFormation(); // Function FSD.DeepPathfinderCharacter.TryJoinFormation // (Final|Native|Public|BlueprintCallable) // @ game+0x10c5fc0
	void SetHidden(bool shouldHide); // Function FSD.DeepPathfinderCharacter.SetHidden // (Final|Native|Public|BlueprintCallable) // @ game+0x10c5800
	void OnPausedMovementElapsed(); // Function FSD.DeepPathfinderCharacter.OnPausedMovementElapsed // (Final|Native|Protected) // @ game+0x10c5270
	void OnControlledByPlayer(bool IsControlled, bool IsLocallyControlled); // Function FSD.DeepPathfinderCharacter.OnControlledByPlayer // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void LeaveFormation(); // Function FSD.DeepPathfinderCharacter.LeaveFormation // (Final|Native|Public|BlueprintCallable) // @ game+0x10c4e00
};

// Class FSD.EnemyDeepPathfinderCharacter
// Size: 0x3a0 (Inherited: 0x380)
struct AEnemyDeepPathfinderCharacter : ADeepPathfinderCharacter {
	char pad_380[0x8]; // 0x380(0x08)
	struct UEnemyHealthComponent* HealthComponent; // 0x388(0x08)
	struct FQueuedMontage QueuedMontage; // 0x390(0x10)

	void OnRep_QueuedMontage(); // Function FSD.EnemyDeepPathfinderCharacter.OnRep_QueuedMontage // (Final|Native|Protected) // @ game+0x10c5400
};

// Class FSD.AFlyingBug
// Size: 0x448 (Inherited: 0x3a0)
struct AAFlyingBug : AEnemyDeepPathfinderCharacter {
	struct UEnemyComponent* EnemyComponent; // 0x3a0(0x08)
	struct UPawnStatsComponent* PawnStats; // 0x3a8(0x08)
	struct UOutlineComponent* outline; // 0x3b0(0x08)
	struct UPawnSensingComponent* Senses; // 0x3b8(0x08)
	struct UPawnAlertComponent* Alert; // 0x3c0(0x08)
	struct USphereComponent* ExplosionSphere; // 0x3c8(0x08)
	struct UAudioComponent* WingSoundComponent; // 0x3d0(0x08)
	struct UFrozenPawnImpactComponent* FrozenImpact; // 0x3d8(0x08)
	struct TArray<struct UAnimSequenceBase*> HitReactions; // 0x3e0(0x10)
	struct FVector_NetQuantize RagdollImpact; // 0x3f0(0x0c)
	char pad_3FC[0x14]; // 0x3fc(0x14)
	struct AActor* RotateTarget; // 0x410(0x08)
	struct UPhysicsAsset* PhysicalAssetAfterDeath; // 0x418(0x08)
	struct USoundBase* ChatterSound; // 0x420(0x08)
	float FirstHitReactBlendIn; // 0x428(0x04)
	float OverrideHitReactBlendIn; // 0x42c(0x04)
	float DistanceForAttackMode; // 0x430(0x04)
	float MinChatterDelay; // 0x434(0x04)
	float MaxChatterDelay; // 0x438(0x04)
	float AttackModeRotationSpeed; // 0x43c(0x04)
	bool UsesAttackStance; // 0x440(0x01)
	bool SetLifeTime; // 0x441(0x01)
	bool AttackStance; // 0x442(0x01)
	bool LookStraight; // 0x443(0x01)
	bool UseDefaultRagdoll; // 0x444(0x01)
	char pad_445[0x3]; // 0x445(0x03)

	void StartFizzle(); // Function FSD.AFlyingBug.StartFizzle // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void SetRotateTarget(struct AActor* aTarget); // Function FSD.AFlyingBug.SetRotateTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x10841d0
	void SetExternallyControlled(bool isExternallyControlled); // Function FSD.AFlyingBug.SetExternallyControlled // (Final|Native|Public|BlueprintCallable) // @ game+0x1084140
	void SetAttackStance(bool isAttackStance); // Function FSD.AFlyingBug.SetAttackStance // (BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x10840b0
	void Ragdoll(bool applyForce, struct FVector force); // Function FSD.AFlyingBug.Ragdoll // (Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1083f50
	void PlayVoice(); // Function FSD.AFlyingBug.PlayVoice // (Final|Native|Protected) // @ game+0x1083f30
	void OnStartFalling(); // Function FSD.AFlyingBug.OnStartFalling // (Final|Native|Public) // @ game+0x1083f10
	void OnRep_RagdollImpact(); // Function FSD.AFlyingBug.OnRep_RagdollImpact // (Native|Public) // @ game+0x1083ef0
	void OnRep_AttackStance(); // Function FSD.AFlyingBug.OnRep_AttackStance // (Final|Native|Protected|BlueprintCallable) // @ game+0x1083e50
	void OnRagdoll(); // Function FSD.AFlyingBug.OnRagdoll // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void OnFreezeImpact(); // Function FSD.AFlyingBug.OnFreezeImpact // (Final|Native|Public) // @ game+0x1083a60
	void OnDamaged(float Amount); // Function FSD.AFlyingBug.OnDamaged // (Native|Public) // @ game+0x10839e0
	void OnBugDeath(struct UHealthComponentBase* Health); // Function FSD.AFlyingBug.OnBugDeath // (Native|Public) // @ game+0x1083950
	float GetMidZpointFromCielingAndFloor(float distanceFromCieling, float distanceFromFloor); // Function FSD.AFlyingBug.GetMidZpointFromCielingAndFloor // (Final|Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1083210
	bool GetIsInAttackStance(); // Function FSD.AFlyingBug.GetIsInAttackStance // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10831f0
	void AlertNearbyEnemies(); // Function FSD.AFlyingBug.AlertNearbyEnemies // (Event|Public|BlueprintEvent) // @ game+0x158ca90
};

// Class FSD.EnemyAnimInstance
// Size: 0x2c0 (Inherited: 0x270)
struct UEnemyAnimInstance : UAnimInstance {
	struct FMulticastInlineDelegate OnRangedAttackNotify; // 0x268(0x10)
	struct FMulticastInlineDelegate OnMeleeAttackNotify; // 0x278(0x10)
	struct FMulticastInlineDelegate OnStopLeadingNotify; // 0x288(0x10)
	struct FMulticastInlineDelegate OnIsAttackingChanged; // 0x298(0x10)
	bool IsAttacking; // 0x2a8(0x01)
	bool IsAlive; // 0x2a9(0x01)
	float RandomStartPosition; // 0x2ac(0x04)
	struct UHealthComponentBase* HealthComponent; // 0x2b0(0x08)
	char pad_2BE[0x2]; // 0x2be(0x02)

	bool IsSlotPlayingAnyAnimation(struct FName SlotNodeName); // Function FSD.EnemyAnimInstance.IsSlotPlayingAnyAnimation // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10d9070
	struct USkeletalMeshComponent* GetSkeletalMesh(); // Function FSD.EnemyAnimInstance.GetSkeletalMesh // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10d9050
};

// Class FSD.SimpleMovingEnemyAnimInstance
// Size: 0x2f0 (Inherited: 0x2c0)
struct USimpleMovingEnemyAnimInstance : UEnemyAnimInstance {
	float Speed; // 0x2b8(0x04)
	struct FVector Velocity; // 0x2bc(0x0c)
	float WalkCycleSpeed; // 0x2c8(0x04)
	float StartMovingSpeed; // 0x2cc(0x04)
	float StopMovingSpeed; // 0x2d0(0x04)
	float WalkCycleMinRate; // 0x2d4(0x04)
	float WalkCyclePlayRate; // 0x2d8(0x04)
	float MeshScale; // 0x2dc(0x04)
	bool IsMoving; // 0x2e0(0x01)
	char pad_2E9[0x7]; // 0x2e9(0x07)

	void SetMeshScale(float newScale); // Function FSD.SimpleMovingEnemyAnimInstance.SetMeshScale // (Final|Native|Public|BlueprintCallable) // @ game+0x1205740
};

// Class FSD.FlyingBugAnimInstance
// Size: 0x2f0 (Inherited: 0x2f0)
struct UFlyingBugAnimInstance : USimpleMovingEnemyAnimInstance {
	bool IsInAttackMode; // 0x2e8(0x01)
	bool IsStaggered; // 0x2e9(0x01)
};

// Class FSD.AIFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAIFunctionLibrary : UBlueprintFunctionLibrary {

	void SetAICanSense(bool canSense); // Function FSD.AIFunctionLibrary.SetAICanSense // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1084030
	int32_t MakeEnemiesFleeFromArea(struct UObject* WorldContextObject, struct FVector Center, float Radius, int32_t maxEnemiesAffected); // Function FSD.AIFunctionLibrary.MakeEnemiesFleeFromArea // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1083800
	void MakeEnemiesBackOutOfArea(struct UObject* WorldContextObject, struct FVector Center, float Radius); // Function FSD.AIFunctionLibrary.MakeEnemiesBackOutOfArea // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x10836f0
	bool IsEnemyAlertet(struct APawn* enemy); // Function FSD.AIFunctionLibrary.IsEnemyAlertet // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x10835d0
	struct APlayerCharacter* GetPlayerTarget(struct AActor* From, float MaxDistance, bool MustBeAlive, bool MustBeUnparalyzed, bool accountForAttackers, struct AActor* ignoreTarget, bool IsFlying); // Function FSD.AIFunctionLibrary.GetPlayerTarget // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1083300
	bool GetAttackableTargetsInRange(struct AActor* From, struct TArray<struct UAttackerPositioningComponent*> outArray, float MaxDistance, bool MustBeAlive, bool MustBeUnparalyzed, bool accountForAttackers, struct AActor* ignoreTarget, bool IsFlying); // Function FSD.AIFunctionLibrary.GetAttackableTargetsInRange // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1082f70
	struct UAttackerPositioningComponent* GetAttackableTarget(struct AActor* From, float MaxDistance, bool MustBeAlive, bool MustBeUnparalyzed, bool accountForAttackers, struct AActor* ignoreTarget, bool IsFlying); // Function FSD.AIFunctionLibrary.GetAttackableTarget // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1082d60
	struct APlayerCharacter* ConsiderChangingTarget(struct APlayerCharacter* CurrentTarget, struct AActor* From, float MaxDistance, bool MustBeAlive, bool MustBeUnparalyzed, bool CurrentTargetMustBeAlive, bool IsFlying); // Function FSD.AIFunctionLibrary.ConsiderChangingTarget // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x10828b0
	void AlertEnemy(struct APawn* enemy); // Function FSD.AIFunctionLibrary.AlertEnemy // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1082840
	void AlertEnemiesInRange(struct UObject* WorldContextObject, struct FVector Origin, float range, struct APawn* alerter); // Function FSD.AIFunctionLibrary.AlertEnemiesInRange // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x10826f0
};

// Class FSD.AIPlayerControlComponent
// Size: 0x160 (Inherited: 0xb0)
struct UAIPlayerControlComponent : UActorComponent {
	struct FRotator AngularAcceleration; // 0xb0(0x0c)
	struct FRotator AngularDampening; // 0xbc(0x0c)
	struct FRotator MaxAngularVelocity; // 0xc8(0x0c)
	struct FRotator MaxRotation; // 0xd4(0x0c)
	float SpeedTarget; // 0xe0(0x04)
	float SpeedMin; // 0xe4(0x04)
	float SpeedMax; // 0xe8(0x04)
	float AccelerationBase; // 0xec(0x04)
	float AccelerationMultiplier; // 0xf0(0x04)
	float DecelerationMultiplier; // 0xf4(0x04)
	float AccelerationOnSlopeMultiplier; // 0xf8(0x04)
	float DecelerationOnSlopeMultiplier; // 0xfc(0x04)
	float InitialConnectionBlendTime; // 0x100(0x04)
	char pad_104[0x4]; // 0x104(0x04)
	struct UAnimMontage* GetOnMontageAI; // 0x108(0x08)
	struct UAnimMontage* GetOnMontagePlayer; // 0x110(0x08)
	struct UAnimMontage* LetGoMontageAI; // 0x118(0x08)
	struct UAnimMontage* LetGoMontagePlayer; // 0x120(0x08)
	struct UDialogDataAsset* GetOnShout; // 0x128(0x08)
	struct UDialogDataAsset* LetGoShout; // 0x130(0x08)
	struct UControlEnemyUsable* Usable; // 0x138(0x08)
	char pad_140[0x20]; // 0x140(0x20)
};

// Class FSD.EnemyGroupDescriptor
// Size: 0x50 (Inherited: 0x30)
struct UEnemyGroupDescriptor : UDataAsset {
	struct TArray<struct FEnemyGroupDescriptorItem> Enemies; // 0x30(0x10)
	struct FRandInterval Diversity; // 0x40(0x10)
};

// Class FSD.AmberEventEnemyPool
// Size: 0x68 (Inherited: 0x50)
struct UAmberEventEnemyPool : UEnemyGroupDescriptor {
	float MaxTimeBetweenSpawn; // 0x50(0x04)
	float MinTimeBetweenSpawn; // 0x54(0x04)
	int32_t MaxEnemyCap; // 0x58(0x04)
	int32_t AmbersNeededdToComplete; // 0x5c(0x04)
	int32_t AmbersNeededOnePlayer; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
};

// Class FSD.GameEvent
// Size: 0x358 (Inherited: 0x220)
struct AGameEvent : AActor {
	char pad_220[0x8]; // 0x220(0x08)
	struct FMulticastInlineDelegate EventTriggeredDelegate; // 0x228(0x10)
	struct FMulticastInlineDelegate EventFinishedDelegate; // 0x238(0x10)
	struct FMulticastInlineDelegate StageCompleteDelegate; // 0x248(0x10)
	struct FMulticastInlineDelegate ProgressChangedDelegate; // 0x258(0x10)
	struct FMulticastInlineDelegate TimeProgressChanged; // 0x268(0x10)
	struct FMulticastInlineDelegate ObjectivesPerStageChanged; // 0x278(0x10)
	struct TArray<struct AEventStarterButton*> StarterObjects; // 0x288(0x10)
	bool bGameEventSetup; // 0x298(0x01)
	char pad_299[0x7]; // 0x299(0x07)
	struct FText EventName; // 0x2a0(0x18)
	struct FText ObjectiveText; // 0x2b8(0x18)
	struct FName AnalyticsName; // 0x2d0(0x08)
	struct FGameplayTagContainer GameplayTags; // 0x2d8(0x20)
	struct UChildActorComponent* StartEventObject; // 0x2f8(0x08)
	struct UDialogDataAsset* EventTriggeredShout; // 0x300(0x08)
	struct UDialogDataAsset* EventFinishedShout; // 0x308(0x08)
	struct UDialogDataAsset* EventFailedShout; // 0x310(0x08)
	float EventTriggeredShoutDelay; // 0x318(0x04)
	float EventFinishedShoutDelay; // 0x31c(0x04)
	float StageProgress; // 0x320(0x04)
	float TimeLimit; // 0x324(0x04)
	float DelayUITime; // 0x328(0x04)
	char pad_32C[0x4]; // 0x32c(0x04)
	int32_t objectivesPerStage; // 0x330(0x04)
	char pad_334[0x4]; // 0x334(0x04)
	bool EventStartersActive; // 0x338(0x01)
	bool StopScriptedWavesWhileActive; // 0x339(0x01)
	bool StopNormalWavesWhileActive; // 0x33a(0x01)
	bool EventStarted; // 0x33b(0x01)
	bool FailedEvent; // 0x33c(0x01)
	bool ShowRemainingTimeOnHUD; // 0x33d(0x01)
	bool ShowScoreStatusOnHUD; // 0x33e(0x01)
	char pad_33F[0x1]; // 0x33f(0x01)
	bool SkipEventStarters; // 0x340(0x01)
	char pad_341[0x7]; // 0x341(0x07)
	struct TArray<struct AActor*> EventParticipants; // 0x348(0x10)

	void TrySetupGameEvent(); // Function FSD.GameEvent.TrySetupGameEvent // (Final|Native|Protected) // @ game+0x1147260
	void TriggerEvent(); // Function FSD.GameEvent.TriggerEvent // (BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x10aad30
	void StartShout(); // Function FSD.GameEvent.StartShout // (Final|Native|Protected) // @ game+0x1147240
	void StageObjectiveCompleted(); // Function FSD.GameEvent.StageObjectiveCompleted // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1147220
	struct ARessuplyPod* SpawnEventPod(struct ARessuplyPod* podClass, struct FVector aSpawnLocation, int32_t Delay); // Function FSD.GameEvent.SpawnEventPod // (Final|BlueprintAuthorityOnly|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1147100
	struct AActor* SpawnEventActor(struct AActor* eventActorClass, struct FTransform aSpawnLocation); // Function FSD.GameEvent.SpawnEventActor // (Final|BlueprintAuthorityOnly|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1146fe0
	void SetStageProgress(float Progress); // Function FSD.GameEvent.SetStageProgress // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1146e30
	void SetObjectivesPerStage(int32_t objectivesPerStage); // Function FSD.GameEvent.SetObjectivesPerStage // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1146d30
	void RemoveParticipant(struct AActor* participant); // Function FSD.GameEvent.RemoveParticipant // (Final|Native|Protected) // @ game+0x1146b10
	void OnStarterObjectUsed(struct AEventStarterButton* eventStarter); // Function FSD.GameEvent.OnStarterObjectUsed // (Final|Native|Protected) // @ game+0x1146850
	void OnStageProgress(float Progress); // Function FSD.GameEvent.OnStageProgress // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void OnStageComplete(int32_t Stage); // Function FSD.GameEvent.OnStageComplete // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void OnRep_StageProgress(); // Function FSD.GameEvent.OnRep_StageProgress // (Final|Native|Protected) // @ game+0x1146830
	void OnRep_ObjectivesPerStage(); // Function FSD.GameEvent.OnRep_ObjectivesPerStage // (Final|Native|Public) // @ game+0x1146790
	void OnRep_IsEventStartersActive(); // Function FSD.GameEvent.OnRep_IsEventStartersActive // (Final|Native|Protected) // @ game+0x1146770
	void OnRep_FailedEvent(); // Function FSD.GameEvent.OnRep_FailedEvent // (Final|Native|Protected) // @ game+0x1146730
	void OnRep_EventStarted(); // Function FSD.GameEvent.OnRep_EventStarted // (Final|Native|Protected) // @ game+0x1146710
	void OnRep_EventParticipants(); // Function FSD.GameEvent.OnRep_EventParticipants // (Final|Native|Protected) // @ game+0x11466f0
	void OnEventTriggered(); // Function FSD.GameEvent.OnEventTriggered // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void OnEventFinished(bool eventSuccess); // Function FSD.GameEvent.OnEventFinished // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void OnEventBooted(); // Function FSD.GameEvent.OnEventBooted // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	bool IsEventActive(); // Function FSD.GameEvent.IsEventActive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1146440
	float GetStageProgress(); // Function FSD.GameEvent.GetStageProgress // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11462b0
	bool GetShowTimeOnHUD(); // Function FSD.GameEvent.GetShowTimeOnHUD // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11461f0
	bool GetShowScoreOnHUD(); // Function FSD.GameEvent.GetShowScoreOnHUD // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11461d0
	struct FText GetObjectiveText(); // Function FSD.GameEvent.GetObjectiveText // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1146120
	int32_t GetObjectivesPerStage(); // Function FSD.GameEvent.GetObjectivesPerStage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1146150
	struct FText GetEventName(); // Function FSD.GameEvent.GetEventName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11460f0
	bool GetEventFailed(); // Function FSD.GameEvent.GetEventFailed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11460d0
	float GetDelayUITime(); // Function FSD.GameEvent.GetDelayUITime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1146080
	void EndShout(); // Function FSD.GameEvent.EndShout // (Final|Native|Protected) // @ game+0x1145f20
	struct FTransform DebreePositionPoint(struct AProceduralSetup* setup, struct FVector fromLocation, float MinDistance, float desiredDistance, struct UDebrisPositioning* DebrisPositioning, struct AActor* terrainPlacement, float maxPathLength); // Function FSD.GameEvent.DebreePositionPoint // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1145cc0
	void BootUpEvent(); // Function FSD.GameEvent.BootUpEvent // (Final|Native|Public|BlueprintCallable) // @ game+0x1145be0
	void AddStageProgress(float progressToAdd); // Function FSD.GameEvent.AddStageProgress // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1145b10
};

// Class FSD.AmberEvent
// Size: 0x3a8 (Inherited: 0x358)
struct AAmberEvent : AGameEvent {
	struct UDamageComponent* EndExplosionDamage; // 0x358(0x08)
	struct TArray<struct UAmberEventEnemyPool*> EnemyPools; // 0x360(0x10)
	struct TArray<struct AFSDPawn*> spawnedEnemies; // 0x370(0x10)
	char pad_380[0x8]; // 0x380(0x08)
	struct TWeakObjectPtr<struct UAmberEventEnemyPool> CurrentPool; // 0x388(0x08)
	float InitialDelayBeforeSpawn; // 0x390(0x04)
	float MaxSpawnRange; // 0x394(0x04)
	char pad_398[0x10]; // 0x398(0x10)

	void OnSpawnedDeath(struct UHealthComponentBase* spawnedHealthComponent); // Function FSD.AmberEvent.OnSpawnedDeath // (Final|Native|Protected) // @ game+0x1088200
	void OnEnemySpawned(struct APawn* Pawn); // Function FSD.AmberEvent.OnEnemySpawned // (Final|Native|Protected) // @ game+0x10879b0
};

// Class FSD.AmmoCountWidget
// Size: 0x250 (Inherited: 0x230)
struct UAmmoCountWidget : UUserWidget {
	struct APlayerCharacter* Character; // 0x230(0x08)
	struct AItem* Item; // 0x238(0x08)
	struct UItemAggregator* Aggregator; // 0x240(0x08)
	char pad_248[0x8]; // 0x248(0x08)

	void OnVisibleChanged(bool Visible, bool showClipCount); // Function FSD.AmmoCountWidget.OnVisibleChanged // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void OnTotalVisibleChanged(bool Visible); // Function FSD.AmmoCountWidget.OnTotalVisibleChanged // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void OnTotalChanged(int32_t Total); // Function FSD.AmmoCountWidget.OnTotalChanged // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void OnItemTotalChanged(int32_t Value); // Function FSD.AmmoCountWidget.OnItemTotalChanged // (Final|Native|Protected) // @ game+0x1087d40
	void OnItemEquipped(struct AItem* NewItem); // Function FSD.AmmoCountWidget.OnItemEquipped // (Final|Native|Protected) // @ game+0x1087cc0
	void OnItemAmountChanged(int32_t Value); // Function FSD.AmmoCountWidget.OnItemAmountChanged // (Final|Native|Protected) // @ game+0x1087c40
	void OnAmountChanged(int32_t count); // Function FSD.AmmoCountWidget.OnAmountChanged // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void DoItemEquipped(); // Function FSD.AmmoCountWidget.DoItemEquipped // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
};

// Class FSD.Item
// Size: 0x338 (Inherited: 0x220)
struct AItem : AActor {
	char pad_220[0x40]; // 0x220(0x40)
	struct FVector FPCameraOffset; // 0x260(0x0c)
	char pad_26C[0x4]; // 0x26c(0x04)
	struct FAudioWithCooldown AudioFriendlyFire; // 0x270(0x10)
	bool EnableDangerousSaveGameIDEditing; // 0x280(0x01)
	char pad_281[0x3]; // 0x281(0x03)
	struct FGuid SaveGameID; // 0x284(0x10)
	char pad_294[0x4]; // 0x294(0x04)
	struct UItemID* ItemID; // 0x298(0x08)
	struct APlayerCharacter* Character; // 0x2a0(0x08)
	struct UUpgradableItemComponent* UpgradableItem; // 0x2a8(0x08)
	struct UCameraShake* CameraShake; // 0x2b0(0x08)
	bool CameraShakeOnStartUsing; // 0x2b8(0x01)
	bool CameraShakeOnEquip; // 0x2b9(0x01)
	char pad_2BA[0xe]; // 0x2ba(0x0e)
	struct UCurveFloat* HeatCurve; // 0x2c8(0x08)
	float ManualHeatPerUse; // 0x2d0(0x04)
	float CooldownRate; // 0x2d4(0x04)
	float ManualCooldownDelay; // 0x2d8(0x04)
	float UnjamDuration; // 0x2dc(0x04)
	char pad_2E0[0x4]; // 0x2e0(0x04)
	float CurrentTemperature; // 0x2e4(0x04)
	struct USoundBase* AudioTemperature; // 0x2e8(0x08)
	float AudioTemperatureFadeout; // 0x2f0(0x04)
	struct FName TemperatureFloatParam; // 0x2f4(0x08)
	char pad_2FC[0x4]; // 0x2fc(0x04)
	struct UAudioComponent* TemperatureAudioComponent; // 0x300(0x08)
	bool Overheated; // 0x308(0x01)
	char pad_309[0x7]; // 0x309(0x07)
	struct UDialogDataAsset* ShoutOverheated; // 0x310(0x08)
	bool bAimAssistEnabled; // 0x318(0x01)
	char pad_319[0x3]; // 0x319(0x03)
	float MovementRateWhileUsing; // 0x31c(0x04)
	bool CanPlayLedgeClimbWhileUsing; // 0x320(0x01)
	bool CanInspectItem; // 0x321(0x01)
	bool CanSprintWithItem; // 0x322(0x01)
	char pad_323[0x5]; // 0x323(0x05)
	struct UItemsBarIcon* CustomIconWidget; // 0x328(0x08)
	float AdvancedVibrationSendLevel; // 0x330(0x04)
	bool IsEquipped; // 0x334(0x01)
	bool IsUsing; // 0x335(0x01)
	char pad_336[0x2]; // 0x336(0x02)

	void UpdateSkin(); // Function FSD.Item.UpdateSkin // (Native|Public|BlueprintCallable) // @ game+0x116d140
	struct UAudioComponent* SpawnSoundAttached(struct USoundBase* Sound, struct USceneComponent* AttachToComponent, float PriorityOverride, struct FName AttachPointName, struct FVector Location, struct FRotator Rotation, enum class EAttachLocation LocationType, bool bStopWhenAttachedToDestroyed, float VolumeMultiplier, float PitchMultiplier, float StartTime, struct USoundAttenuation* AttenuationSettings, struct USoundConcurrency* ConcurrencySettings, bool bAutoDestroy, bool SendVibration); // Function FSD.Item.SpawnSoundAttached // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x116cb40
	struct UAudioComponent* SpawnSoundAtLocation(struct USoundBase* Sound, struct FVector Location, struct FRotator Rotation, float VolumeMultiplier, float PitchMultiplier, float StartTime, struct USoundAttenuation* AttenuationSettings, struct USoundConcurrency* ConcurrencySettings, bool bAutoDestroy, bool SendVibration); // Function FSD.Item.SpawnSoundAtLocation // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x116c850
	struct UAudioComponent* SpawnSound2D(struct USoundBase* Sound, float PriorityOverride, float VolumeMultiplier, float PitchMultiplier, float StartTime, struct USoundConcurrency* ConcurrencySettings, bool bPersistAcrossLevelTransition, bool bAutoDestroy, bool SendVibration); // Function FSD.Item.SpawnSound2D // (Final|Native|Public|BlueprintCallable) // @ game+0x116c5c0
	void Server_StartUsing(bool IsUsing); // Function FSD.Item.Server_StartUsing // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x116c3f0
	void Resupply(float percentage); // Function FSD.Item.Resupply // (Native|Public|BlueprintCallable) // @ game+0x116c370
	void RemovedFromInventory(struct ACharacter* oldCharacter); // Function FSD.Item.RemovedFromInventory // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void RecieveUnequipped(); // Function FSD.Item.RecieveUnequipped // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void RecieveStopUsing(); // Function FSD.Item.RecieveStopUsing // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void RecieveStartUsing(); // Function FSD.Item.RecieveStartUsing // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void RecieveEquipped(); // Function FSD.Item.RecieveEquipped // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void RecieveCycledItem(); // Function FSD.Item.RecieveCycledItem // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void Recieve_UpdateMeshses(bool IsFirstPerson); // Function FSD.Item.Recieve_UpdateMeshses // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void ReceiveResupply(float percentage); // Function FSD.Item.ReceiveResupply // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void Receive_Overheated(); // Function FSD.Item.Receive_Overheated // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	struct UStaticMeshComponent* Receive_GetTPAnimationEventMesh(); // Function FSD.Item.Receive_GetTPAnimationEventMesh // (Event|Protected|BlueprintEvent|Const) // @ game+0x158ca90
	struct UFirstPersonStaticMeshComponent* Receive_GetFPAnimationEventMesh(); // Function FSD.Item.Receive_GetFPAnimationEventMesh // (Event|Protected|BlueprintEvent|Const) // @ game+0x158ca90
	void OnTemperatureChanged(float Temperature, bool Overheated); // Function FSD.Item.OnTemperatureChanged // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void OnSkinChanged(struct USkinEffect* Skin); // Function FSD.Item.OnSkinChanged // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void OnRep_IsUsing(bool OldValue); // Function FSD.Item.OnRep_IsUsing // (Native|Protected) // @ game+0x116c0b0
	void OnOwnerDestroyed(struct AActor* owningActor); // Function FSD.Item.OnOwnerDestroyed // (Final|Native|Protected) // @ game+0x116c010
	bool IsLocallyControlled(); // Function FSD.Item.IsLocallyControlled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x116bfe0
	bool IsFirstPerson(); // Function FSD.Item.IsFirstPerson // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x116bfb0
	struct AActor* GetWeaponViewClass(); // Function FSD.Item.GetWeaponViewClass // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x116bf40
	struct FItemLoadoutAnimations GetLoadoutAnimations(); // Function FSD.Item.GetLoadoutAnimations // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x116bb90
	struct FText GetItemName(); // Function FSD.Item.GetItemName // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x116baf0
	struct UTexture2D* GetItemIconLine(); // Function FSD.Item.GetItemIconLine // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x116bac0
	struct UTexture2D* GetItemIconBG(); // Function FSD.Item.GetItemIconBG // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x116ba90
	struct AItem* GetItemDefaultObject(struct AItem* itemClass); // Function FSD.Item.GetItemDefaultObject // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x116ba10
	struct FText GetItemCategory(); // Function FSD.Item.GetItemCategory // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x116b970
	struct USceneComponent* GetHeatingAudioSceneComponent(); // Function FSD.Item.GetHeatingAudioSceneComponent // (Native|Event|Protected|BlueprintEvent) // @ game+0x116b940
	struct UItemCharacterAnimationSet* GetCharacterAnimationSet(); // Function FSD.Item.GetCharacterAnimationSet // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x116b890
	struct FString GetAnalyticsItemName(); // Function FSD.Item.GetAnalyticsItemName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x116b810
	struct FString GetAnalyticsItemCategory(); // Function FSD.Item.GetAnalyticsItemCategory // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x116b790
	void AddedToInventory(struct APlayerCharacter* ItemOwner); // Function FSD.Item.AddedToInventory // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
};

// Class FSD.AnimatedItem
// Size: 0x390 (Inherited: 0x338)
struct AAnimatedItem : AItem {
	struct USkinnableComponent* Skinnable; // 0x338(0x08)
	struct UPlayerAnimInstance* FPAnimInstance; // 0x340(0x08)
	struct UPlayerAnimInstance* TPAnimInstance; // 0x348(0x08)
	struct USkeletalMeshComponent* FPMesh; // 0x350(0x08)
	struct USkeletalMeshComponent* TPMesh; // 0x358(0x08)
	struct UAnimMontage* FP_EquipAnimation; // 0x360(0x08)
	struct UAnimMontage* TP_EquipAnimation; // 0x368(0x08)
	float EquipDuration; // 0x370(0x04)
	char pad_374[0x4]; // 0x374(0x04)
	struct UItemCharacterAnimationSet* CharacterAnimationSet; // 0x378(0x08)
	char pad_380[0x10]; // 0x380(0x10)

	void OnReceiveEquippedFinished(); // Function FSD.AnimatedItem.OnReceiveEquippedFinished // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	struct FTransform GetMuzzle(); // Function FSD.AnimatedItem.GetMuzzle // (Final|Native|Protected|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x10878a0
	struct USkeletalMeshComponent* GetItemMesh(); // Function FSD.AnimatedItem.GetItemMesh // (Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x1087870
};

// Class FSD.AmmoDrivenWeapon
// Size: 0x6e0 (Inherited: 0x390)
struct AAmmoDrivenWeapon : AAnimatedItem {
	char pad_390[0x20]; // 0x390(0x20)
	struct FMulticastInlineDelegate OnClipCountChanged; // 0x3b0(0x10)
	struct FMulticastInlineDelegate OnTryReloadEvent; // 0x3c0(0x10)
	struct FMulticastInlineDelegate OnReloadingEvent; // 0x3d0(0x10)
	struct FMulticastInlineDelegate OnShotFiredEvent; // 0x3e0(0x10)
	struct FMulticastInlineDelegate OnStoppedUsingEvent; // 0x3f0(0x10)
	char pad_400[0x10]; // 0x400(0x10)
	struct UWeaponFireComponent* WeaponFire; // 0x410(0x08)
	struct UAmmoDriveWeaponAggregator* Aggregator; // 0x418(0x08)
	bool LoopFireAnimation; // 0x420(0x01)
	char pad_421[0x3]; // 0x421(0x03)
	float LoopFireAnimationBlendoutTime; // 0x424(0x04)
	struct UAnimMontage* FP_FireAnimation; // 0x428(0x08)
	struct UAnimMontage* TP_FireAnimation; // 0x430(0x08)
	struct UAnimMontage* FP_ReloadAnimation; // 0x438(0x08)
	struct FItemAnimationItem OverheatAnimation; // 0x440(0x18)
	struct TArray<struct FItemAnimationItem> GunslingAnimations; // 0x458(0x10)
	struct UAnimMontage* TP_ReloadAnimation; // 0x468(0x08)
	struct UAnimMontage* WPN_Fire; // 0x470(0x08)
	struct UAnimMontage* WPN_FireLastBullet; // 0x478(0x08)
	struct UAnimMontage* WPN_Reload; // 0x480(0x08)
	struct UAnimMontage* WPN_Reload_TP; // 0x488(0x08)
	struct UFXSystemAsset* MuzzleParticles; // 0x490(0x08)
	struct UFXSystemAsset* TPMuzzleParticles; // 0x498(0x08)
	bool UseTriggeredMuzzleParticles; // 0x4a0(0x01)
	char pad_4A1[0xf]; // 0x4a1(0x0f)
	struct FTracerData Tracer; // 0x4b0(0x30)
	struct UParticleSystem* TracerParticles; // 0x4e0(0x08)
	struct UParticleSystem* TrailParticles; // 0x4e8(0x08)
	float MinTracerDistance; // 0x4f0(0x04)
	float TracerSpeed; // 0x4f4(0x04)
	float TracerOffset; // 0x4f8(0x04)
	char pad_4FC[0x4]; // 0x4fc(0x04)
	struct UFXSystemAsset* CasingParticles; // 0x500(0x08)
	bool UseTriggeredCasingParticleSystem; // 0x508(0x01)
	char pad_509[0xf]; // 0x509(0x0f)
	struct ULightComponent* MuzzleFlashLight; // 0x518(0x08)
	struct FRuntimeFloatCurve MuzzleFlashLightCurve; // 0x520(0x88)
	char pad_5A8[0x8]; // 0x5a8(0x08)
	struct USoundCue* FireSound; // 0x5b0(0x08)
	struct USoundCue* RicochetSound; // 0x5b8(0x08)
	struct UFXSystemAsset* RicochetParticle; // 0x5c0(0x08)
	float FireSoundDelayToTail; // 0x5c8(0x04)
	char pad_5CC[0xc]; // 0x5cc(0x0c)
	struct USoundCue* FireSoundTail; // 0x5d8(0x08)
	bool IsFireSoundTail2D; // 0x5e0(0x01)
	char pad_5E1[0x7]; // 0x5e1(0x07)
	struct UForceFeedbackEffect* FireForceFeedbackEffect; // 0x5e8(0x08)
	struct TWeakObjectPtr<struct UAudioComponent> FireSoundInstance; // 0x5f0(0x08)
	float FireSoundFadeDuration; // 0x5f8(0x04)
	char pad_5FC[0x4]; // 0x5fc(0x04)
	struct USoundCue* ReloadSound; // 0x600(0x08)
	int32_t BulletsRemainingForNearEmptySound; // 0x608(0x04)
	char pad_60C[0x4]; // 0x60c(0x04)
	struct USoundCue* NearEmptySound; // 0x610(0x08)
	struct USoundCue* WeaponEmptySound; // 0x618(0x08)
	struct UDialogDataAsset* ShoutShotFired; // 0x620(0x08)
	struct UDialogDataAsset* ShoutOutOfAmmo; // 0x628(0x08)
	struct UDialogDataAsset* ShoutReloading; // 0x630(0x08)
	int32_t MaxAmmo; // 0x638(0x04)
	int32_t ClipSize; // 0x63c(0x04)
	int32_t ShotCost; // 0x640(0x04)
	float RateOfFire; // 0x644(0x04)
	int32_t BurstCount; // 0x648(0x04)
	float BurstCycleTime; // 0x64c(0x04)
	float ReloadDuration; // 0x650(0x04)
	int32_t AmmoCount; // 0x654(0x04)
	int32_t ClipCount; // 0x658(0x04)
	float AutoReloadDuration; // 0x65c(0x04)
	struct USoundCue* AutoReloadCompleteCue; // 0x660(0x08)
	struct FMulticastInlineDelegate OnItemAutoReloaded; // 0x668(0x10)
	char pad_678[0x4]; // 0x678(0x04)
	float SupplyStatusWeight; // 0x67c(0x04)
	float CycleTimeLeft; // 0x680(0x04)
	char pad_684[0x4]; // 0x684(0x04)
	float ReloadTimeLeft; // 0x688(0x04)
	bool AutomaticReload; // 0x68c(0x01)
	bool CanReload; // 0x68d(0x01)
	char pad_68E[0x2]; // 0x68e(0x02)
	struct FRecoilSettings RecoilSettings; // 0x690(0x28)
	bool HasAutomaticFire; // 0x6b8(0x01)
	bool IsFiring; // 0x6b9(0x01)
	char pad_6BA[0x18]; // 0x6ba(0x18)
	enum class EAmmoWeaponState WeaponState; // 0x6d2(0x01)
	char pad_6D3[0xd]; // 0x6d3(0x0d)

	void Upgraded_Blueprint_Implementation(struct TArray<struct UItemUpgrade*> upgrades); // Function FSD.AmmoDrivenWeapon.Upgraded_Blueprint_Implementation // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x158ca90
	void Server_StopReload(); // Function FSD.AmmoDrivenWeapon.Server_StopReload // (Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x1088620
	void Server_ReloadWeapon(); // Function FSD.AmmoDrivenWeapon.Server_ReloadWeapon // (Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x1088530
	void Server_PlayBurstFire(char shotCount); // Function FSD.AmmoDrivenWeapon.Server_PlayBurstFire // (Net|Native|Event|Protected|NetServer) // @ game+0x10884b0
	void Server_Gunsling(char Index); // Function FSD.AmmoDrivenWeapon.Server_Gunsling // (Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x1088430
	void ResupplyAmmo(int32_t Amount); // Function FSD.AmmoDrivenWeapon.ResupplyAmmo // (Final|Native|Public|BlueprintCallable) // @ game+0x10883b0
	void RecieveFiredWeapon(); // Function FSD.AmmoDrivenWeapon.RecieveFiredWeapon // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void Receive_ReloadEnd(); // Function FSD.AmmoDrivenWeapon.Receive_ReloadEnd // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void Receive_ReloadBegin(); // Function FSD.AmmoDrivenWeapon.Receive_ReloadBegin // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void Receive_IsFiringChanged(bool NewValue); // Function FSD.AmmoDrivenWeapon.Receive_IsFiringChanged // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void OnWeaponFireEnded(); // Function FSD.AmmoDrivenWeapon.OnWeaponFireEnded // (Final|Native|Protected) // @ game+0x1088280
	void OnWeaponFired(struct FVector Location); // Function FSD.AmmoDrivenWeapon.OnWeaponFired // (Native|Protected|HasOutParms|HasDefaults) // @ game+0x10882a0
	void OnRicochet(struct FVector Origin, struct FVector Location, struct FVector Normal); // Function FSD.AmmoDrivenWeapon.OnRicochet // (Final|Native|Protected|HasOutParms|HasDefaults) // @ game+0x10880c0
	void OnRep_IsFiring(); // Function FSD.AmmoDrivenWeapon.OnRep_IsFiring // (Final|Native|Protected) // @ game+0x10880a0
	bool IsClipFull(); // Function FSD.AmmoDrivenWeapon.IsClipFull // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1087920
	void InstantlyReload(); // Function FSD.AmmoDrivenWeapon.InstantlyReload // (Final|Native|Public|BlueprintCallable) // @ game+0x1087900
	void CustomEvent1(struct UItemUpgrade* Event); // Function FSD.AmmoDrivenWeapon.CustomEvent1 // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void Client_RefillAmmo(float percentage); // Function FSD.AmmoDrivenWeapon.Client_RefillAmmo // (Net|NetReliableNative|Event|Protected|NetClient) // @ game+0x10877f0
	void All_StopReload(); // Function FSD.AmmoDrivenWeapon.All_StopReload // (Net|Native|Event|NetMulticast|Protected) // @ game+0x10877d0
	void All_StartReload(); // Function FSD.AmmoDrivenWeapon.All_StartReload // (Net|Native|Event|NetMulticast|Protected) // @ game+0x1083ef0
	void All_PlayBurstFire(char shotCount); // Function FSD.AmmoDrivenWeapon.All_PlayBurstFire // (Net|Native|Event|NetMulticast|Protected) // @ game+0x1087750
	void All_Gunsling(char Index); // Function FSD.AmmoDrivenWeapon.All_Gunsling // (Net|Native|Event|NetMulticast|Protected) // @ game+0x10876d0
};

// Class FSD.ItemAggregator
// Size: 0xc8 (Inherited: 0xb0)
struct UItemAggregator : UActorComponent {
	struct FText CounterText; // 0xb0(0x18)

	void UnbindAllEvents(); // Function FSD.ItemAggregator.UnbindAllEvents // (Native|Public|BlueprintCallable) // @ game+0x116d120
};

// Class FSD.ClipBasedItemAggregator
// Size: 0x140 (Inherited: 0xc8)
struct UClipBasedItemAggregator : UItemAggregator {
	struct FMulticastInlineDelegate OnClipAmountChanged; // 0xc8(0x10)
	struct FMulticastInlineDelegate OnTotalAmountChanged; // 0xd8(0x10)
	struct FMulticastInlineDelegate OnClipAndTotalChanged; // 0xe8(0x10)
	struct FMulticastInlineDelegate OnReloadTimeChanged; // 0xf8(0x10)
	struct FMulticastInlineDelegate OnReloadComplete; // 0x108(0x10)
	struct FMulticastInlineDelegate OnReloadStarted; // 0x118(0x10)
	struct FMulticastInlineDelegate OnMaxAmmoCapacityChanged; // 0x128(0x10)
	bool ShowTotalAmount; // 0x138(0x01)
	char pad_139[0x7]; // 0x139(0x07)

	void ReloadStarted(); // Function FSD.ClipBasedItemAggregator.ReloadStarted // (Final|Native|Public) // @ game+0x109f9d0
	void ReloadComplete(); // Function FSD.ClipBasedItemAggregator.ReloadComplete // (Final|Native|Public) // @ game+0x109f9a0
	int32_t GetTotalAmount(); // Function FSD.ClipBasedItemAggregator.GetTotalAmount // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109f1f0
	int32_t GetClipAmount(); // Function FSD.ClipBasedItemAggregator.GetClipAmount // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109f1c0
};

// Class FSD.AmmoDriveWeaponAggregator
// Size: 0x148 (Inherited: 0x140)
struct UAmmoDriveWeaponAggregator : UClipBasedItemAggregator {
	struct AAmmoDrivenWeapon* Weapon; // 0x140(0x08)
};

// Class FSD.AmmoDrivenWeaponAnimInstance
// Size: 0x280 (Inherited: 0x270)
struct UAmmoDrivenWeaponAnimInstance : UAnimInstance {
	struct AAmmoDrivenWeapon* Weapon; // 0x268(0x08)
	bool IsFiring; // 0x270(0x01)
	float ClipFullPercentage; // 0x274(0x04)
	bool Overheated; // 0x278(0x01)
	char pad_27E[0x2]; // 0x27e(0x02)

	bool IsFull(); // Function FSD.AmmoDrivenWeaponAnimInstance.IsFull // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1087980
	bool isEmpty(); // Function FSD.AmmoDrivenWeaponAnimInstance.isEmpty // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1087950
};

// Class FSD.PlatformGunAnimInstance
// Size: 0x290 (Inherited: 0x280)
struct UPlatformGunAnimInstance : UAmmoDrivenWeaponAnimInstance {
	float SpinRate; // 0x280(0x04)
	float NormalSpinRate; // 0x284(0x04)
	float LerpSpeed; // 0x288(0x04)
	float FiredSpinRate; // 0x28c(0x04)

	void WeaponFired(); // Function FSD.PlatformGunAnimInstance.WeaponFired // (Final|Native|Public|BlueprintCallable) // @ game+0x1088790
};

// Class FSD.AnchorTurner
// Size: 0x2c0 (Inherited: 0x220)
struct AAnchorTurner : AActor {
	struct USceneComponent* Root; // 0x220(0x08)
	struct USkeletalMeshComponent* Mesh; // 0x228(0x08)
	struct USphereComponent* PushCollider1; // 0x230(0x08)
	struct USphereComponent* PushCollider2; // 0x238(0x08)
	struct USphereComponent* PushCollider3; // 0x240(0x08)
	struct USphereComponent* PushCollider4; // 0x248(0x08)
	struct FMulticastInlineDelegate OnSpunUp; // 0x250(0x10)
	char pad_260[0x20]; // 0x260(0x20)
	struct FVector AttatchmentOffset; // 0x280(0x0c)
	char pad_28C[0x4]; // 0x28c(0x04)
	struct TArray<struct FName> AttachmentPoints; // 0x290(0x10)
	float PerPlayerMultiplier; // 0x2a0(0x04)
	float TurnSpeed; // 0x2a4(0x04)
	float Progress; // 0x2a8(0x04)
	float MaxProgress; // 0x2ac(0x04)
	char pad_2B0[0x4]; // 0x2b0(0x04)
	bool Finished; // 0x2b4(0x01)
	char pad_2B5[0x3]; // 0x2b5(0x03)
	float DecaySpeed; // 0x2b8(0x04)
	char pad_2BC[0x4]; // 0x2bc(0x04)

	void OnRep_Finished(); // Function FSD.AnchorTurner.OnRep_Finished // (Final|Native|Protected) // @ game+0x1088080
	void OnLeftPushpoint(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function FSD.AnchorTurner.OnLeftPushpoint // (Final|Native|Public) // @ game+0x1087dc0
	void OnEnteredPushpoint(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function FSD.AnchorTurner.OnEnteredPushpoint // (Final|Native|Public|HasOutParms) // @ game+0x1087a30
	void GeneratorSpunUp(); // Function FSD.AnchorTurner.GeneratorSpunUp // (Event|Public|BlueprintEvent) // @ game+0x158ca90
};

// Class FSD.AnchorTurnerAnimInstance
// Size: 0x280 (Inherited: 0x270)
struct UAnchorTurnerAnimInstance : UAnimInstance {
	float ModuleRotation; // 0x268(0x04)
	float Percent; // 0x26c(0x04)
	float TurnSpeed; // 0x270(0x04)
	bool IsFinished; // 0x274(0x01)
	char pad_27D[0x3]; // 0x27d(0x03)
};

// Class FSD.BaseArmorDamageComponent
// Size: 0x100 (Inherited: 0xb0)
struct UBaseArmorDamageComponent : UActorComponent {
	bool ArmorDamageEnabled; // 0xb0(0x01)
	char pad_B1[0x7]; // 0xb1(0x07)
	struct FMulticastInlineDelegate OnArmorShatteredEvent; // 0xb8(0x10)
	struct TArray<struct UParticleSystem*> ArmorBreakParticles; // 0xc8(0x10)
	struct TArray<struct UParticleSystem*> ArmorDisolveParticles; // 0xd8(0x10)
	struct TArray<struct UFSDPhysicalMaterial*> ArmorPhysMats; // 0xe8(0x10)
	struct USkeletalMeshComponent* Mesh; // 0xf8(0x08)
};

// Class FSD.SimpleArmorDamageComponent
// Size: 0x170 (Inherited: 0x100)
struct USimpleArmorDamageComponent : UBaseArmorDamageComponent {
	struct FMulticastInlineDelegate OnRadialArmorPartsDestroyedEvent; // 0x100(0x10)
	float ArmorStrength; // 0x110(0x04)
	char pad_114[0x4]; // 0x114(0x04)
	struct TMap<struct FName, struct FDestructableBodypartItem> PhysBoneToArmor; // 0x118(0x50)
	uint32_t ArmorDamageIndexMask; // 0x168(0x04)
	char pad_16C[0x4]; // 0x16c(0x04)

	void Server_SetArmorIndexDestroyed(int32_t Index, bool Disolved); // Function FSD.SimpleArmorDamageComponent.Server_SetArmorIndexDestroyed // (Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x1088550
	void OnRep_ArmorDamageIndexMask(uint32_t OldIndexMask); // Function FSD.SimpleArmorDamageComponent.OnRep_ArmorDamageIndexMask // (Final|Native|Protected) // @ game+0x1088000
};

// Class FSD.ArmorHealthDamageComponent
// Size: 0x178 (Inherited: 0x100)
struct UArmorHealthDamageComponent : UBaseArmorDamageComponent {
	struct FMulticastInlineDelegate OnArmorPartDestroyedEvent; // 0x100(0x10)
	struct FMulticastInlineDelegate OnArmorPartDamagedEvent; // 0x110(0x10)
	struct TMap<struct FName, struct FArmorHealthItem> PhysBoneToArmor; // 0x120(0x50)
	uint32_t ArmorDamageIndex; // 0x170(0x04)
	bool AffectedByAmorBreak; // 0x174(0x01)
	char pad_175[0x3]; // 0x175(0x03)

	bool SetHealthOnBodypartItem(struct FName BoneName, float newHealth); // Function FSD.ArmorHealthDamageComponent.SetHealthOnBodypartItem // (Final|Native|Public|BlueprintCallable) // @ game+0x10886c0
	void SetHealthOnAllItems(float newHealth); // Function FSD.ArmorHealthDamageComponent.SetHealthOnAllItems // (Final|Native|Public|BlueprintCallable) // @ game+0x1088640
	void RegrowAllArmor(float baseHealth); // Function FSD.ArmorHealthDamageComponent.RegrowAllArmor // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1088330
	void OnRep_ArmorDamageIndex(uint32_t OldValue); // Function FSD.ArmorHealthDamageComponent.OnRep_ArmorDamageIndex // (Final|Native|Protected) // @ game+0x1087f00
};

// Class FSD.CompositeArmorComponent
// Size: 0x148 (Inherited: 0x100)
struct UCompositeArmorComponent : UBaseArmorDamageComponent {
	struct FMulticastInlineDelegate OnArmorPartDestroyedEvent; // 0x100(0x10)
	struct FMulticastInlineDelegate OnArmorPartDamagedEvent; // 0x110(0x10)
	struct UFXSystemAsset* BreakParticle; // 0x120(0x08)
	bool AffectedByAmorBreak; // 0x128(0x01)
	char pad_129[0x7]; // 0x129(0x07)
	struct TArray<struct FCompositeArmorItem> ArmorItems; // 0x130(0x10)
	uint32_t ArmorDamageIndex; // 0x140(0x04)
	char pad_144[0x4]; // 0x144(0x04)

	void OnRep_ArmorDamageIndex(uint32_t OldValue); // Function FSD.CompositeArmorComponent.OnRep_ArmorDamageIndex // (Final|Native|Protected) // @ game+0x1087f80
	void AddArmorPart(struct UPrimitiveComponent* Primitive, float Health); // Function FSD.CompositeArmorComponent.AddArmorPart // (Final|Native|Public|BlueprintCallable) // @ game+0x1087600
};

// Class FSD.ArmorPiece
// Size: 0x2a8 (Inherited: 0x220)
struct AArmorPiece : AActor {
	char pad_220[0x18]; // 0x220(0x18)
	struct UUpgradableGearComponent* Upgradable; // 0x238(0x08)
	struct TMap<struct UPawnStat*, float> StatModifiers; // 0x240(0x50)
	struct ALoadoutItemProxy* LoadoutProxy; // 0x290(0x08)
	struct UItemID* ItemID; // 0x298(0x08)
	struct AActor* WeaponPreviewClass; // 0x2a0(0x08)

	struct AActor* GetWeaponViewClass(); // Function FSD.ArmorPiece.GetWeaponViewClass // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x108c600
	struct AArmorPiece* GetArmorPieceDefaultObject(struct AArmorPiece* armorPieceClass); // Function FSD.ArmorPiece.GetArmorPieceDefaultObject // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x108c330
};

// Class FSD.AsyncLevelPersistanceActor
// Size: 0x240 (Inherited: 0x220)
struct AAsyncLevelPersistanceActor : AActor {
	struct TArray<struct UObject*> References; // 0x220(0x10)
	char pad_230[0x10]; // 0x230(0x10)
};

// Class FSD.AsyncManager
// Size: 0x58 (Inherited: 0x30)
struct UAsyncManager : UGameInstanceSubsystem {
	struct TArray<struct UObject*> PermanentReferences; // 0x30(0x10)
	char pad_40[0x18]; // 0x40(0x18)

	void ReleaseAllHandles(); // Function FSD.AsyncManager.ReleaseAllHandles // (Final|Native|Public|BlueprintCallable) // @ game+0x108c9e0
	void AsyncLoadSoftObjects(struct TArray<struct TSoftObjectPtr<struct UObject>> Items, enum class EAsyncPersistence persistence, struct FDelegate OnLoadComplete, enum class EAsyncLoadPriority Priority); // Function FSD.AsyncManager.AsyncLoadSoftObjects // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x108bfa0
	void AsyncLoadSoftObject(struct TSoftObjectPtr<struct UObject> Item, enum class EAsyncPersistence persistence, struct FDelegate OnLoadComplete, enum class EAsyncLoadPriority Priority); // Function FSD.AsyncManager.AsyncLoadSoftObject // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x108bdb0
	void AsyncLoadSoftClass(SoftClassProperty Item, enum class EAsyncPersistence persistence, struct FDelegate OnLoadComplete, enum class EAsyncLoadPriority Priority); // Function FSD.AsyncManager.AsyncLoadSoftClass // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x108bdb0
	void AsyncLoadAssets(struct TArray<struct FSoftObjectPath> Items, enum class EAsyncPersistence persistence, struct FDelegate OnLoadComplete, enum class EAsyncLoadPriority Priority); // Function FSD.AsyncManager.AsyncLoadAssets // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x108bc00
	void AsyncLoadAsset(struct FSoftObjectPath Item, enum class EAsyncPersistence persistence, struct FDelegate OnLoadComplete, enum class EAsyncLoadPriority Priority); // Function FSD.AsyncManager.AsyncLoadAsset // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x108ba70
};

// Class FSD.AttackBaseComponent
// Size: 0xf0 (Inherited: 0xb0)
struct UAttackBaseComponent : UActorComponent {
	char pad_B0[0x10]; // 0xb0(0x10)
	struct FName AttackName; // 0xc0(0x08)
	float MaxSurfaceAngle; // 0xc8(0x04)
	struct FFloatInterval range; // 0xcc(0x08)
	float MinRange; // 0xd4(0x04)
	float MaxRange; // 0xd8(0x04)
	char pad_DC[0x14]; // 0xdc(0x14)

	struct UAttackBaseComponent* ReplaceAttackComponent(struct UAttackBaseComponent* componentToReplace, struct UAttackBaseComponent* newComponentClass); // Function FSD.AttackBaseComponent.ReplaceAttackComponent // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x108ca00
	void ReceiveCompleteAttack(); // Function FSD.AttackBaseComponent.ReceiveCompleteAttack // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void ReceiveAttackTarget(struct AActor* Target); // Function FSD.AttackBaseComponent.ReceiveAttackTarget // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void ReceiveAbortAttack(); // Function FSD.AttackBaseComponent.ReceiveAbortAttack // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void CompleteAttack(bool success); // Function FSD.AttackBaseComponent.CompleteAttack // (Final|BlueprintAuthorityOnly|Native|Protected|BlueprintCallable) // @ game+0x108c280
	void AttackTarget(struct AActor* Target); // Function FSD.AttackBaseComponent.AttackTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x108c150
	void AbortAttack(); // Function FSD.AttackBaseComponent.AbortAttack // (Final|Native|Public|BlueprintCallable) // @ game+0x108ba30
};

// Class FSD.AttackEffect
// Size: 0x28 (Inherited: 0x28)
struct UAttackEffect : UObject {
};

// Class FSD.AttackCooldownComponent
// Size: 0xc0 (Inherited: 0xb0)
struct UAttackCooldownComponent : UActorComponent {
	struct TArray<struct FAttackCooldown> AttackCooldowns; // 0xb0(0x10)

	void SetCooldown(struct FName AttackName, float cooldownSeconds); // Function FSD.AttackCooldownComponent.SetCooldown // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x108cbc0
	bool IsAttackOffCooldown(struct FName AttackName); // Function FSD.AttackCooldownComponent.IsAttackOffCooldown // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x108c670
	bool IsAnyAttackOffCooldown(); // Function FSD.AttackCooldownComponent.IsAnyAttackOffCooldown // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x108c640
	void AttackUsed(struct FName Name); // Function FSD.AttackCooldownComponent.AttackUsed // (Final|Native|Public|HasOutParms) // @ game+0x108c1d0
};

// Class FSD.AttackerManagerComponent
// Size: 0xc0 (Inherited: 0xb0)
struct UAttackerManagerComponent : UActorComponent {
	struct TArray<struct UAttackerPositioningComponent*> Components; // 0xb0(0x10)
};

// Class FSD.AttackerPositioningComponent
// Size: 0x108 (Inherited: 0xb0)
struct UAttackerPositioningComponent : UActorComponent {
	bool DebugPositions; // 0xb0(0x01)
	char pad_B1[0x3]; // 0xb1(0x03)
	int32_t MaxAttackers; // 0xb4(0x04)
	struct TArray<struct FAttackerInfo> Attackers; // 0xb8(0x10)
	struct TArray<int32_t> FreePositions; // 0xc8(0x10)
	struct TArray<struct FAttackerInfo> FlyingAttackers; // 0xd8(0x10)
	struct TArray<int32_t> FlyingFreePositions; // 0xe8(0x10)
	float CharacterPersonalSphere; // 0xf8(0x04)
	float CharacterHalfHeight; // 0xfc(0x04)
	float CostModifier; // 0x100(0x04)
	char pad_104[0x4]; // 0x104(0x04)

	void UnregisterAttacker(struct AActor* Attacker, bool IsFlying); // Function FSD.AttackerPositioningComponent.UnregisterAttacker // (Final|Native|Public|BlueprintCallable) // @ game+0x108ce60
	void RegisterAttacker(struct AActor* Attacker, bool IsFlying); // Function FSD.AttackerPositioningComponent.RegisterAttacker // (Final|Native|Public|BlueprintCallable) // @ game+0x108c910
	void OnFlyingAttackerDeath(struct UHealthComponentBase* HealthComponent); // Function FSD.AttackerPositioningComponent.OnFlyingAttackerDeath // (Final|Native|Protected) // @ game+0x108c790
	void OnAttackerDeath(struct UHealthComponentBase* HealthComponent); // Function FSD.AttackerPositioningComponent.OnAttackerDeath // (Final|Native|Protected) // @ game+0x108c710
	struct FVector GetFlyingAttackerPosition(struct AActor* Attacker, float AttackerRadius); // Function FSD.AttackerPositioningComponent.GetFlyingAttackerPosition // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x108c490
	struct FVector GetAttackerPosition(struct AActor* Attacker, float AttackerRadius); // Function FSD.AttackerPositioningComponent.GetAttackerPosition // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x108c3b0
};

// Class FSD.PlayerAttackPositionComponent
// Size: 0x110 (Inherited: 0x108)
struct UPlayerAttackPositionComponent : UAttackerPositioningComponent {
	float OnZiplineFlyingModifier; // 0x108(0x04)
	float OnZiplineWalkingModifier; // 0x10c(0x04)
};

// Class FSD.ObjectAttackerPositioning
// Size: 0x110 (Inherited: 0x108)
struct UObjectAttackerPositioning : UAttackerPositioningComponent {
	struct UHealthComponentBase* Health; // 0x108(0x08)
};

// Class FSD.CustomObjectAttackerPositioning
// Size: 0x120 (Inherited: 0x108)
struct UCustomObjectAttackerPositioning : UAttackerPositioningComponent {
	struct UHealthComponentBase* Health; // 0x108(0x08)
	struct TArray<struct FVector> AttackerPositions; // 0x110(0x10)
};

// Class FSD.EnemyAttackerPositioningComponent
// Size: 0x108 (Inherited: 0x108)
struct UEnemyAttackerPositioningComponent : UAttackerPositioningComponent {
};

// Class FSD.EscortMuleAttackerPositioning
// Size: 0x120 (Inherited: 0x108)
struct UEscortMuleAttackerPositioning : UAttackerPositioningComponent {
	struct UHealthComponentBase* Health; // 0x108(0x08)
	struct TArray<struct FVector> AttackerPositions; // 0x110(0x10)

	void SetNewMaxAttackers(int32_t newMaxAttackers); // Function FSD.EscortMuleAttackerPositioning.SetNewMaxAttackers // (Final|Native|Public|BlueprintCallable) // @ game+0x108cd10
	void SetCostModifier(float newModifier); // Function FSD.EscortMuleAttackerPositioning.SetCostModifier // (Native|Public|BlueprintCallable) // @ game+0x108cc90
};

// Class FSD.AttackingPointInterface
// Size: 0x28 (Inherited: 0x28)
struct UAttackingPointInterface : UInterface {
};

// Class FSD.AudioFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UAudioFunctionLibrary : UBlueprintFunctionLibrary {

	float SetSoundClassVolume(struct USoundClass* SoundClass, float Volume); // Function FSD.AudioFunctionLibrary.SetSoundClassVolume // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x108cd90
	void PushTimedSoundMix(struct UObject* contextObject, struct USoundMix* mix, float Duration); // Function FSD.AudioFunctionLibrary.PushTimedSoundMix // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x108c810
	float GetSoundClassVolume(struct USoundClass* SoundClass); // Function FSD.AudioFunctionLibrary.GetSoundClassVolume // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x108c570
};

// Class FSD.SoundClassWidget
// Size: 0x230 (Inherited: 0x230)
struct USoundClassWidget : UUserWidget {
};

// Class FSD.AutoCannon
// Size: 0x7a8 (Inherited: 0x6e0)
struct AAutoCannon : AAmmoDrivenWeapon {
	float StartingFireRate; // 0x6e0(0x04)
	float MaxFireRate; // 0x6e4(0x04)
	struct FRuntimeFloatCurve FireRateCurve; // 0x6e8(0x88)
	float FireTimeReductionScale; // 0x770(0x04)
	float FireTimeIncreaseScale; // 0x774(0x04)
	float MaxFireTimeCap; // 0x778(0x04)
	float DamageBonusAtFullROF; // 0x77c(0x04)
	bool StatusEffectAtFullROF; // 0x780(0x01)
	char pad_781[0x3]; // 0x781(0x03)
	float FireTimeOffsetForMaxRateOfFireBonus; // 0x784(0x04)
	float StartLoopingSoundAt; // 0x788(0x04)
	char pad_78C[0x4]; // 0x78c(0x04)
	struct UStatusEffect* StatusAtFullROF; // 0x790(0x08)
	struct UAnimMontage* WPN_Fire_3; // 0x798(0x08)
	float CurrentFireTime; // 0x7a0(0x04)
	char pad_7A4[0x4]; // 0x7a4(0x04)

	void Server_SetStatusActive(bool IsActive); // Function FSD.AutoCannon.Server_SetStatusActive // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x108cb00
};

// Class FSD.AutoCannonAnimInstance
// Size: 0x270 (Inherited: 0x270)
struct UAutoCannonAnimInstance : UAnimInstance {
};

// Class FSD.AutoCarverComponent
// Size: 0x4c0 (Inherited: 0x480)
struct UAutoCarverComponent : UStaticMeshComponent {
	struct UTerrainMaterialBase* TerrainMaterial; // 0x480(0x08)
	float Frequency; // 0x488(0x04)
	float ExpensiveNoise; // 0x48c(0x04)
	float MinDistanceMoved; // 0x490(0x04)
	enum class ECarveFilterType Filter; // 0x494(0x01)
	char pad_495[0x3]; // 0x495(0x03)
	struct FMulticastInlineDelegate OnCarveDoneEvent; // 0x498(0x10)
	char pad_4A8[0x18]; // 0x4a8(0x18)

	void ForceCarve(); // Function FSD.AutoCarverComponent.ForceCarve // (Final|Native|Public|BlueprintCallable) // @ game+0x108c310
};

// Class FSD.STLMeshCarverComponent
// Size: 0x410 (Inherited: 0x3f0)
struct USTLMeshCarverComponent : UPrimitiveComponent {
	struct UTerrainMaterialBase* TerrainMaterial; // 0x3f0(0x08)
	struct USTLMeshCarver* MeshCarver; // 0x3f8(0x08)
	enum class ECarveFilterType Filter; // 0x400(0x01)
	bool PreviewEnabled; // 0x401(0x01)
	char pad_402[0xe]; // 0x402(0x0e)
};

// Class FSD.MeshCarverComponent
// Size: 0x4a0 (Inherited: 0x480)
struct UMeshCarverComponent : UStaticMeshComponent {
	struct UTerrainMaterialBase* TerrainMaterial; // 0x480(0x08)
	enum class ECarveFilterType Filter; // 0x488(0x01)
	char pad_489[0x3]; // 0x489(0x03)
	float ExpensiveNoise; // 0x48c(0x04)
	enum class CarveOptionsCellSize CarverSize; // 0x490(0x01)
	char pad_491[0xf]; // 0x491(0x0f)

	void Carve(); // Function FSD.MeshCarverComponent.Carve // (Final|Native|Public|BlueprintCallable) // @ game+0x108c260
};

// Class FSD.LevelGenerationCarverComponent
// Size: 0x420 (Inherited: 0x3f0)
struct ULevelGenerationCarverComponent : UPrimitiveComponent {
	struct USTLMeshCarver* MeshCarver; // 0x3f0(0x08)
	struct UStaticMesh* ConvexCarver; // 0x3f8(0x08)
	struct UStaticMeshCarver* StaticMeshCarver; // 0x400(0x08)
	struct UTerrainMaterialBase* TerrainMaterial; // 0x408(0x08)
	enum class ECarveFilterType Filter; // 0x410(0x01)
	char pad_411[0x3]; // 0x411(0x03)
	float ConvexExpensiveNoise; // 0x414(0x04)
	enum class CarveOptionsCellSize CarveCellSize; // 0x418(0x01)
	bool PreviewEnabled; // 0x419(0x01)
	bool CarvingDisabled; // 0x41a(0x01)
	bool SelfActivate; // 0x41b(0x01)
	char pad_41C[0x4]; // 0x41c(0x04)
};

// Class FSD.RandomizedInstantMeshCarver
// Size: 0x268 (Inherited: 0x220)
struct ARandomizedInstantMeshCarver : AActor {
	struct TArray<struct UStaticMesh*> CarvingMeshes; // 0x220(0x10)
	struct TArray<struct USTLMeshCarver*> STLCarvingMeshes; // 0x230(0x10)
	struct TArray<struct UStaticMeshCarver*> StaticMeshCarvers; // 0x240(0x10)
	struct FRandRange RandomScale; // 0x250(0x08)
	struct UTerrainMaterialBase* TerrainMaterial; // 0x258(0x08)
	enum class ECarveFilterType Filter; // 0x260(0x01)
	char pad_261[0x7]; // 0x261(0x07)
};

// Class FSD.LevelGenerationCarverComponent2
// Size: 0x550 (Inherited: 0x3f0)
struct ULevelGenerationCarverComponent2 : UPrimitiveComponent {
	struct ACSGBuilder* Carver; // 0x3f0(0x08)
	bool CarvingDisabled; // 0x3f8(0x01)
	char pad_3F9[0x3]; // 0x3f9(0x03)
	int32_t PreviewSeed; // 0x3fc(0x04)
	struct FBakeSettings CarverSettings; // 0x400(0x140)
	bool SelfActivate; // 0x540(0x01)
	char pad_541[0x7]; // 0x541(0x07)
	struct UCSGPreviewComponent* PreviewComponent; // 0x548(0x08)
};

// Class FSD.AvoidCeilingComponent
// Size: 0xf8 (Inherited: 0xb0)
struct UAvoidCeilingComponent : UActorComponent {
	float MaxDuckDistance; // 0xb0(0x04)
	float TraceVerticalStart; // 0xb4(0x04)
	float MinVerticalSpace; // 0xb8(0x04)
	float DuckSpeed; // 0xbc(0x04)
	struct USceneComponent* ComponentToMove; // 0xc0(0x08)
	bool IsDuckingEnabled; // 0xc8(0x01)
	char pad_C9[0x2f]; // 0xc9(0x2f)
};

// Class FSD.Ball
// Size: 0xb0 (Inherited: 0xb0)
struct UBall : UActorComponent {
};

// Class FSD.WindowWidget
// Size: 0x270 (Inherited: 0x230)
struct UWindowWidget : UUserWidget {
	struct FMulticastInlineDelegate OnWindowClosed; // 0x230(0x10)
	char pad_240[0x28]; // 0x240(0x28)
	bool bHandleCloseCommand; // 0x268(0x01)
	bool bResolutionDownscaleWhenOpen; // 0x269(0x01)
	char pad_26A[0x6]; // 0x26a(0x06)

	void WindowDelegate__DelegateSignature(struct UWindowWidget* Window); // DelegateFunction FSD.WindowWidget.WindowDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x158ca90
	void ReceiveSelectPreviousCommand(); // Function FSD.WindowWidget.ReceiveSelectPreviousCommand // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void ReceiveSelectNextCommand(); // Function FSD.WindowWidget.ReceiveSelectNextCommand // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void ReceiveSelectCharacterCommand(); // Function FSD.WindowWidget.ReceiveSelectCharacterCommand // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void ReceiveOkCommand(); // Function FSD.WindowWidget.ReceiveOkCommand // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void ReceiveCloseCommand(); // Function FSD.WindowWidget.ReceiveCloseCommand // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void OnShown(); // Function FSD.WindowWidget.OnShown // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void OnNewTopWindow(); // Function FSD.WindowWidget.OnNewTopWindow // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void OnClosed(); // Function FSD.WindowWidget.OnClosed // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void ConsumeCommand(); // Function FSD.WindowWidget.ConsumeCommand // (Final|Native|Protected|BlueprintCallable) // @ game+0x123eb30
	void CloseThisWindow(); // Function FSD.WindowWidget.CloseThisWindow // (Final|Native|Public|BlueprintCallable) // @ game+0x123eb10
};

// Class FSD.BarMenuWidget
// Size: 0x278 (Inherited: 0x270)
struct UBarMenuWidget : UWindowWidget {
	struct TWeakObjectPtr<struct ASpaceRigBar> SpaceRigBar; // 0x270(0x08)
};

// Class FSD.BarrierProjectile
// Size: 0x220 (Inherited: 0x220)
struct ABarrierProjectile : AActor {
};

// Class FSD.WeaponFireComponent
// Size: 0x110 (Inherited: 0xb0)
struct UWeaponFireComponent : UActorComponent {
	char pad_B0[0x8]; // 0xb0(0x08)
	struct FMulticastInlineDelegate OnWeaponFired; // 0xb8(0x10)
	struct FMulticastInlineDelegate OnWeaponFireEnded; // 0xc8(0x10)
	struct FMulticastInlineDelegate OnRicochetEvent; // 0xd8(0x10)
	char pad_E8[0x10]; // 0xe8(0x10)
	struct TScriptInterface<None> Weapon; // 0xf8(0x10)
	char pad_108[0x8]; // 0x108(0x08)

	void StopFire(); // Function FSD.WeaponFireComponent.StopFire // (Native|Public|BlueprintCallable) // @ game+0x109fdb0
	void Server_SetShotPower(float shotPower); // Function FSD.WeaponFireComponent.Server_SetShotPower // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x123b4c0
	void Fire(struct FVector Origin, struct FVector_NetQuantizeNormal Direction, bool playFireFX); // Function FSD.WeaponFireComponent.Fire // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1239ec0
};

// Class FSD.BasicWeaponFireComponent
// Size: 0x110 (Inherited: 0x110)
struct UBasicWeaponFireComponent : UWeaponFireComponent {

	void Server_FireWeapon(); // Function FSD.BasicWeaponFireComponent.Server_FireWeapon // (Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x108cae0
	void Server_EndFire(); // Function FSD.BasicWeaponFireComponent.Server_EndFire // (Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x108cac0
	void All_WeaponFired(); // Function FSD.BasicWeaponFireComponent.All_WeaponFired // (Net|Native|Event|NetMulticast|Protected) // @ game+0x108ba50
};

// Class FSD.BeltDrivenWeapon
// Size: 0x710 (Inherited: 0x6e0)
struct ABeltDrivenWeapon : AAmmoDrivenWeapon {
	struct UAudioComponent* BarrelAudio; // 0x6e0(0x08)
	struct USoundCue* BarrelSound; // 0x6e8(0x08)
	float BarrelFadeIn; // 0x6f0(0x04)
	float BarrelFadeOut; // 0x6f4(0x04)
	struct UCurveFloat* BarrelPitchCurve; // 0x6f8(0x08)
	float BarrelSpinUpTime; // 0x700(0x04)
	float BarrelSpinDownTime; // 0x704(0x04)
	float CurrentSpinRate; // 0x708(0x04)
	bool Simulate_SpinBarrel; // 0x70c(0x01)
	char pad_70D[0x3]; // 0x70d(0x03)

	void Server_StopBarrel(); // Function FSD.BeltDrivenWeapon.Server_StopBarrel // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x1092350
	void Server_StartBarrel(); // Function FSD.BeltDrivenWeapon.Server_StartBarrel // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x1092330
};

// Class FSD.GatlingGun
// Size: 0x770 (Inherited: 0x710)
struct AGatlingGun : ABeltDrivenWeapon {
	bool BarrelProximityDamageEnabled; // 0x710(0x01)
	char pad_711[0x3]; // 0x711(0x03)
	float BarrelProximityDamageDistance; // 0x714(0x04)
	float BarrelProximityDamageRadius; // 0x718(0x04)
	float BarrelProximityDamageLength; // 0x71c(0x04)
	float TimeBetweenProximityDamageTicks; // 0x720(0x04)
	char pad_724[0x14]; // 0x724(0x14)
	float DamageMultiplierAtMaxStabilization; // 0x738(0x04)
	char pad_73C[0x4]; // 0x73c(0x04)
	struct UFXSystemAsset* HotShellsTracerParticles; // 0x740(0x08)
	char pad_748[0x8]; // 0x748(0x08)
	float HeatRemovedOnKill; // 0x750(0x04)
	bool CriticalOverheatEnabled; // 0x754(0x01)
	bool HotShellsOn; // 0x755(0x01)
	char pad_756[0x2]; // 0x756(0x02)
	float HotShellsTemperatureRequired; // 0x758(0x04)
	char pad_75C[0x4]; // 0x75c(0x04)
	struct UDamageComponent* DamageComponent; // 0x760(0x08)
	struct UDamageComponent* BarrelProximityDamageComponent; // 0x768(0x08)

	void Server_SetHotShellsOn(bool hotShellsIsOn); // Function FSD.GatlingGun.Server_SetHotShellsOn // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x1092030
	void OnRep_HotShellsTracerOn(); // Function FSD.GatlingGun.OnRep_HotShellsTracerOn // (Final|Native|Protected) // @ game+0x1091b70
	void OnGatlingTemperatureChanged(float Temperature, bool isOverheated); // Function FSD.GatlingGun.OnGatlingTemperatureChanged // (Final|Native|Protected) // @ game+0x10916b0
	void OnEnemyKilled(struct AActor* Target, struct UFSDPhysicalMaterial* PhysMat); // Function FSD.GatlingGun.OnEnemyKilled // (Final|Native|Protected) // @ game+0x10915f0
	void Client_RemoveHeat(); // Function FSD.GatlingGun.Client_RemoveHeat // (Net|NetReliableNative|Event|Protected|NetClient) // @ game+0x1090c60
};

// Class FSD.BeltDrivenAnimInstance
// Size: 0x2b0 (Inherited: 0x280)
struct UBeltDrivenAnimInstance : UAmmoDrivenWeaponAnimInstance {
	float BarrelSpinRate; // 0x280(0x04)
	float CurrentBarrelSpinRate; // 0x284(0x04)
	struct FVector ExternalForce; // 0x288(0x0c)
	float ExternalForceScale; // 0x294(0x04)
	struct FName ExternalForceBoneName; // 0x298(0x08)
	char pad_2A0[0x10]; // 0x2a0(0x10)
};

// Class FSD.Biome
// Size: 0x430 (Inherited: 0x30)
struct UBiome : UDataAsset {
	struct FText BiomeName; // 0x30(0x18)
	struct FText BiomeShortName; // 0x48(0x18)
	struct FText BiomeDescription; // 0x60(0x18)
	struct FColor BiomeColor; // 0x78(0x04)
	int32_t BiomeIndex; // 0x7c(0x04)
	struct FString BiomeAnalyticsIndex; // 0x80(0x10)
	struct TSoftObjectPtr<struct UFileMediaSource> BiomeMovie; // 0x90(0x28)
	struct TSoftObjectPtr<struct UTexture2D> BiomePicture; // 0xb8(0x28)
	struct TSoftObjectPtr<struct UTexture2D> BiomeIcon; // 0xe0(0x28)
	struct TSoftObjectPtr<struct UTexture2D> BiomeLargeImage; // 0x108(0x28)
	struct TSoftObjectPtr<struct UTexture2D> BiomeWorldMap; // 0x130(0x28)
	struct TSoftObjectPtr<struct UTexture2D> BiomeMissionBar; // 0x158(0x28)
	SoftClassProperty BiomeMapWidget; // 0x180(0x28)
	struct FHeatSource BiomeHeatSource; // 0x1a8(0x08)
	struct FRandRange DepthRange; // 0x1b0(0x08)
	struct TSoftObjectPtr<struct UParticleSystem> AtmosphericParticles; // 0x1b8(0x28)
	struct TArray<SoftClassProperty> CaveScriptComponents; // 0x1e0(0x10)
	float ExtraCaveSize; // 0x1f0(0x04)
	char pad_1F4[0x4]; // 0x1f4(0x04)
	struct TArray<struct UDebrisSet*> Debris; // 0x1f8(0x10)
	SoftClassProperty DebrisActor; // 0x208(0x28)
	SoftClassProperty PostProcessActorClass; // 0x230(0x28)
	struct UTerrainMaterial* RockMaterial; // 0x258(0x08)
	struct UTerrainMaterial* DirtMaterial; // 0x260(0x08)
	struct UTerrainMaterial* BurnedMaterialOverride; // 0x268(0x08)
	struct TArray<struct UMaterialInstance*> FlavorMaterials; // 0x270(0x10)
	struct TArray<struct FBiomeNoiseItem> RoomNoises; // 0x280(0x10)
	struct UMissionStat* MissionCompleted; // 0x290(0x08)
	struct UFloodFillSettings* CeilingNoise; // 0x298(0x08)
	struct UDetailNoise* CeilingDetailNoise; // 0x2a0(0x08)
	struct UFloodFillSettings* WallNoise; // 0x2a8(0x08)
	struct UDetailNoise* WallDetailNoise; // 0x2b0(0x08)
	struct UFloodFillSettings* FloorNoise; // 0x2b8(0x08)
	struct UDetailNoise* FloorDetailNoise; // 0x2c0(0x08)
	struct UFloodFillSettings* PillarNoise; // 0x2c8(0x08)
	struct UDetailNoise* PillarDetailNoise; // 0x2d0(0x08)
	struct UPillarSettings* PillarSettings; // 0x2d8(0x08)
	struct TArray<struct UTunnelSetting*> TunnelSettings; // 0x2e0(0x10)
	struct UFloodFillSettings* TunnelCeilingNoise; // 0x2f0(0x08)
	struct UFloodFillSettings* TunnelWallNoise; // 0x2f8(0x08)
	struct UFloodFillSettings* TunnelFloorNoise; // 0x300(0x08)
	struct TArray<struct FResourceSpawner> Resources; // 0x308(0x10)
	struct TArray<struct FBiomeEnemyEntry> Enemies; // 0x318(0x10)
	struct TArray<struct UEnemyDescriptor*> BannedEnemies; // 0x328(0x10)
	struct TArray<struct UEnemyDescriptor*> StationaryEnemies; // 0x338(0x10)
	struct TArray<struct UCritterDescriptor*> Critters; // 0x348(0x10)
	struct TSoftObjectPtr<struct USoundCue> AmbientSounds; // 0x358(0x28)
	bool Use3DAmbient; // 0x380(0x01)
	char pad_381[0x7]; // 0x381(0x07)
	struct FReverbSettings ReverbSettings; // 0x388(0x20)
	float SmallCaveReverbVolume; // 0x3a8(0x04)
	char pad_3AC[0x4]; // 0x3ac(0x04)
	struct UReverbEffect* SmallCaveReverb; // 0x3b0(0x08)
	float MediumCaveReverbVolume; // 0x3b8(0x04)
	char pad_3BC[0x4]; // 0x3bc(0x04)
	struct UReverbEffect* MediumCaveReverb; // 0x3c0(0x08)
	float LargeCaveReverbVolume; // 0x3c8(0x04)
	char pad_3CC[0x4]; // 0x3cc(0x04)
	struct UReverbEffect* LargeCaveReverb; // 0x3d0(0x08)
	struct USoundCue* TunnelAmbience; // 0x3d8(0x08)
	struct TSoftObjectPtr<struct ULevelSequence> BiomeLoaderLevelSequence; // 0x3e0(0x28)
	struct FString BiomeLoaderLevelName; // 0x408(0x10)
	struct TArray<struct FText> Quotes; // 0x418(0x10)
	float PlanetZoneSelectionWeight; // 0x428(0x04)
	char pad_42C[0x4]; // 0x42c(0x04)

	struct UTerrainMaterial* GetRockMaterial(); // Function FSD.Biome.GetRockMaterial // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1091330
	SoftClassProperty GetPostProcessActorClass_Soft(); // Function FSD.Biome.GetPostProcessActorClass_Soft // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10912a0
	struct UTerrainMaterial* GetDirtMaterial(); // Function FSD.Biome.GetDirtMaterial // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1091240
	SoftClassProperty GetDebrisActorSoftClass(); // Function FSD.Biome.GetDebrisActorSoftClass // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1091150
	struct UTexture2D* GetBiomeWorldMap(); // Function FSD.Biome.GetBiomeWorldMap // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10910e0
	struct UTexture2D* GetBiomePicture(); // Function FSD.Biome.GetBiomePicture // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10910b0
	struct FText GetBiomeName(); // Function FSD.Biome.GetBiomeName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1090fb0
	struct UTexture2D* GetBiomeMissionBar(); // Function FSD.Biome.GetBiomeMissionBar // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1090f80
	struct UUserWidget* GetBiomeMapWidget(); // Function FSD.Biome.GetBiomeMapWidget // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1090f40
	struct TArray<struct FSoftObjectPath> GetBiomeMapAssetList(); // Function FSD.Biome.GetBiomeMapAssetList // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1090e50
	struct UTexture2D* GetBiomeLargeImage(); // Function FSD.Biome.GetBiomeLargeImage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1090e20
	int32_t GetBiomeIndex(); // Function FSD.Biome.GetBiomeIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1090e00
	struct UTexture2D* GetBiomeIcon(); // Function FSD.Biome.GetBiomeIcon // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1090dd0
	struct FString GetBiomeAnalyticsIndex(); // Function FSD.Biome.GetBiomeAnalyticsIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1090d10
	struct UParticleSystem* GetAtmosphericParticles(); // Function FSD.Biome.GetAtmosphericParticles // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1090ce0
	struct USoundCue* GetAmbientSounds(); // Function FSD.Biome.GetAmbientSounds // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1090cb0
};

// Class FSD.BobbingComponent
// Size: 0x220 (Inherited: 0x1f0)
struct UBobbingComponent : USceneComponent {
	struct FMulticastInlineDelegate OnMovedIntoSomethingEvent; // 0x1f0(0x10)
	struct AActor* OwnerActor; // 0x200(0x08)
	bool DoOrientationChecks; // 0x208(0x01)
	char pad_209[0x3]; // 0x209(0x03)
	float BobSpeed; // 0x20c(0x04)
	float BobSize; // 0x210(0x04)
	float OrentationChecksPerSecond; // 0x214(0x04)
	char pad_218[0x8]; // 0x218(0x08)

	void SetOwner(struct AActor* AActor); // Function FSD.BobbingComponent.SetOwner // (Final|Native|Public|BlueprintCallable) // @ game+0x1092590
};

// Class FSD.BoltActionWeapon
// Size: 0x810 (Inherited: 0x6e0)
struct ABoltActionWeapon : AAmmoDrivenWeapon {
	struct FMulticastInlineDelegate FullyFocusedEvent; // 0x6e0(0x10)
	struct FMulticastInlineDelegate FocusLostEvent; // 0x6f0(0x10)
	struct UDamageComponent* DamageComponent; // 0x700(0x08)
	struct UHitscanBaseComponent* HitscanComponent; // 0x708(0x08)
	struct UStatusEffect* FocusedHitSTE; // 0x710(0x08)
	bool RequireWeakspotForFocusedHitSTE; // 0x718(0x01)
	bool IsNoGravityOnFocusEnabled; // 0x719(0x01)
	char pad_71A[0x2]; // 0x71a(0x02)
	float NoGravityOnFocusDuration; // 0x71c(0x04)
	float NoGravityFocusFallFriction; // 0x720(0x04)
	float NoGravityFocusGravityScale; // 0x724(0x04)
	char pad_728[0x4]; // 0x728(0x04)
	float ZoomSpreadAmount; // 0x72c(0x04)
	float ZoomMinSpreadWhileMoving; // 0x730(0x04)
	char pad_734[0x4]; // 0x734(0x04)
	float ChargeSpeed; // 0x738(0x04)
	float ChargeAmmoCost; // 0x73c(0x04)
	float ChargeRecoilMult; // 0x740(0x04)
	char pad_744[0x14]; // 0x744(0x14)
	struct USoundCue* ZoomedInAudio; // 0x758(0x08)
	struct UParticleSystem* ChargedShotTrailParticles; // 0x760(0x08)
	struct FTracerData ChargedShotTracer; // 0x768(0x30)
	struct USoundCue* ButtonDownFireSound; // 0x798(0x08)
	struct USoundCue* ChargedShotFireSound; // 0x7a0(0x08)
	float ChargedFoVChange; // 0x7a8(0x04)
	float ChargedFoVFadeSpeed; // 0x7ac(0x04)
	float MinCharge; // 0x7b0(0x04)
	float SlowMovementAtCharge; // 0x7b4(0x04)
	float FullChargeDamageBonus; // 0x7b8(0x04)
	float AimedShotStaggerChance; // 0x7bc(0x04)
	float AimedWeakspotKilLRange; // 0x7c0(0x04)
	char pad_7C4[0x4]; // 0x7c4(0x04)
	float TargetKilledReloadTimeBoost; // 0x7c8(0x04)
	float TargetKilledReloadTimeBoostDuration; // 0x7cc(0x04)
	char pad_7D0[0x12]; // 0x7d0(0x12)
	bool LastShotWasAimed; // 0x7e2(0x01)
	char pad_7E3[0xd]; // 0x7e3(0x0d)
	bool IsMovementSlowed; // 0x7f0(0x01)
	char pad_7F1[0x17]; // 0x7f1(0x17)
	bool ChargeAffectsDamage; // 0x808(0x01)
	bool Charging; // 0x809(0x01)
	char pad_80A[0x2]; // 0x80a(0x02)
	float ChargeProgress; // 0x80c(0x04)

	void SetOverheated(bool isOverheated); // Function FSD.BoltActionWeapon.SetOverheated // (Final|Native|Protected|BlueprintCallable) // @ game+0x1092500
	void Server_SetIsMovementSlowed(bool bisMovementSlowed); // Function FSD.BoltActionWeapon.Server_SetIsMovementSlowed // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x1092270
	void Server_SetIsLatestShotFocused(bool bisShotFocused); // Function FSD.BoltActionWeapon.Server_SetIsLatestShotFocused // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x10921b0
	void Server_SetIsChargingShot(bool bisCharging); // Function FSD.BoltActionWeapon.Server_SetIsChargingShot // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x10920f0
	void OnTimerElapsed(); // Function FSD.BoltActionWeapon.OnTimerElapsed // (Final|Native|Protected) // @ game+0x1091ed0
	void OnTargetKilled(struct AActor* Target, struct UFSDPhysicalMaterial* PhysicalMaterial); // Function FSD.BoltActionWeapon.OnTargetKilled // (Final|Native|Protected) // @ game+0x1091e10
	void OnTargetDamaged(struct UHealthComponentBase* Health, float Amount, struct UPrimitiveComponent* HitComponent, struct UFSDPhysicalMaterial* PhysicalMaterial); // Function FSD.BoltActionWeapon.OnTargetDamaged // (Final|Native|Protected) // @ game+0x1091cc0
	void OnShotPowerSet(); // Function FSD.BoltActionWeapon.OnShotPowerSet // (Final|Native|Protected) // @ game+0x1091c10
	void OnMovementSlowed(bool isSlowed); // Function FSD.BoltActionWeapon.OnMovementSlowed // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void Client_OnTargetKilled(bool BoostReloadTime); // Function FSD.BoltActionWeapon.Client_OnTargetKilled // (Net|NetReliableNative|Event|Protected|NetClient) // @ game+0x1090bd0
};

// Class FSD.BoltActionWeaponAnimInstance
// Size: 0x270 (Inherited: 0x270)
struct UBoltActionWeaponAnimInstance : UAnimInstance {
};

// Class FSD.Bomber
// Size: 0x520 (Inherited: 0x448)
struct ABomber : AAFlyingBug {
	struct UAudioComponent* GooSoundComponent; // 0x448(0x08)
	struct UParticleSystemComponent* AcidEmitterLeft; // 0x450(0x08)
	struct UParticleSystemComponent* AcidEmitterRight; // 0x458(0x08)
	char pad_460[0x28]; // 0x460(0x28)
	struct AProjectile* AcidProjectile; // 0x488(0x08)
	struct UParticleSystem* deathParticles; // 0x490(0x08)
	struct USoundBase* deathSound; // 0x498(0x08)
	struct USoundBase* DeathPanicSound; // 0x4a0(0x08)
	struct UParticleSystem* BleedParticles; // 0x4a8(0x08)
	struct USoundBase* BladderDestroyedNoise; // 0x4b0(0x08)
	struct TWeakObjectPtr<struct UParticleSystemComponent> BleedParticlesComponent; // 0x4b8(0x08)
	struct TWeakObjectPtr<struct UAudioComponent> PanicAudioComponent; // 0x4c0(0x08)
	float RagdollForceModifier; // 0x4c8(0x04)
	float DeathYRotationSpeed; // 0x4cc(0x04)
	float DeathXRotationSpeed; // 0x4d0(0x04)
	float SearchRange; // 0x4d4(0x04)
	float NewPointMax; // 0x4d8(0x04)
	float NewPointMin; // 0x4dc(0x04)
	float DeathSpeed; // 0x4e0(0x04)
	float DeathAcceleration; // 0x4e4(0x04)
	float AcidRate; // 0x4e8(0x04)
	float PostDeathAcidTime; // 0x4ec(0x04)
	char pad_4F0[0x18]; // 0x4f0(0x18)
	bool HasDied; // 0x508(0x01)
	bool IsRightDestroyed; // 0x509(0x01)
	bool IsLeftDestroyed; // 0x50a(0x01)
	bool dropAcid; // 0x50b(0x01)
	char pad_50C[0x14]; // 0x50c(0x14)

	void StopSpinAndDie(); // Function FSD.Bomber.StopSpinAndDie // (Final|Native|Protected) // @ game+0x10926e0
	void SetDropAcid(bool dropAcid); // Function FSD.Bomber.SetDropAcid // (Final|Native|Public|BlueprintCallable) // @ game+0x1092370
	void OnStartDeathPanic(); // Function FSD.Bomber.OnStartDeathPanic // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void OnRep_DropAcid(); // Function FSD.Bomber.OnRep_DropAcid // (Final|Native|Protected) // @ game+0x1091b50
	void OnRep_Death(); // Function FSD.Bomber.OnRep_Death // (Native|Protected) // @ game+0x1088530
	void OnRagdollHitGround(struct UPrimitiveComponent* HitComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, struct FVector NormalImpulse, struct FHitResult Hit); // Function FSD.Bomber.OnRagdollHitGround // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x1091960
	void OnBladderDamage(float Amount); // Function FSD.Bomber.OnBladderDamage // (Final|Native|Protected) // @ game+0x1091570
	void OnArmorDestroyed(struct FName Name); // Function FSD.Bomber.OnArmorDestroyed // (Final|Native|Protected|BlueprintCallable) // @ game+0x10914f0
	void HideMesh(); // Function FSD.Bomber.HideMesh // (Final|Native|Protected) // @ game+0x10913a0
	bool GetDropAcid(); // Function FSD.Bomber.GetDropAcid // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1091260
	bool AreBladdersDestroyed(); // Function FSD.Bomber.AreBladdersDestroyed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1090ba0
};

// Class FSD.BomberAnimInstance
// Size: 0x300 (Inherited: 0x2f0)
struct UBomberAnimInstance : UFlyingBugAnimInstance {
	bool IsBombing; // 0x2f0(0x01)
	bool IsSpiraling; // 0x2f1(0x01)
	char pad_2F2[0xe]; // 0x2f2(0x0e)
};

// Class FSD.BoolUserSettingAsset
// Size: 0x58 (Inherited: 0x30)
struct UBoolUserSettingAsset : UDataAsset {
	struct FText SettingDisplayTitle; // 0x30(0x18)
	struct FName SettingID; // 0x48(0x08)
	bool SettingDefaultValue; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)

	void SetValue(bool InValue); // Function FSD.BoolUserSettingAsset.SetValue // (Final|Native|Public|BlueprintCallable) // @ game+0x1092610
	bool GetValue(); // Function FSD.BoolUserSettingAsset.GetValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1091370
};

// Class FSD.BoscoAbillity
// Size: 0x68 (Inherited: 0x30)
struct UBoscoAbillity : UDataAsset {
	struct FName AbillityName; // 0x30(0x08)
	struct UAnimSequenceBase* AbillityAnimation; // 0x38(0x08)
	struct USoundBase* VoiceOnUse; // 0x40(0x08)
	enum class EBoscoAbillityTargetPreference TargetType; // 0x48(0x01)
	char pad_49[0x3]; // 0x49(0x03)
	float CoolDown; // 0x4c(0x04)
	float WindUp; // 0x50(0x04)
	float Duration; // 0x54(0x04)
	float range; // 0x58(0x04)
	float RechargeTime; // 0x5c(0x04)
	int32_t MaxCharges; // 0x60(0x04)
	bool TargetActorIfValid; // 0x64(0x01)
	bool RotateTowardsTarget; // 0x65(0x01)
	char pad_66[0x2]; // 0x66(0x02)
};

// Class FSD.BoscoSpawnActorAbillity
// Size: 0x70 (Inherited: 0x68)
struct UBoscoSpawnActorAbillity : UBoscoAbillity {
	struct AActor* SpawnedActorClass; // 0x68(0x08)
};

// Class FSD.BoscoProjectileAbillity
// Size: 0x70 (Inherited: 0x68)
struct UBoscoProjectileAbillity : UBoscoAbillity {
	struct AProjectile* projectileClass; // 0x68(0x08)
};

// Class FSD.Bosco
// Size: 0x6c0 (Inherited: 0x380)
struct ABosco : ADeepPathfinderCharacter {
	char pad_380[0x38]; // 0x380(0x38)
	struct UHealthComponent* HealthComponent; // 0x3b8(0x08)
	struct UBoscoAbillityComponent* AbillityComponent; // 0x3c0(0x08)
	struct UDamageComponent* Damage; // 0x3c8(0x08)
	struct UPawnSensingComponent* Senses; // 0x3d0(0x08)
	struct UDroneMiningToolBase* MiningTool; // 0x3d8(0x08)
	struct UBobbingComponent* BobbingComponent; // 0x3e0(0x08)
	struct USkeletalMeshComponent* BoscoMesh; // 0x3e8(0x08)
	struct UHitscanComponent* DroneHitScan; // 0x3f0(0x08)
	struct USpotLightComponent* SpotLightComponent; // 0x3f8(0x08)
	struct UPointLightComponent* PointLightComponent; // 0x400(0x08)
	struct UParticleSystemComponent* LTrail; // 0x408(0x08)
	struct UParticleSystemComponent* RTrail; // 0x410(0x08)
	struct UAudioComponent* MomentumSound; // 0x418(0x08)
	struct UDialogDataAsset* DefendDrilldozerShout; // 0x420(0x08)
	struct UDialogDataAsset* DefendGenericShout; // 0x428(0x08)
	struct UDialogDataAsset* MineOrderShout; // 0x430(0x08)
	struct UDialogDataAsset* KillOrderShout; // 0x438(0x08)
	struct UDialogDataAsset* GoToOrderShout; // 0x440(0x08)
	struct UDialogDataAsset* ReviveOrderShout; // 0x448(0x08)
	struct UDialogDataAsset* PickupGemShout; // 0x450(0x08)
	struct UDialogDataAsset* ReviveThankShout; // 0x458(0x08)
	struct UDialogDataAsset* GeneralCallShout; // 0x460(0x08)
	struct UDialogDataAsset* RocketAbillityShout; // 0x468(0x08)
	struct UDialogDataAsset* CryoGrenadeAbillityShout; // 0x470(0x08)
	struct USoundBase* MineResponse; // 0x478(0x08)
	struct USoundBase* CombatResponse; // 0x480(0x08)
	struct USoundBase* LightResponse; // 0x488(0x08)
	struct USoundBase* ReviveResponse; // 0x490(0x08)
	struct USoundBase* AbillityResponse; // 0x498(0x08)
	struct USoundBase* CurrentResponse; // 0x4a0(0x08)
	float ResponseTime; // 0x4a8(0x04)
	char pad_4AC[0x4]; // 0x4ac(0x04)
	struct FMulticastInlineDelegate OnReviveused; // 0x4b0(0x10)
	struct FMulticastInlineDelegate OnStateChanged; // 0x4c0(0x10)
	char pad_4D0[0x20]; // 0x4d0(0x20)
	struct FGameplayTagContainer LosMatchTags; // 0x4f0(0x20)
	float SeeTargetTime; // 0x510(0x04)
	char pad_514[0x4]; // 0x514(0x04)
	struct USoundBase* AbillityErrorSound; // 0x518(0x08)
	float INcreasedMiningArea; // 0x520(0x04)
	float TimeToResetMiningBoost; // 0x524(0x04)
	float MiningBoosMultiplier; // 0x528(0x04)
	char pad_52C[0x4]; // 0x52c(0x04)
	struct TArray<struct UItemUpgrade*> upgrades; // 0x530(0x10)
	struct UBoscoProjectileAbillity* RocketAbillity; // 0x540(0x08)
	struct UBoscoProjectileAbillity* CryoGrenadeAbillity; // 0x548(0x08)
	struct FGuid SaveGameID; // 0x550(0x10)
	struct UItemID* ItemID; // 0x560(0x08)
	struct UUpgradableBoscoComponent* Upgradable; // 0x568(0x08)
	struct UAnimSequenceBase* SaluteAnimation; // 0x570(0x08)
	struct UAnimSequenceBase* PickupGemAnimation; // 0x578(0x08)
	struct UAnimSequenceBase* DropGemAnimation; // 0x580(0x08)
	struct TArray<struct UAnimSequenceBase*> HitReaction; // 0x588(0x10)
	float SaluteDuration; // 0x598(0x04)
	char pad_59C[0x4]; // 0x59c(0x04)
	struct UDroneSkinnableComponent* Skinnable; // 0x5a0(0x08)
	struct TArray<struct FBoscoLightSetting> LightSettings; // 0x5a8(0x10)
	int32_t TargetLightSetting; // 0x5b8(0x04)
	char pad_5BC[0x4]; // 0x5bc(0x04)
	struct TArray<struct UBoscoAbillity*> CombatAbillities; // 0x5c0(0x10)
	struct AActor* RotateTarget; // 0x5d0(0x08)
	struct FVector LookAtLocation; // 0x5d8(0x0c)
	char pad_5E4[0x4]; // 0x5e4(0x04)
	struct USoundCue* ShootSound; // 0x5e8(0x08)
	float ShootSoundFadeout; // 0x5f0(0x04)
	char pad_5F4[0x4]; // 0x5f4(0x04)
	struct USoundCue* ShootSoundTail; // 0x5f8(0x08)
	struct UAudioComponent* ShootSoundInstance; // 0x600(0x08)
	struct UParticleSystem* MuzzleEffect; // 0x608(0x08)
	struct UParticleSystem* TracerEffect; // 0x610(0x08)
	float FireRate; // 0x618(0x04)
	int32_t MinShotsInBurst; // 0x61c(0x04)
	int32_t MaxShotsInBurst; // 0x620(0x04)
	float MaxRandomBurstCooldown; // 0x624(0x04)
	float MinRandomBurstCooldown; // 0x628(0x04)
	float MaxFiringAngle; // 0x62c(0x04)
	float MaxEngagementRange; // 0x630(0x04)
	float MinTracerDistance; // 0x634(0x04)
	float TracerSpeed; // 0x638(0x04)
	char pad_63C[0x4]; // 0x63c(0x04)
	struct USoundBase* ReviveSirens; // 0x640(0x08)
	struct TWeakObjectPtr<struct UAudioComponent> ReviveSirensComponent; // 0x648(0x08)
	float DistanceToFacePlayer; // 0x650(0x04)
	float RotationSpeed; // 0x654(0x04)
	float PrepareToMineRange; // 0x658(0x04)
	float MiningRange; // 0x65c(0x04)
	char pad_660[0x28]; // 0x660(0x28)
	int32_t MaxRevives; // 0x688(0x04)
	char pad_68C[0x10]; // 0x68c(0x10)
	bool IsFiring; // 0x69c(0x01)
	bool IsInRangeToMine; // 0x69d(0x01)
	bool IsPreparedToMine; // 0x69e(0x01)
	bool IsMining; // 0x69f(0x01)
	bool IsReviving; // 0x6a0(0x01)
	bool IsRotateMode; // 0x6a1(0x01)
	char pad_6A2[0xe]; // 0x6a2(0x0e)
	struct ABoscoController* DroneController; // 0x6b0(0x08)
	enum class EDroneAIState CurrentState; // 0x6b8(0x01)
	char pad_6B9[0x7]; // 0x6b9(0x07)

	void UseABillity(); // Function FSD.Bosco.UseABillity // (Final|Native|Public|BlueprintCallable) // @ game+0x1092700
	void StopShootingSound(); // Function FSD.Bosco.StopShootingSound // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x10926c0
	void StateChanged(enum class EDroneAIState aCurrentState); // Function FSD.Bosco.StateChanged // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void StartSelfDestruct(); // Function FSD.Bosco.StartSelfDestruct // (Final|Native|Public|BlueprintCallable) // @ game+0x10926a0
	void SetIsReviving(bool aIsReviving); // Function FSD.Bosco.SetIsReviving // (Final|Native|Public|BlueprintCallable) // @ game+0x1092480
	void SetIsRepairing(bool isRepairing); // Function FSD.Bosco.SetIsRepairing // (Final|Native|Public|BlueprintCallable) // @ game+0x1092400
	void SelfDestruct(); // Function FSD.Bosco.SelfDestruct // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void ReviveCounterChanged(int32_t remainingCharges); // Function FSD.Bosco.ReviveCounterChanged // (Native|Public) // @ game+0x1091fa0
	void Respond(); // Function FSD.Bosco.Respond // (Final|Native|Protected) // @ game+0x1091f80
	void PlaySalute(); // Function FSD.Bosco.PlaySalute // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x10877d0
	void OnWeaponFired(struct FVector Location); // Function FSD.Bosco.OnWeaponFired // (Native|Protected|HasOutParms|HasDefaults) // @ game+0x1091ef0
	void OnTargetBurrowChange(bool burrowed); // Function FSD.Bosco.OnTargetBurrowChange // (Final|Native|Protected) // @ game+0x1091c30
	void OnRep_State(enum class EDroneAIState prevState); // Function FSD.Bosco.OnRep_State // (Native|Public) // @ game+0x1091b90
	void OnReadyToShoot(); // Function FSD.Bosco.OnReadyToShoot // (Final|Native|Protected) // @ game+0x1091b30
	void OnNotReadyToShoot(); // Function FSD.Bosco.OnNotReadyToShoot // (Final|Native|Protected) // @ game+0x1091940
	void OnHit(float Amount, float BaseAmount, struct UPrimitiveComponent* Component, struct UFSDPhysicalMaterial* PhysMat, struct FName BoneName); // Function FSD.Bosco.OnHit // (Final|Native|Protected|HasOutParms) // @ game+0x10917a0
	void OnGrabbedGem(); // Function FSD.Bosco.OnGrabbedGem // (Final|Native|Public|BlueprintCallable) // @ game+0x1091780
	void MineEffects(struct UTerrainMaterial* aTerrainMaterial, struct FVector_NetQuantize aLocation, struct FRotator aRotation); // Function FSD.Bosco.MineEffects // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // @ game+0x10913c0
	struct UUpgradableBoscoComponent* GetUpgradeComponent(); // Function FSD.Bosco.GetUpgradeComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x1091350
	int32_t GetReviveCharges(); // Function FSD.Bosco.GetReviveCharges // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1091300
	struct UBoscoAbillityComponent* GetPlayerAbillity(); // Function FSD.Bosco.GetPlayerAbillity // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1091280
	enum class EDroneAIState GetCurrentState(); // Function FSD.Bosco.GetCurrentState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1091130
	bool GetCarryInterrupted(); // Function FSD.Bosco.GetCarryInterrupted // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1091110
	bool DoPickupGemAnimation(); // Function FSD.Bosco.DoPickupGemAnimation // (Final|Native|Public|BlueprintCallable) // @ game+0x1090c80
	void All_OnSelfDestruct(); // Function FSD.Bosco.All_OnSelfDestruct // (Net|Native|Event|NetMulticast|Public) // @ game+0x1090b80
};

// Class FSD.BoscoAnimInstance
// Size: 0x2a0 (Inherited: 0x270)
struct UBoscoAnimInstance : UAnimInstance {
	struct FMulticastInlineDelegate OnWeaponsReady; // 0x268(0x10)
	struct FMulticastInlineDelegate OnWeaponsNotReady; // 0x278(0x10)
	float DigAnimPlayRate; // 0x288(0x04)
	enum class EDroneAIState CurrentState; // 0x28c(0x01)
	bool IsReadyToMine; // 0x28d(0x01)
	bool IsMining; // 0x28e(0x01)
	bool IsFiring; // 0x28f(0x01)
	bool IsReviving; // 0x290(0x01)
	bool IsCarryingGem; // 0x291(0x01)
	char pad_29A[0x6]; // 0x29a(0x06)
};

// Class FSD.BoscoWeaponsFoldedOutNotify
// Size: 0x38 (Inherited: 0x38)
struct UBoscoWeaponsFoldedOutNotify : UAnimNotify {
};

// Class FSD.BoscoWeaponsFoldedInNotify
// Size: 0x38 (Inherited: 0x38)
struct UBoscoWeaponsFoldedInNotify : UAnimNotify {
};

// Class FSD.BoscoAbillityComponent
// Size: 0x150 (Inherited: 0xb0)
struct UBoscoAbillityComponent : UActorComponent {
	struct FMulticastInlineDelegate OnAbillityChargeProgress; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnAbillityChargeUsed; // 0xc0(0x10)
	struct TArray<struct UItemUpgrade*> upgrades; // 0xd0(0x10)
	char pad_E0[0x10]; // 0xe0(0x10)
	struct AProjectileBase* projectileClass; // 0xf0(0x08)
	struct UAnimSequenceBase* Animation; // 0xf8(0x08)
	struct USoundBase* VoiceOnUse; // 0x100(0x08)
	struct TWeakObjectPtr<struct AActor> Target; // 0x108(0x08)
	struct TWeakObjectPtr<struct ABosco> AbillityOwner; // 0x110(0x08)
	char pad_118[0x38]; // 0x118(0x38)

	int32_t GetMaxCharges(); // Function FSD.BoscoAbillityComponent.GetMaxCharges // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10965b0
	int32_t GetCharges(); // Function FSD.BoscoAbillityComponent.GetCharges // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1096550
};

// Class FSD.FSDAIController
// Size: 0x358 (Inherited: 0x328)
struct AFSDAIController : AAIController {
	struct FMulticastInlineDelegate OnMessageBehaviorTreeEvent; // 0x328(0x10)
	struct FMulticastInlineDelegate OnAlertedEvent; // 0x338(0x10)
	enum class ECollisionChannel LOSTraceChannel; // 0x348(0x01)
	char pad_349[0x3]; // 0x349(0x03)
	struct TWeakObjectPtr<struct APlayerCharacter> TargetedPlayer; // 0x34c(0x08)
	char pad_354[0x4]; // 0x354(0x04)

	void SetAlerted(bool isAlerted); // Function FSD.FSDAIController.SetAlerted // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x10fc990
	void ResumeLogic(); // Function FSD.FSDAIController.ResumeLogic // (Final|Native|Public|BlueprintCallable) // @ game+0x10fc790
	void RegisterBlackboardChanges(struct FName Key); // Function FSD.FSDAIController.RegisterBlackboardChanges // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x10fc620
	void Recieve_BlackboardValueChanged(struct FName KeyName); // Function FSD.FSDAIController.Recieve_BlackboardValueChanged // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x158ca90
	void PauseLogic(); // Function FSD.FSDAIController.PauseLogic // (Final|Native|Public|BlueprintCallable) // @ game+0x10fc5e0
	void OnAttackingChanged(bool attacking); // Function FSD.FSDAIController.OnAttackingChanged // (Final|Native|Protected) // @ game+0x10fc180
	bool GetIsAlerted(); // Function FSD.FSDAIController.GetIsAlerted // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10fc0b0
};

// Class FSD.BoscoController
// Size: 0x5f0 (Inherited: 0x358)
struct ABoscoController : AFSDAIController {
	struct UBehaviorTree* BehaviourTree; // 0x358(0x08)
	float CheckOutOfTheWayInterval; // 0x360(0x04)
	char pad_364[0x8]; // 0x364(0x08)
	float DistCountAsSameHit; // 0x36c(0x04)
	struct FMulticastInlineDelegate OnFollowTargetChangedDelegate; // 0x370(0x10)
	char pad_380[0xa8]; // 0x380(0xa8)
	struct UTerrainMaterial* HearthstoneCrystalMaterial; // 0x428(0x08)
	float SearchForEnemiesInterval; // 0x430(0x04)
	char pad_434[0x4]; // 0x434(0x04)
	float SaluteDelay; // 0x438(0x04)
	char pad_43C[0x4]; // 0x43c(0x04)
	float SaluteCooldown; // 0x440(0x04)
	char pad_444[0x4]; // 0x444(0x04)
	float CheckGraberInterval; // 0x448(0x04)
	char pad_44C[0x4]; // 0x44c(0x04)
	float MaxThrowStrength; // 0x450(0x04)
	float MaxThrowRange; // 0x454(0x04)
	float RepairRange; // 0x458(0x04)
	float DistanceCountedAsClose; // 0x45c(0x04)
	struct FGameplayTagQuery TargetQuery; // 0x460(0x48)
	struct FGameplayTagQuery AttackOnOrderQuery; // 0x4a8(0x48)
	struct FGameplayTagQuery AttackOnSightQuery; // 0x4f0(0x48)
	struct FGameplayTagQuery DefendTageQuery; // 0x538(0x48)
	float ReviveHealthPercentage; // 0x580(0x04)
	char pad_584[0x4]; // 0x584(0x04)
	struct UDroneUseComponent* CurrentUse; // 0x588(0x08)
	struct ACarriableItem* TryingToPickGem; // 0x590(0x08)
	char pad_598[0x58]; // 0x598(0x58)

	void ReviveTarget(); // Function FSD.BoscoController.ReviveTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x1096c70
	void ResetToFollowState(); // Function FSD.BoscoController.ResetToFollowState // (Final|Native|Public|BlueprintCallable) // @ game+0x1096c50
	void RegisterPlayer(struct APlayerCharacter* APlayerCharacter); // Function FSD.BoscoController.RegisterPlayer // (Final|Native|Private) // @ game+0x1096bd0
	void PickupGem(); // Function FSD.BoscoController.PickupGem // (Final|Native|Public|BlueprintCallable) // @ game+0x1096b10
	void OnUseDone(int32_t TimesUsed); // Function FSD.BoscoController.OnUseDone // (Final|Native|Private) // @ game+0x1096a90
	void OnSecondaryLaserPointer(struct AActor* aTarget, struct FVector aLocation); // Function FSD.BoscoController.OnSecondaryLaserPointer // (Native|Public|HasOutParms|HasDefaults) // @ game+0x10969c0
	void OnPlayerShout(struct APlayerCharacter* APlayerCharacter); // Function FSD.BoscoController.OnPlayerShout // (Native|Public) // @ game+0x1096930
	void OnPlayerSalute(struct APlayerCharacter* aCharacater); // Function FSD.BoscoController.OnPlayerSalute // (Final|Native|Public) // @ game+0x10968b0
	void OnPlayerLeave(struct AFSDPlayerState* APlayerState); // Function FSD.BoscoController.OnPlayerLeave // (Native|Public) // @ game+0x1096820
	void OnLaserPointer(struct FLaserPointerTarget HitInfo); // Function FSD.BoscoController.OnLaserPointer // (Native|Public|HasOutParms) // @ game+0x1096730
	void OnJobFinished(); // Function FSD.BoscoController.OnJobFinished // (Final|Native|Public|BlueprintCallable) // @ game+0x1096710
	void OnEscortTargetDied(struct UHealthComponentBase* Health); // Function FSD.BoscoController.OnEscortTargetDied // (Final|Native|Protected) // @ game+0x1096690
	struct FVector GetPointNearPlayers(); // Function FSD.BoscoController.GetPointNearPlayers // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x10965e0
	struct AActor* GetFollowTarget(); // Function FSD.BoscoController.GetFollowTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x1096580
	void GenerateRelativeLocation(struct AActor* aTarget, float aRange, float aHeightRestriction, float aMinRange, bool aTryToStayOutOfTheWay, bool aStayBehind); // Function FSD.BoscoController.GenerateRelativeLocation // (Final|Native|Public|BlueprintCallable) // @ game+0x1096350
	void GemUsed(struct APlayerCharacter* usedBy, enum class EInputKeys Key); // Function FSD.BoscoController.GemUsed // (Final|Native|Public) // @ game+0x1096290
	void ConfirmPickup(); // Function FSD.BoscoController.ConfirmPickup // (Final|Native|Public) // @ game+0x10960f0
	void CarriableDrop(); // Function FSD.BoscoController.CarriableDrop // (Final|Native|Protected) // @ game+0x1095fa0
};

// Class FSD.SimpleBossFight
// Size: 0x48 (Inherited: 0x28)
struct USimpleBossFight : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct FBossFight BossFight; // 0x30(0x18)
};

// Class FSD.BossFightSubSystem
// Size: 0x60 (Inherited: 0x30)
struct UBossFightSubSystem : UGameInstanceSubsystem {
	struct FMulticastInlineDelegate OnNewBossFight; // 0x30(0x10)
	struct FMulticastInlineDelegate OnBossFightRemoved; // 0x40(0x10)
	struct TArray<struct TScriptInterface<None>> ActiveBossFights; // 0x50(0x10)

	void RegisterBossFight(struct TScriptInterface<None> BossFight); // Function FSD.BossFightSubSystem.RegisterBossFight // (Final|Native|Public|BlueprintCallable) // @ game+0x1096b30
	void DeregisterBossFight(struct AActor* boss); // Function FSD.BossFightSubSystem.DeregisterBossFight // (Final|Native|Public|BlueprintCallable) // @ game+0x1096210
	void BossFightDelegate__DelegateSignature(struct TScriptInterface<None> BossFight); // DelegateFunction FSD.BossFightSubSystem.BossFightDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x158ca90
};

// Class FSD.BossFightInterface
// Size: 0x28 (Inherited: 0x28)
struct UBossFightInterface : UInterface {

	bool IsStillValid(); // Function FSD.BossFightInterface.IsStillValid // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1096660
	struct UBossFightWidget* GetWidgetClass(); // Function FSD.BossFightInterface.GetWidgetClass // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1096620
	struct AActor* GetBossActor(); // Function FSD.BossFightInterface.GetBossActor // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1096520
};

// Class FSD.BossFightWidget
// Size: 0x240 (Inherited: 0x230)
struct UBossFightWidget : UUserWidget {
	struct TScriptInterface<None> BossFight; // 0x230(0x10)
};

// Class FSD.BoxFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBoxFunctionLibrary : UBlueprintFunctionLibrary {

	struct FBox CreateBoxAt(struct FVector Location, struct FVector Size); // Function FSD.BoxFunctionLibrary.CreateBoxAt // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1096110
	struct FVector ClosestPointToBox(struct FVector Pos, struct FBox Box); // Function FSD.BoxFunctionLibrary.ClosestPointToBox // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1095fc0
	float BoxSize(struct FBox Box); // Function FSD.BoxFunctionLibrary.BoxSize // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1095ef0
	struct FVector BoxExtends(struct FBox Box); // Function FSD.BoxFunctionLibrary.BoxExtends // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1095e40
	struct FVector BoxCenter(struct FBox Box); // Function FSD.BoxFunctionLibrary.BoxCenter // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1095d90
};

// Class FSD.GenerationComponent
// Size: 0x3f0 (Inherited: 0x3f0)
struct UGenerationComponent : UPrimitiveComponent {
};

// Class FSD.BoxGenerationComponent
// Size: 0x410 (Inherited: 0x3f0)
struct UBoxGenerationComponent : UGenerationComponent {
	struct FVector Extends; // 0x3f0(0x0c)
	bool IsCarver; // 0x3fc(0x01)
	char pad_3FD[0x3]; // 0x3fd(0x03)
	float NoiseRange; // 0x400(0x04)
	bool Visible; // 0x404(0x01)
	char pad_405[0x3]; // 0x405(0x03)
	struct UFloodFillSettings* Noise; // 0x408(0x08)
};

// Class FSD.GenerationItem
// Size: 0x228 (Inherited: 0x220)
struct AGenerationItem : AActor {
	bool Visible; // 0x220(0x01)
	bool AddToLevel; // 0x221(0x01)
	char pad_222[0x6]; // 0x222(0x06)
};

// Class FSD.BoxGenerationItem
// Size: 0x230 (Inherited: 0x228)
struct ABoxGenerationItem : AGenerationItem {
	struct UBoxGenerationComponent* BoxComponent; // 0x228(0x08)
};

// Class FSD.BTDecorator_AttackInRange
// Size: 0x98 (Inherited: 0x90)
struct UBTDecorator_AttackInRange : UBTDecorator_BlackboardBase {
	struct FName AttackName; // 0x90(0x08)
};

// Class FSD.BTDecorator_CanSeeTarget
// Size: 0xa8 (Inherited: 0x68)
struct UBTDecorator_CanSeeTarget : UBTDecorator {
	bool UseAsync; // 0x68(0x01)
	char pad_69[0x3]; // 0x69(0x03)
	float MaxRange; // 0x6c(0x04)
	struct FVector EyeLocationOffset; // 0x70(0x0c)
	char pad_7C[0x4]; // 0x7c(0x04)
	struct FBlackboardKeySelector TargetKey; // 0x80(0x28)
};

// Class FSD.BTDecorator_CheckObstruction
// Size: 0xb0 (Inherited: 0x68)
struct UBTDecorator_CheckObstruction : UBTDecorator {
	float range; // 0x68(0x04)
	bool UseOwnerCenterMass; // 0x6c(0x01)
	char pad_6D[0x3]; // 0x6d(0x03)
	struct FVector EyeLocationOffset; // 0x70(0x0c)
	struct FName RangedSocket; // 0x7c(0x08)
	char pad_84[0x4]; // 0x84(0x04)
	struct FBlackboardKeySelector TargetKey; // 0x88(0x28)
};

// Class FSD.BTDecorator_CheckPlayerCount
// Size: 0x70 (Inherited: 0x68)
struct UBTDecorator_CheckPlayerCount : UBTDecorator {
	int32_t playerCount; // 0x68(0x04)
	bool AllowLessThanCount; // 0x6c(0x01)
	char pad_6D[0x3]; // 0x6d(0x03)
};

// Class FSD.BTDecorator_ConditionalGuard
// Size: 0x98 (Inherited: 0x68)
struct UBTDecorator_ConditionalGuard : UBTDecorator {
	struct FBlackboardKeySelector GuardKey; // 0x68(0x28)
	bool InvertLogic; // 0x90(0x01)
	char pad_91[0x7]; // 0x91(0x07)
};

// Class FSD.BTDecorator_FormationGuard
// Size: 0x68 (Inherited: 0x68)
struct UBTDecorator_FormationGuard : UBTDecorator {
};

// Class FSD.BTDecorator_InRange
// Size: 0xa0 (Inherited: 0x90)
struct UBTDecorator_InRange : UBTDecorator_BlackboardBase {
	float MinRange; // 0x90(0x04)
	float MaxRange; // 0x94(0x04)
	enum class FAIDistanceType GeometricDistanceType; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class FSD.BTDecorator_InRangeBB
// Size: 0xe8 (Inherited: 0x90)
struct UBTDecorator_InRangeBB : UBTDecorator_BlackboardBase {
	struct FBlackboardKeySelector MinRangeKey; // 0x90(0x28)
	struct FBlackboardKeySelector MaxRangeKey; // 0xb8(0x28)
	enum class FAIDistanceType GeometricDistanceType; // 0xe0(0x01)
	char pad_E1[0x7]; // 0xe1(0x07)
};

// Class FSD.BTDecorator_InRangeEx
// Size: 0xa0 (Inherited: 0x90)
struct UBTDecorator_InRangeEx : UBTDecorator_BlackboardBase {
	float MinRange; // 0x90(0x04)
	float MaxRange; // 0x94(0x04)
	enum class FAIDistanceType GeometricDistanceType; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class FSD.BTDecorator_InRangeOfTarget
// Size: 0x98 (Inherited: 0x90)
struct UBTDecorator_InRangeOfTarget : UBTDecorator_BlackboardBase {
	float MinRange; // 0x90(0x04)
	float MaxRange; // 0x94(0x04)
};

// Class FSD.BTDecorator_IsFacing
// Size: 0x98 (Inherited: 0x90)
struct UBTDecorator_IsFacing : UBTDecorator_BlackboardBase {
	float MaxAngle; // 0x90(0x04)
	char pad_94[0x4]; // 0x94(0x04)
};

// Class FSD.BTDecorator_LockRotation
// Size: 0x70 (Inherited: 0x68)
struct UBTDecorator_LockRotation : UBTDecorator {
	char pad_68[0x8]; // 0x68(0x08)
};

// Class FSD.BTDecorator_MessageAI
// Size: 0x78 (Inherited: 0x68)
struct UBTDecorator_MessageAI : UBTDecorator {
	struct FName ActivationMessage; // 0x68(0x08)
	struct FName DeactivationMessage; // 0x70(0x08)
};

// Class FSD.BTDecorator_ModifySpeed
// Size: 0x70 (Inherited: 0x68)
struct UBTDecorator_ModifySpeed : UBTDecorator {
	float SpeedModifier; // 0x68(0x04)
	char pad_6C[0x4]; // 0x6c(0x04)
};

// Class FSD.BTDecorator_RandomChance
// Size: 0x70 (Inherited: 0x68)
struct UBTDecorator_RandomChance : UBTDecorator {
	float Chance; // 0x68(0x04)
	char pad_6C[0x4]; // 0x6c(0x04)
};

// Class FSD.BTDecorator_RandomCooldown
// Size: 0x98 (Inherited: 0x68)
struct UBTDecorator_RandomCooldown : UBTDecorator {
	struct FRandRange CoolDownTime; // 0x68(0x08)
	struct FBlackboardKeySelector CooldownTimeModifier; // 0x70(0x28)
};

// Class FSD.BTDecorator_SetTagRandomCooldown
// Size: 0x80 (Inherited: 0x68)
struct UBTDecorator_SetTagRandomCooldown : UBTDecorator {
	struct FGameplayTag CooldownTag; // 0x68(0x08)
	struct FRandRange CooldownDuration; // 0x70(0x08)
	bool bAddToExistingDuration; // 0x78(0x01)
	bool TriggerOnActivation; // 0x79(0x01)
	char pad_7A[0x6]; // 0x7a(0x06)
};

// Class FSD.BTDecorator_TagRandomCooldown
// Size: 0x80 (Inherited: 0x68)
struct UBTDecorator_TagRandomCooldown : UBTDecorator {
	struct FGameplayTag CooldownTag; // 0x68(0x08)
	struct FRandRange CooldownDuration; // 0x70(0x08)
	bool bAddToExistingDuration; // 0x78(0x01)
	bool bActivatesCooldown; // 0x79(0x01)
	char pad_7A[0x6]; // 0x7a(0x06)
};

// Class FSD.BTDecorator_RandomLoop
// Size: 0x70 (Inherited: 0x68)
struct UBTDecorator_RandomLoop : UBTDecorator {
	float Chance; // 0x68(0x04)
	char pad_6C[0x4]; // 0x6c(0x04)
};

// Class FSD.BTDecorator_VariableLoop
// Size: 0x70 (Inherited: 0x68)
struct UBTDecorator_VariableLoop : UBTDecorator {
	struct FIRandRange NumLoops; // 0x68(0x08)
};

// Class FSD.BTDecorator_SharedCooldown
// Size: 0x98 (Inherited: 0x68)
struct UBTDecorator_SharedCooldown : UBTDecorator {
	struct FRandRange CoolDownTime; // 0x68(0x08)
	struct FBlackboardKeySelector CooldownKey; // 0x70(0x28)
};

// Class FSD.BTDecorator_SharedAttackCooldown
// Size: 0x98 (Inherited: 0x68)
struct UBTDecorator_SharedAttackCooldown : UBTDecorator {
	struct FRandRange CoolDownTime; // 0x68(0x08)
	struct FBlackboardKeySelector CooldownKey; // 0x70(0x28)
};

// Class FSD.BTServer_ChaseTarget
// Size: 0x100 (Inherited: 0x70)
struct UBTServer_ChaseTarget : UBTService {
	struct FBlackboardKeySelector TargetKey; // 0x70(0x28)
	bool MustBeAlive; // 0x98(0x01)
	char pad_99[0x3]; // 0x99(0x03)
	struct FGameplayTag SwitchTargetCooldownTag; // 0x9c(0x08)
	char pad_A4[0x4]; // 0xa4(0x04)
	struct FGameplayTagQuery TargetingQuery; // 0xa8(0x48)
	bool IsFlying; // 0xf0(0x01)
	bool CanShoot; // 0xf1(0x01)
	char pad_F2[0x2]; // 0xf2(0x02)
	float TargetingRange; // 0xf4(0x04)
	float SwitchTargetTime; // 0xf8(0x04)
	float SwitchTargetDeviation; // 0xfc(0x04)
};

// Class FSD.BTService_FindPlayer
// Size: 0xa8 (Inherited: 0x70)
struct UBTService_FindPlayer : UBTService {
	struct FBlackboardKeySelector TargetKey; // 0x70(0x28)
	bool MustBeAlive; // 0x98(0x01)
	bool SwithToBetterTargets; // 0x99(0x01)
	bool RegisterForPositioning; // 0x9a(0x01)
	bool IsFlying; // 0x9b(0x01)
	bool CanShoot; // 0x9c(0x01)
	char pad_9D[0x3]; // 0x9d(0x03)
	float TargetingRange; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
};

// Class FSD.BTService_FindAttackable
// Size: 0xf0 (Inherited: 0x70)
struct UBTService_FindAttackable : UBTService {
	struct FBlackboardKeySelector TargetKey; // 0x70(0x28)
	bool MustBeAlive; // 0x98(0x01)
	bool SwithToBetterTargets; // 0x99(0x01)
	bool RegisterForPositioning; // 0x9a(0x01)
	bool IsFlying; // 0x9b(0x01)
	bool CanShoot; // 0x9c(0x01)
	char pad_9D[0x3]; // 0x9d(0x03)
	float TargetingRange; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
	struct FGameplayTagQuery TargetQuery; // 0xa8(0x48)
};

// Class FSD.BTService_SetStance
// Size: 0xa0 (Inherited: 0x70)
struct UBTService_SetStance : UBTService {
	struct FBlackboardKeySelector TargetLocationKey; // 0x70(0x28)
	float Distance; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
};

// Class FSD.BTService_CheckPathToTarget
// Size: 0xc0 (Inherited: 0x70)
struct UBTService_CheckPathToTarget : UBTService {
	struct FBlackboardKeySelector TargetKey; // 0x70(0x28)
	struct FBlackboardKeySelector ResultKey; // 0x98(0x28)
};

// Class FSD.BTService_UpdateMoveToTarget
// Size: 0xc8 (Inherited: 0x70)
struct UBTService_UpdateMoveToTarget : UBTService {
	struct FBlackboardKeySelector TargetKey; // 0x70(0x28)
	struct FBlackboardKeySelector TargetLocationKey; // 0x98(0x28)
	float LookAheadTime; // 0xc0(0x04)
	float VerticalOffset; // 0xc4(0x04)
};

// Class FSD.BTService_UpdateFlyingMoveToTarget
// Size: 0xc8 (Inherited: 0x70)
struct UBTService_UpdateFlyingMoveToTarget : UBTService {
	struct FBlackboardKeySelector TargetKey; // 0x70(0x28)
	struct FBlackboardKeySelector TargetLocationKey; // 0x98(0x28)
	float LookAheadTime; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
};

// Class FSD.BTService_UpdateMoveInFormation
// Size: 0xa8 (Inherited: 0x70)
struct UBTService_UpdateMoveInFormation : UBTService {
	float LookAheadTime; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
	struct FBlackboardKeySelector TargetLocationKey; // 0x78(0x28)
	float AttackerRadius; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
};

// Class FSD.BTTask_Attack
// Size: 0xa0 (Inherited: 0x70)
struct UBTTask_Attack : UBTTaskNode {
	struct FBlackboardKeySelector TargetKey; // 0x70(0x28)
	struct FName AttackName; // 0x98(0x08)

	void OnAttackCompleted(struct UBehaviorTreeComponent* btComponent); // Function FSD.BTTask_Attack.OnAttackCompleted // (Final|Native|Protected) // @ game+0x109b740
};

// Class FSD.BTTask_FakePhysicsMove
// Size: 0xc8 (Inherited: 0x98)
struct UBTTask_FakePhysicsMove : UBTTask_BlackboardBase {
	float MinTime; // 0x98(0x04)
	float EndMaxSpeed; // 0x9c(0x04)
	struct FVector InitialLocalVelocity; // 0xa0(0x0c)
	struct FVector InitialGlobalVelocity; // 0xac(0x0c)
	bool EndRequireSolidGround; // 0xb8(0x01)
	char pad_B9[0x7]; // 0xb9(0x07)
	struct UFakeMoverSettings* MoveSettings; // 0xc0(0x08)
};

// Class FSD.BTTask_FindPointNearCeiling
// Size: 0xa8 (Inherited: 0x98)
struct UBTTask_FindPointNearCeiling : UBTTask_BlackboardBase {
	float CloseToCeilingBias; // 0x98(0x04)
	float LookForCeilingLength; // 0x9c(0x04)
	float SearchRadius; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
};

// Class FSD.BTTask_MoveToTarget
// Size: 0xa0 (Inherited: 0x98)
struct UBTTask_MoveToTarget : UBTTask_BlackboardBase {
	float AcceptableRadius; // 0x98(0x04)
	bool EnterAttackStanceOnMoveFinished; // 0x9c(0x01)
	char pad_9D[0x3]; // 0x9d(0x03)
};

// Class FSD.BTTask_MoveToSlot
// Size: 0xa8 (Inherited: 0x98)
struct UBTTask_MoveToSlot : UBTTask_BlackboardBase {
	float AcceptableRadius; // 0x98(0x04)
	float LookAheadTime; // 0x9c(0x04)
	float VerticalOffset; // 0xa0(0x04)
	float UpdateRate; // 0xa4(0x04)
};

// Class FSD.BTTask_SetAttacking
// Size: 0x98 (Inherited: 0x70)
struct UBTTask_SetAttacking : UBTTaskNode {
	struct FBlackboardKeySelector TargetKey; // 0x70(0x28)
};

// Class FSD.BTTask_TriggerAI
// Size: 0x78 (Inherited: 0x70)
struct UBTTask_TriggerAI : UBTTaskNode {
	struct FName TriggerName; // 0x70(0x08)
};

// Class FSD.BTTask_MessageAI
// Size: 0x78 (Inherited: 0x70)
struct UBTTask_MessageAI : UBTTaskNode {
	struct FName MessageName; // 0x70(0x08)
};

// Class FSD.BTTask_SetCondition
// Size: 0xa0 (Inherited: 0x70)
struct UBTTask_SetCondition : UBTTaskNode {
	struct FBlackboardKeySelector ConditionalKey; // 0x70(0x28)
	bool Value; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class FSD.BuildRestriction
// Size: 0x38 (Inherited: 0x30)
struct UBuildRestriction : UDataAsset {
	int32_t BuildType; // 0x30(0x04)
	int32_t Platform; // 0x34(0x04)
};

// Class FSD.BurrowComponent
// Size: 0xc0 (Inherited: 0xb0)
struct UBurrowComponent : UActorComponent {
	char pad_B0[0x10]; // 0xb0(0x10)

	void Unburrow(struct UAnimMontage* customMontage); // Function FSD.BurrowComponent.Unburrow // (BlueprintAuthorityOnly|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x158ca90
	void CallBurrow(bool isBurrowing, struct UAnimMontage* customMontage); // Function FSD.BurrowComponent.CallBurrow // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x109a930
	void Burrow(struct UAnimMontage* customMontage); // Function FSD.BurrowComponent.Burrow // (BlueprintAuthorityOnly|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x158ca90
};

// Class FSD.CalldownItem
// Size: 0x3f0 (Inherited: 0x390)
struct ACalldownItem : AAnimatedItem {
	struct UItemPlacerAggregator* ItemPlacerClass; // 0x390(0x08)
	struct ARessuplyPod* SupplyPodClass; // 0x398(0x08)
	struct UResourceData* ResouceRequired; // 0x3a0(0x08)
	struct FText OrderDescription; // 0x3a8(0x18)
	struct FText LogText; // 0x3c0(0x18)
	struct AActor* ResupplyBeacon; // 0x3d8(0x08)
	struct UItemPlacerAggregator* ItemPlacerInstance; // 0x3e0(0x08)
	float CoolDown; // 0x3e8(0x04)
	float CooldownRemaining; // 0x3ec(0x04)

	void Server_Call_Resupply(struct FVector Location); // Function FSD.CalldownItem.Server_Call_Resupply // (Net|NetReliableNative|Event|Protected|NetServer|HasDefaults|NetValidate) // @ game+0x109b7e0
};

// Class FSD.CampaignManager
// Size: 0x1b8 (Inherited: 0x28)
struct UCampaignManager : UObject {
	struct FMulticastInlineDelegate OnCampaignCompleted; // 0x28(0x10)
	struct FMulticastInlineDelegate OnCampaignChanged; // 0x38(0x10)
	struct UCampaign* MainCampaign; // 0x48(0x08)
	struct TArray<struct UCampaign*> WeeklyCampaigns; // 0x50(0x10)
	struct TArray<struct UCampaign*> MatrixCoreHuntCampaigns; // 0x60(0x10)
	struct TArray<struct UCampaign*> SideCampaigns; // 0x70(0x10)
	struct TArray<struct UCampaign*> EventCampaigns; // 0x80(0x10)
	struct UCampaign* ActiveCampaign; // 0x90(0x08)
	int32_t NumFailedRequests; // 0x98(0x04)
	bool WeeklyBackendDataValid; // 0x9c(0x01)
	char pad_9D[0x3]; // 0x9d(0x03)
	int32_t WeeklyBackendSeed; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
	struct FDateTime WeeklyBackendExpirationTime; // 0xa8(0x08)
	struct FDateTime LastRequestTime; // 0xb0(0x08)
	char pad_B8[0x100]; // 0xb8(0x100)

	void StartNewCampaign(struct UCampaign* campaignClass, struct UFSDSaveGame* SaveGame); // Function FSD.CampaignManager.StartNewCampaign // (Final|Native|Public|BlueprintCallable) // @ game+0x109b8e0
	void SkipMainCampaign(struct UObject* WorldContextObject); // Function FSD.CampaignManager.SkipMainCampaign // (Final|Native|Public|BlueprintCallable) // @ game+0x109b860
	void OnEventsRefreshed(); // Function FSD.CampaignManager.OnEventsRefreshed // (Final|Native|Protected) // @ game+0x109b7c0
	bool IsWeeklyCampaignCompleted(struct UObject* WorldContext, enum class ECampaignType campaigntype); // Function FSD.CampaignManager.IsWeeklyCampaignCompleted // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109b680
	bool IsInCampaignMission(struct AFSDPlayerController* Player); // Function FSD.CampaignManager.IsInCampaignMission // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109b520
	bool IsCampaignRestrictionsMet(struct UObject* WorldContextObject, struct UGeneratedMission* mission, struct UDifficultySetting* optionalDifficulty); // Function FSD.CampaignManager.IsCampaignRestrictionsMet // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109b3f0
	bool IsCampaignMission(struct UObject* WorldContextObject, struct UGeneratedMission* mission); // Function FSD.CampaignManager.IsCampaignMission // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109b330
	bool IsActiveCampaign(struct UCampaign* Campaign); // Function FSD.CampaignManager.IsActiveCampaign // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109b1e0
	struct TArray<struct UCampaign*> GetUncompletedCampaigns(struct AFSDPlayerController* Player); // Function FSD.CampaignManager.GetUncompletedCampaigns // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109b070
	struct UGeneratedMission* GetCampaingMissionFromSeeds(struct UObject* WorldContextObject, int32_t GlobalSeed, int32_t MissionSeed); // Function FSD.CampaignManager.GetCampaingMissionFromSeeds // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109ad10
	struct UGeneratedMission* GetCampaingMission(struct TArray<struct UGeneratedMission*> missions, int32_t MissionSeed); // Function FSD.CampaignManager.GetCampaingMission // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x109ac20
	void CampaignCompletedDelegate__DelegateSignature(); // DelegateFunction FSD.CampaignManager.CampaignCompletedDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x158ca90
	void AbortActiveCampaign(struct UFSDSaveGame* SaveGame); // Function FSD.CampaignManager.AbortActiveCampaign // (Final|Native|Public|BlueprintCallable) // @ game+0x109a7f0
};

// Class FSD.Campaign
// Size: 0x168 (Inherited: 0x28)
struct UCampaign : UObject {
	struct TArray<struct UCampaignMission*> missions; // 0x28(0x10)
	struct TArray<struct UCampaignRequirement*> Requirements; // 0x38(0x10)
	struct TArray<struct UCampaignRequirement*> VisibilityRequirements; // 0x48(0x10)
	struct UPlayerCharacterID* RequiredCharacterID; // 0x58(0x08)
	struct TArray<struct UDifficultySetting*> RestrictedToDifficulties; // 0x60(0x10)
	int32_t Progress; // 0x70(0x04)
	struct FGuid SaveGameID; // 0x74(0x10)
	bool CanAbort; // 0x84(0x01)
	bool CanSkip; // 0x85(0x01)
	char pad_86[0x2]; // 0x86(0x02)
	enum class ECampaignMutators Mutators; // 0x88(0x04)
	char pad_8C[0x4]; // 0x8c(0x04)
	struct FText TitlePrefix; // 0x90(0x18)
	struct FText Title; // 0xa8(0x18)
	struct FText DescriptionHeader; // 0xc0(0x18)
	struct FText Description; // 0xd8(0x18)
	struct FText RewardText; // 0xf0(0x18)
	struct FText RewardFlavorText; // 0x108(0x18)
	struct UTexture2D* Icon; // 0x120(0x08)
	struct TSoftObjectPtr<struct UTexture2D> Picture; // 0x128(0x28)
	enum class ECampaignType campaigntype; // 0x150(0x01)
	char pad_151[0x7]; // 0x151(0x07)
	struct UMissionStat* CampaignCompletedMissionStat; // 0x158(0x08)
	struct UGameActivityAssignmentType* CampaignActivity; // 0x160(0x08)

	bool IsComplete(); // Function FSD.Campaign.IsComplete // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109b4f0
	bool IsCampaignComplete(struct UObject* WorldContext, struct UCampaign* Campaign); // Function FSD.Campaign.IsCampaignComplete // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x109b270
	struct UCampaign* GetReference(struct UCampaign* Campaign); // Function FSD.Campaign.GetReference // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x109af60
	struct UCampaignMission* GetPreviousMission(); // Function FSD.Campaign.GetPreviousMission // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109af30
	struct UTexture2D* GetPicture(); // Function FSD.Campaign.GetPicture // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109af00
	struct FText GetCampaignTitle(struct UCampaign* Campaign); // Function FSD.Campaign.GetCampaignTitle // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x109ab40
	struct UCampaignMission* GetActiveMission(); // Function FSD.Campaign.GetActiveMission // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109ab10
	bool CanStartCampaign(struct AFSDPlayerController* Player); // Function FSD.Campaign.CanStartCampaign // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109aa80
	bool CanSeeCampaign(struct APlayerController* PlayerController); // Function FSD.Campaign.CanSeeCampaign // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109a9f0
	bool AreRestrictionsMet(struct AFSDPlayerController* Player, struct UDifficultySetting* optionalDifficulty); // Function FSD.Campaign.AreRestrictionsMet // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109a870
};

// Class FSD.CampaignMission
// Size: 0x68 (Inherited: 0x30)
struct UCampaignMission : UDataAsset {
	struct UPlanetZone* PlanetZone; // 0x30(0x08)
	struct FRequiredMissionItem mission; // 0x38(0x18)
	struct TArray<struct UReward*> Rewards; // 0x50(0x10)
	struct UDialogDataAsset* MissionCompleteShout; // 0x60(0x08)

	struct UMissionTemplate* GetMissionTemplate(); // Function FSD.CampaignMission.GetMissionTemplate // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109aed0
};

// Class FSD.CampaignRequirement
// Size: 0x28 (Inherited: 0x28)
struct UCampaignRequirement : UObject {

	bool IsRequirementMet(struct AFSDPlayerController* Player, struct UCampaign* Campaign); // Function FSD.CampaignRequirement.IsRequirementMet // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109b5b0
};

// Class FSD.ValidWeeklySeedCampaignRequirement
// Size: 0x28 (Inherited: 0x28)
struct UValidWeeklySeedCampaignRequirement : UCampaignRequirement {
};

// Class FSD.CaracterLevelCampaignRequirement
// Size: 0x38 (Inherited: 0x28)
struct UCaracterLevelCampaignRequirement : UCampaignRequirement {
	struct UPlayerCharacterID* characterID; // 0x28(0x08)
	int32_t LevelRequirement; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class FSD.PlayerRankCampaignRequirement
// Size: 0x30 (Inherited: 0x28)
struct UPlayerRankCampaignRequirement : UCampaignRequirement {
	int32_t RankRequirement; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// Class FSD.RetirementCampaignRequirement
// Size: 0x38 (Inherited: 0x28)
struct URetirementCampaignRequirement : UCampaignRequirement {
	struct UPlayerCharacterID* characterID; // 0x28(0x08)
	int32_t LevelRequirement; // 0x30(0x04)
	char pad_34[0x4]; // 0x34(0x04)
};

// Class FSD.WeeklyTimerCampaignRequirement
// Size: 0x28 (Inherited: 0x28)
struct UWeeklyTimerCampaignRequirement : UCampaignRequirement {

	struct FTimespan GetWeeklyTimeLeft(struct AFSDPlayerController* Player); // Function FSD.WeeklyTimerCampaignRequirement.GetWeeklyTimeLeft // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x109b150
	struct FTimespan GetTimeUntillNewCampaign(struct AFSDPlayerController* Player); // Function FSD.WeeklyTimerCampaignRequirement.GetTimeUntillNewCampaign // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x109afe0
	bool GetHasCompleted(struct UCampaign* Campaign, struct AFSDPlayerController* Player); // Function FSD.WeeklyTimerCampaignRequirement.GetHasCompleted // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109ae10
};

// Class FSD.AnyRetiredCampaignRequirement
// Size: 0x28 (Inherited: 0x28)
struct UAnyRetiredCampaignRequirement : UCampaignRequirement {
};

// Class FSD.CamapaignCompletedRequirement
// Size: 0x30 (Inherited: 0x28)
struct UCamapaignCompletedRequirement : UCampaignRequirement {
	struct UCampaign* Campaign; // 0x28(0x08)
};

// Class FSD.CapacityBasedItemAggregator
// Size: 0x140 (Inherited: 0xc8)
struct UCapacityBasedItemAggregator : UItemAggregator {
	struct FMulticastInlineDelegate OnCurrentAmountChanged; // 0xc8(0x10)
	struct FMulticastInlineDelegate OnMaxAmountChanged; // 0xd8(0x10)
	struct FMulticastInlineDelegate OnClipAndTotalChanged; // 0xe8(0x10)
	struct FMulticastInlineDelegate OnReloadTimeChanged; // 0xf8(0x10)
	struct FMulticastInlineDelegate OnReloadComplete; // 0x108(0x10)
	struct FMulticastInlineDelegate OnReloadStarted; // 0x118(0x10)
	struct FMulticastInlineDelegate OnMaxAmmoCapacityChanged; // 0x128(0x10)
	bool showClipCount; // 0x138(0x01)
	char pad_139[0x7]; // 0x139(0x07)

	void ReloadStarted(); // Function FSD.CapacityBasedItemAggregator.ReloadStarted // (Final|Native|Public) // @ game+0x109f9d0
	void ReloadComplete(); // Function FSD.CapacityBasedItemAggregator.ReloadComplete // (Final|Native|Public) // @ game+0x109f9a0
	int32_t GetMaxAmount(); // Function FSD.CapacityBasedItemAggregator.GetMaxAmount // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109f1f0
	int32_t GetCurrentAmount(); // Function FSD.CapacityBasedItemAggregator.GetCurrentAmount // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109f1c0
};

// Class FSD.CapacityHoldingItemAggregator
// Size: 0x160 (Inherited: 0x140)
struct UCapacityHoldingItemAggregator : UCapacityBasedItemAggregator {
	char pad_140[0x10]; // 0x140(0x10)
	int32_t MaxAmmo; // 0x150(0x04)
	int32_t AmmoCount; // 0x154(0x04)
	bool UseRejoin; // 0x158(0x01)
	char pad_159[0x7]; // 0x159(0x07)

	void UseAmmo(int32_t count); // Function FSD.CapacityHoldingItemAggregator.UseAmmo // (Final|Native|Public|BlueprintCallable) // @ game+0x109fdf0
	void SetMaxAmmo(int32_t InMaxAmmo, bool InChangeCurrentAmount); // Function FSD.CapacityHoldingItemAggregator.SetMaxAmmo // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x109fa80
	void Resupply(float percentage); // Function FSD.CapacityHoldingItemAggregator.Resupply // (Final|Native|Public|BlueprintCallable) // @ game+0x109fa00
	void OnRep_MaxAmmo(); // Function FSD.CapacityHoldingItemAggregator.OnRep_MaxAmmo // (Final|Native|Protected) // @ game+0x109f840
	void OnRep_AmmoCount(); // Function FSD.CapacityHoldingItemAggregator.OnRep_AmmoCount // (Final|Native|Protected) // @ game+0x109f6a0
	void AddAmmo(int32_t Amount); // Function FSD.CapacityHoldingItemAggregator.AddAmmo // (Final|Native|Public|BlueprintCallable) // @ game+0x109eeb0
};

// Class FSD.CappedResource
// Size: 0x78 (Inherited: 0x28)
struct UCappedResource : UObject {
	struct FMulticastInlineDelegate OnChanged; // 0x28(0x10)
	struct FMulticastInlineDelegate OnIncreased; // 0x38(0x10)
	struct FMulticastInlineDelegate OnFull; // 0x48(0x10)
	struct UResourceData* Data; // 0x58(0x08)
	float currentAmount; // 0x60(0x04)
	float MaxAmount; // 0x64(0x04)
	float TotalCollected; // 0x68(0x04)
	int32_t FullFlag; // 0x6c(0x04)
	char pad_70[0x8]; // 0x70(0x08)

	float TransferAll(struct UCappedResource* Receiver); // Function FSD.CappedResource.TransferAll // (Final|Native|Public|BlueprintCallable) // @ game+0x109fd10
	float Transfer(float Amount, struct UCappedResource* Receiver); // Function FSD.CappedResource.Transfer // (Final|Native|Public|BlueprintCallable) // @ game+0x109fc40
	void OnRep_FullFlag(int32_t OldValue); // Function FSD.CappedResource.OnRep_FullFlag // (Final|Native|Protected) // @ game+0x109f7a0
	void OnRep_CurrentAmount(float OldAmount); // Function FSD.CappedResource.OnRep_CurrentAmount // (Final|Native|Protected) // @ game+0x109f6e0
	bool IsObjectiveResource(struct UObject* WorldContext, bool IsCompleted); // Function FSD.CappedResource.IsObjectiveResource // (Final|Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x109f520
	bool IsFull(); // Function FSD.CappedResource.IsFull // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109f4e0
	bool isEmpty(); // Function FSD.CappedResource.isEmpty // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109f4b0
	bool IsCraftingResource(); // Function FSD.CappedResource.IsCraftingResource // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0xbaf250
	struct FText GetTitle(); // Function FSD.CappedResource.GetTitle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109f250
	struct FColor GetColor(); // Function FSD.CappedResource.GetColor // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x109f180
	float GetCapacityPct(); // Function FSD.CappedResource.GetCapacityPct // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109f110
	float Deduct(float Amount); // Function FSD.CappedResource.Deduct // (Final|Native|Public|BlueprintCallable) // @ game+0x109f060
	float Add(float Amount); // Function FSD.CappedResource.Add // (Final|Native|Public|BlueprintCallable) // @ game+0x109ee20
};

// Class FSD.Caretaker
// Size: 0x3a0 (Inherited: 0x2f0)
struct ACaretaker : AFSDPawn {
	struct USceneComponent* Root; // 0x2f0(0x08)
	struct USkeletalMeshComponent* Body; // 0x2f8(0x08)
	struct TArray<struct USkeletalMeshComponent*> Eyes; // 0x300(0x10)
	struct TArray<struct UPassthroughSubHealthComponent*> subHealth; // 0x310(0x10)
	struct UHealthDamageTracker* DamageTracker; // 0x320(0x08)
	struct UEnemyHealthComponent* Health; // 0x328(0x08)
	struct UPawnStatsComponent* PawnStats; // 0x330(0x08)
	struct TArray<struct UCaretakerActionComponent*> Actions; // 0x338(0x10)
	struct UCaretakerActionComponent* CurrentAction; // 0x348(0x08)
	struct TArray<struct UAnimSequenceBase*> HitReactions; // 0x350(0x10)
	int32_t CurrentStage; // 0x360(0x04)
	char pad_364[0xc]; // 0x364(0x0c)
	struct TArray<float> RotationRates; // 0x370(0x10)
	float Server_Rotation; // 0x380(0x04)
	bool IsInStageCooldown; // 0x384(0x01)
	bool IsWeakpointAVisible; // 0x385(0x01)
	bool IsWeakpointBVisible; // 0x386(0x01)
	bool IsWeakpointCVisible; // 0x387(0x01)
	bool IsWeakpointDVisible; // 0x388(0x01)
	enum class ECaretakerSpawnType ActiveSpawnType; // 0x389(0x01)
	char pad_38A[0x2]; // 0x38a(0x02)
	int32_t AoEStage; // 0x38c(0x04)
	char pad_390[0xd]; // 0x390(0x0d)
	int8_t OpenEye; // 0x39d(0x01)
	char pad_39E[0x2]; // 0x39e(0x02)

	void WakeUp(); // Function FSD.Caretaker.WakeUp // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x109fe70
	void SetTargetRotationRate(int32_t rateIndex); // Function FSD.Caretaker.SetTargetRotationRate // (Final|BlueprintAuthorityOnly|Native|Protected|BlueprintCallable) // @ game+0x109fb40
	void OpenRandomEye(bool forbidLastEye); // Function FSD.Caretaker.OpenRandomEye // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x109f880
	void OnStartHideFromDamage(); // Function FSD.Caretaker.OnStartHideFromDamage // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void OnRep_OpenEye(); // Function FSD.Caretaker.OnRep_OpenEye // (Final|Native|Protected) // @ game+0x109f860
	void OnRep_CurrentStage(); // Function FSD.Caretaker.OnRep_CurrentStage // (Final|Native|Private) // @ game+0x109f780
	void OnRep_CurrentRotation(); // Function FSD.Caretaker.OnRep_CurrentRotation // (Final|Native|Private) // @ game+0x109f760
	void OnNewStage(int32_t stageIndex); // Function FSD.Caretaker.OnNewStage // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void OnEyeOpened(struct USkeletalMeshComponent* eye); // Function FSD.Caretaker.OnEyeOpened // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void OnEyeClosed(struct USkeletalMeshComponent* eye); // Function FSD.Caretaker.OnEyeClosed // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void OnDamageTaken(float Amount); // Function FSD.Caretaker.OnDamageTaken // (Final|Native|Protected) // @ game+0x109f620
	bool IsAwake(); // Function FSD.Caretaker.IsAwake // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109f480
	bool IsAnyEyeOpen(); // Function FSD.Caretaker.IsAnyEyeOpen // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109f450
	void InitiateNextStage(); // Function FSD.Caretaker.InitiateNextStage // (Final|BlueprintAuthorityOnly|Native|Protected|BlueprintCallable) // @ game+0x109f430
	void InitCaretakerActions(struct TArray<struct UCaretakerActionComponent*> carettakeractions); // Function FSD.Caretaker.InitCaretakerActions // (Final|Native|Public|BlueprintCallable) // @ game+0x109f2f0
	void CloseAllEyes(); // Function FSD.Caretaker.CloseAllEyes // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x109f040
};

// Class FSD.CaretagerBodyAnimInstance
// Size: 0x2d0 (Inherited: 0x2c0)
struct UCaretagerBodyAnimInstance : UEnemyAnimInstance {
	bool CoolingOff; // 0x2b8(0x01)
	bool IsWeakpointAVisible; // 0x2b9(0x01)
	bool IsWeakpointBVisible; // 0x2ba(0x01)
	bool IsWeakpointCVisible; // 0x2bb(0x01)
	bool IsWeakpointDVisible; // 0x2bc(0x01)
	float RotationAngle; // 0x2c0(0x04)
	int32_t AoEStage; // 0x2c4(0x04)
	bool IsSpawningDrones; // 0x2c8(0x01)
	bool IsSpawningBombs; // 0x2c9(0x01)
	bool IsSpawningShredders; // 0x2ca(0x01)
	bool IsSpawningTurrets; // 0x2cb(0x01)
};

// Class FSD.CaretakerEyeAnimInstance
// Size: 0x2c0 (Inherited: 0x2c0)
struct UCaretakerEyeAnimInstance : UEnemyAnimInstance {
	bool IsOpen; // 0x2b8(0x01)
};

// Class FSD.CaretakerActionComponent
// Size: 0xb8 (Inherited: 0xb0)
struct UCaretakerActionComponent : UActorComponent {
	bool StartTickOnUse; // 0xb0(0x01)
	bool IsUsing; // 0xb1(0x01)
	char pad_B2[0x6]; // 0xb2(0x06)

	void UseAction(); // Function FSD.CaretakerActionComponent.UseAction // (BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x109fdd0
	void TriggerAction(); // Function FSD.CaretakerActionComponent.TriggerAction // (BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x109fdb0
	void StopUsing(); // Function FSD.CaretakerActionComponent.StopUsing // (BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x108ba50
	void OnTriggered(); // Function FSD.CaretakerActionComponent.OnTriggered // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void OnStopped(); // Function FSD.CaretakerActionComponent.OnStopped // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void OnStarted(); // Function FSD.CaretakerActionComponent.OnStarted // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void OnRep_IsUsing(); // Function FSD.CaretakerActionComponent.OnRep_IsUsing // (Final|Native|Protected) // @ game+0x109f820
	struct ACaretaker* GetCaretaker(); // Function FSD.CaretakerActionComponent.GetCaretaker // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x109f150
	bool CanUse(); // Function FSD.CaretakerActionComponent.CanUse // (BlueprintAuthorityOnly|Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x109f010
};

// Class FSD.UsableComponentBase
// Size: 0xf0 (Inherited: 0xb0)
struct UUsableComponentBase : UActorComponent {
	struct FMulticastInlineDelegate OnClientBeginUse; // 0xb0(0x10)
	int32_t CallbackKeys; // 0xc0(0x04)
	float UseCooldown; // 0xc4(0x04)
	bool MustBeGroundedToUse; // 0xc8(0x01)
	bool CanUseStrict; // 0xc9(0x01)
	bool StrictOnlyAfterPickup; // 0xca(0x01)
	char pad_CB[0x5]; // 0xcb(0x05)
	struct UUseAnimationSetting* AnimationSettings; // 0xd0(0x08)
	int32_t Priority; // 0xd8(0x04)
	bool UseableByOwnerOnly; // 0xdc(0x01)
	char pad_DD[0x3]; // 0xdd(0x03)
	struct USceneComponent* RestrictToCollider; // 0xe0(0x08)
	enum class EUseRestriction UseRestrictionAllowance; // 0xe8(0x01)
	bool IsRayTraceTriggered; // 0xe9(0x01)
	bool ResetUsingOnCompletion; // 0xea(0x01)
	bool EquipOnEndUse; // 0xeb(0x01)
	char pad_EC[0x4]; // 0xec(0x04)

	void SetRayTraceTriggered(bool rayTraceTriggered); // Function FSD.UsableComponentBase.SetRayTraceTriggered // (Final|Native|Public|BlueprintCallable) // @ game+0x122f9f0
	struct FText GetUseText(struct APlayerCharacter* User); // Function FSD.UsableComponentBase.GetUseText // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x122f5e0
	float GetUseProgressInPercent(struct APlayerCharacter* User); // Function FSD.UsableComponentBase.GetUseProgressInPercent // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x122f540
	struct UTexture2D* GetUsableIcon(); // Function FSD.UsableComponentBase.GetUsableIcon // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x122f510
	bool GetShowUsingUI(); // Function FSD.UsableComponentBase.GetShowUsingUI // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11a1d60
	bool GetIsRayTraceTriggerd(); // Function FSD.UsableComponentBase.GetIsRayTraceTriggerd // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1212150
	bool GetHideProgressBar(struct APlayerCharacter* User); // Function FSD.UsableComponentBase.GetHideProgressBar // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x122f430
	bool GetHideActionText(struct APlayerCharacter* User); // Function FSD.UsableComponentBase.GetHideActionText // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x122f390
	void EndUse(struct APlayerCharacter* User); // Function FSD.UsableComponentBase.EndUse // (Native|Public|BlueprintCallable) // @ game+0x122f300
	void BeginUse(struct APlayerCharacter* User, enum class EInputKeys Key); // Function FSD.UsableComponentBase.BeginUse // (Native|Public|BlueprintCallable) // @ game+0x122f130
};

// Class FSD.UsableComponent
// Size: 0x118 (Inherited: 0xf0)
struct UUsableComponent : UUsableComponentBase {
	struct UDialogDataAsset* ShoutBegin; // 0xf0(0x08)
	struct FText UseText; // 0xf8(0x18)
	bool ResetOnFail; // 0x110(0x01)
	bool SwitchToUsingState; // 0x111(0x01)
	char pad_112[0x6]; // 0x112(0x06)

	void SetUseText(struct FText NewText); // Function FSD.UsableComponent.SetUseText // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x122fbd0
	bool HasDuration(); // Function FSD.UsableComponent.HasDuration // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x122f6c0
};

// Class FSD.InstantUsable
// Size: 0x150 (Inherited: 0x118)
struct UInstantUsable : UUsableComponent {
	struct FMulticastInlineDelegate OnUsedBy; // 0x118(0x10)
	struct FMulticastInlineDelegate OnUsableChanged; // 0x128(0x10)
	bool bShowUsingUI; // 0x138(0x01)
	bool AllowUseWhileCarrying; // 0x139(0x01)
	char pad_13A[0x6]; // 0x13a(0x06)
	struct USoundCue* AudioCompletedUse; // 0x140(0x08)
	bool Usable; // 0x148(0x01)
	bool TurnOffAfterUse; // 0x149(0x01)
	char pad_14A[0x6]; // 0x14a(0x06)

	void SetCanUse(bool CanUse); // Function FSD.InstantUsable.SetCanUse // (Native|Public|BlueprintCallable) // @ game+0x122f8d0
	void OnRep_Usable(); // Function FSD.InstantUsable.OnRep_Usable // (Final|Native|Protected) // @ game+0x122f7d0
};

// Class FSD.CarriableInstantUsable
// Size: 0x150 (Inherited: 0x150)
struct UCarriableInstantUsable : UInstantUsable {
};

// Class FSD.CarriableComponent
// Size: 0x140 (Inherited: 0xb0)
struct UCarriableComponent : UActorComponent {
	char pad_B0[0x8]; // 0xb0(0x08)
	struct FMulticastInlineDelegate OnPickedUp; // 0xb8(0x10)
	struct FMulticastInlineDelegate OnDropped; // 0xc8(0x10)
	struct TSoftObjectPtr<struct UDialogDataAsset> ShoutWhileCarrying; // 0xd8(0x28)
	struct APlayerCharacter* CarriedBy; // 0x100(0x08)
	enum class EUseRestriction UseRestriction; // 0x108(0x01)
	char pad_109[0x3]; // 0x109(0x03)
	struct FVector Offset; // 0x10c(0x0c)
	char pad_118[0x28]; // 0x118(0x28)

	bool PickupItem(struct APlayerCharacter* byCharacter); // Function FSD.CarriableComponent.PickupItem // (Final|Native|Public|BlueprintCallable) // @ game+0x109f910
	void OnRep_CarriedBy(); // Function FSD.CarriableComponent.OnRep_CarriedBy // (Final|Native|Protected) // @ game+0x109f6c0
	void DropItem(); // Function FSD.CarriableComponent.DropItem // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x109f0f0
	void AttachChanged(bool Attached, struct FVector PrevScale); // Function FSD.CarriableComponent.AttachChanged // (Final|Native|Public|HasDefaults) // @ game+0x109ef30
};

// Class FSD.ResourceData
// Size: 0xf0 (Inherited: 0x30)
struct UResourceData : UDataAsset {
	char pad_30[0x8]; // 0x30(0x08)
	struct FText Title; // 0x38(0x18)
	struct FText TitlePlural; // 0x50(0x18)
	struct FText Description; // 0x68(0x18)
	struct FColor Color; // 0x80(0x04)
	char pad_84[0x4]; // 0x84(0x04)
	struct UTexture2D* Icon; // 0x88(0x08)
	int32_t BuyingPrice; // 0x90(0x04)
	int32_t SellingPrice; // 0x94(0x04)
	struct UMissionStat* MinedMissionStat; // 0x98(0x08)
	bool IsCraftingMaterial; // 0xa0(0x01)
	bool ForceShowOnEndScreen; // 0xa1(0x01)
	bool AffectedByMutators; // 0xa2(0x01)
	bool ScaleToMissionLength; // 0xa3(0x01)
	bool ScaleToHazardLevel; // 0xa4(0x01)
	bool ShowSeparatelyInEndScreen; // 0xa5(0x01)
	char pad_A6[0x2]; // 0xa6(0x02)
	SoftClassProperty Spawnable; // 0xa8(0x28)
	bool IsWholeNumberResource; // 0xd0(0x01)
	char pad_D1[0x3]; // 0xd1(0x03)
	int32_t CreditValue; // 0xd4(0x04)
	int32_t XPValue; // 0xd8(0x04)
	struct FGuid SaveGameID; // 0xdc(0x10)
	char pad_EC[0x4]; // 0xec(0x04)

	float GetOwnedAmount(struct UObject* WorldContextObject); // Function FSD.ResourceData.GetOwnedAmount // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11e36b0
};

// Class FSD.CarvedResourceData
// Size: 0x120 (Inherited: 0xf0)
struct UCarvedResourceData : UResourceData {
	struct TSoftObjectPtr<struct UCarvedResourceCreator> CarvedResourceCreator; // 0xf0(0x28)
	float UnitsPerCarver; // 0x118(0x04)
	char pad_11C[0x4]; // 0x11c(0x04)

	struct UCarvedResourceCreator* LoadResourceCreator(); // Function FSD.CarvedResourceData.LoadResourceCreator // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109f5f0
};

// Class FSD.CaveEntranceComponent
// Size: 0x400 (Inherited: 0x3f0)
struct UCaveEntranceComponent : UPrimitiveComponent {
	enum class ECaveEntranceType Direction; // 0x3f0(0x01)
	enum class ECaveEntrancePriority Priority; // 0x3f1(0x01)
	char pad_3F2[0xe]; // 0x3f2(0x0e)
};

// Class FSD.CaveEntrance
// Size: 0x238 (Inherited: 0x228)
struct ACaveEntrance : AGenerationItem {
	struct UCaveEntranceComponent* CaveEntranceComponent; // 0x228(0x08)
	enum class ECaveEntranceType EntranceType; // 0x230(0x01)
	bool HasBeenConverted; // 0x231(0x01)
	char pad_232[0x6]; // 0x232(0x06)
};

// Class FSD.SpawnResourceGenerationItem
// Size: 0x240 (Inherited: 0x228)
struct ASpawnResourceGenerationItem : AGenerationItem {
	struct UResourceData* Resource; // 0x228(0x08)
	float BaseAmount; // 0x230(0x04)
	char pad_234[0x4]; // 0x234(0x04)
	struct USphereComponent* Sphere; // 0x238(0x08)
};

// Class FSD.SpawnActorGenerationItem
// Size: 0x238 (Inherited: 0x228)
struct ASpawnActorGenerationItem : AGenerationItem {
	struct AActor* ActorToSpawn; // 0x228(0x08)
	struct UBoxComponent* Box; // 0x230(0x08)
};

// Class FSD.SpawnTriggerItem
// Size: 0x238 (Inherited: 0x228)
struct ASpawnTriggerItem : AGenerationItem {
	struct AActor* Trigger; // 0x228(0x08)
	struct FName Message; // 0x230(0x08)
};

// Class FSD.SubRoomItem
// Size: 0x238 (Inherited: 0x228)
struct ASubRoomItem : AGenerationItem {
	struct URoomGenerator* RoomGenerator; // 0x228(0x08)
	int32_t Layer; // 0x230(0x04)
	char pad_234[0x4]; // 0x234(0x04)
};

// Class FSD.RandomSubRoomItem
// Size: 0x280 (Inherited: 0x228)
struct ARandomSubRoomItem : AGenerationItem {
	struct URoomGeneratorGroup* RoomGroup; // 0x228(0x08)
	struct FGameplayTagQuery tagQuery; // 0x230(0x48)
	int32_t Layer; // 0x278(0x04)
	char pad_27C[0x4]; // 0x27c(0x04)
};

// Class FSD.DropPodCalldownLocationItem
// Size: 0x230 (Inherited: 0x228)
struct ADropPodCalldownLocationItem : AGenerationItem {
	struct AActor* CalldownClass; // 0x228(0x08)
};

// Class FSD.ProceduralSetup
// Size: 0x4c0 (Inherited: 0x220)
struct AProceduralSetup : AActor {
	bool ShowItemNoisePattern; // 0x220(0x01)
	char pad_221[0x3]; // 0x221(0x03)
	int32_t Seed; // 0x224(0x04)
	bool UseRandomSeed; // 0x228(0x01)
	char pad_229[0x7]; // 0x229(0x07)
	struct FRandomStream RandomStream; // 0x230(0x08)
	struct FRandomStream RandomStreamServer; // 0x238(0x08)
	struct FRandomStream RandomStreamAsync; // 0x240(0x08)
	struct FRandomStream RandomStreamAsyncServer; // 0x248(0x08)
	struct FMulticastInlineDelegate OnEncounterSpawnedEvent; // 0x250(0x10)
	struct TArray<struct FEncounterSpecialItem> SpecialEncountersToSpawn; // 0x260(0x10)
	char pad_270[0x18]; // 0x270(0x18)
	struct USpecialEvent* ForcedSpecialEvent; // 0x288(0x08)
	struct USpecialEvent* ForcedTreasure; // 0x290(0x08)
	char pad_298[0x18]; // 0x298(0x18)
	struct UNoisyPathfinderComponent* NoisyPathfinder; // 0x2b0(0x08)
	struct UProceduralTunnelComponent* ProceduralTunnel; // 0x2b8(0x08)
	struct UProceduralObjectColliders* ObjectColliders; // 0x2c0(0x08)
	struct ADeepCSGWorld* CSGWorld; // 0x2c8(0x08)
	struct UFloodFillSettings* PathfinderNoise; // 0x2d0(0x08)
	struct TArray<struct FVeinResource> VeinResources; // 0x2d8(0x10)
	struct TArray<struct FCarvedResource> CarvedResources; // 0x2e8(0x10)
	struct UMissionDNA* MissionDNA; // 0x2f8(0x08)
	struct TArray<struct FGemResourceAmount> GemResourcesToGenerate; // 0x300(0x10)
	char pad_310[0x8]; // 0x310(0x08)
	struct TArray<struct FCollectableSpawnableItem> CollectablesToGenerate; // 0x318(0x10)
	enum class ESpawnSettings SpawnSettings; // 0x328(0x01)
	bool CanSpawnSpecialEvents; // 0x329(0x01)
	bool ShouldCarveTunnels; // 0x32a(0x01)
	char pad_32B[0x5]; // 0x32b(0x05)
	struct TArray<struct FRoomNode> Rooms; // 0x330(0x10)
	struct TArray<struct FRoomNode> RoomsInitialState; // 0x340(0x10)
	struct TArray<struct FTunnelNode> Tunnels; // 0x350(0x10)
	struct FGeneratedInfluenceSets GeneratedInfluenceSets; // 0x360(0x18)
	char pad_378[0x8]; // 0x378(0x08)
	struct FGeneratedInstantCarvers GeneratedInstantCarvers; // 0x380(0x10)
	struct FGeneratedDebris GeneratedDebris; // 0x390(0x58)
	struct UBiome* Biome; // 0x3e8(0x08)
	float missionLength; // 0x3f0(0x04)
	char pad_3F4[0x4]; // 0x3f4(0x04)
	struct TArray<struct FPathObstacle> PathObstacles; // 0x3f8(0x10)
	struct FInfluenceMap InfluenceMap; // 0x408(0x50)
	struct TArray<struct UResourceData*> SpawnedResources; // 0x458(0x10)
	float CaveDepth; // 0x468(0x04)
	char pad_46C[0x4]; // 0x46c(0x04)
	struct AActor* PostProcessActor; // 0x470(0x08)
	struct USpecialEvent* SpecialEvent; // 0x478(0x08)
	bool IsInitialized; // 0x480(0x01)
	char pad_481[0x3]; // 0x481(0x03)
	int32_t CurrentRoomPass; // 0x484(0x04)
	bool Pass1Completed; // 0x488(0x01)
	bool UsePerLevelCritterSpawning; // 0x489(0x01)
	char pad_48A[0x6]; // 0x48a(0x06)
	struct FString LastCompletedPLSPass; // 0x490(0x10)
	char pad_4A0[0x20]; // 0x4a0(0x20)

	void StartGenerationOnClient(struct AFSDPlayerController* client); // Function FSD.ProceduralSetup.StartGenerationOnClient // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x158ca90
	void SpawnSpecialEvents(); // Function FSD.ProceduralSetup.SpawnSpecialEvents // (Final|Native|Public|BlueprintCallable) // @ game+0x11cf720
	void SpawnObjectiveEncounter(); // Function FSD.ProceduralSetup.SpawnObjectiveEncounter // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x11cf700
	void SpawnObjectiveCriticalItems(); // Function FSD.ProceduralSetup.SpawnObjectiveCriticalItems // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x11cf6e0
	void SpawnItems_Async(struct AProceduralSetup* setup, struct FLatentActionInfo LatentInfo); // Function FSD.ProceduralSetup.SpawnItems_Async // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x11cf600
	void SpawnItems(); // Function FSD.ProceduralSetup.SpawnItems // (Final|Native|Public|BlueprintCallable) // @ game+0x11cf5e0
	void SpawnEncounters(); // Function FSD.ProceduralSetup.SpawnEncounters // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x11cf5c0
	void SpawnDebrisItems_Async(struct AProceduralSetup* setup, struct FLatentActionInfo LatentInfo, enum class EDebrisItemPass pass, int32_t Depth); // Function FSD.ProceduralSetup.SpawnDebrisItems_Async // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x11cf470
	void SpawnDebrisItems(enum class EDebrisItemPass pass); // Function FSD.ProceduralSetup.SpawnDebrisItems // (Final|Native|Public|BlueprintCallable) // @ game+0x11cf3f0
	void SetSeed(int32_t Seed); // Function FSD.ProceduralSetup.SetSeed // (Final|Native|Public|BlueprintCallable) // @ game+0x11cf370
	void SetObjectivesCompleted(); // Function FSD.ProceduralSetup.SetObjectivesCompleted // (Final|Native|Private) // @ game+0x11cf350
	void ResetData(); // Function FSD.ProceduralSetup.ResetData // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void RemoveBLockedEntrances(); // Function FSD.ProceduralSetup.RemoveBLockedEntrances // (Final|Native|Public|BlueprintCallable) // @ game+0x11cedd0
	void OnPLSDataRecieved(); // Function FSD.ProceduralSetup.OnPLSDataRecieved // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void OnObjectivesCompleted(); // Function FSD.ProceduralSetup.OnObjectivesCompleted // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void OnCarverDataRecieved(enum class EDebrisItemPass pass); // Function FSD.ProceduralSetup.OnCarverDataRecieved // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	bool IsGeneratedDataReady(); // Function FSD.ProceduralSetup.IsGeneratedDataReady // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11ce740
	bool IsCarverDataReady(enum class EDebrisItemPass pass); // Function FSD.ProceduralSetup.IsCarverDataReady // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11ce690
	void InitializeObjectives(); // Function FSD.ProceduralSetup.InitializeObjectives // (Final|Native|Public|BlueprintCallable) // @ game+0x11ce5e0
	struct UMissionDNA* GetMissionDNA(); // Function FSD.ProceduralSetup.GetMissionDNA // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11ce590
	struct TMap<struct FString, float> GetGemsResourceAmounts(); // Function FSD.ProceduralSetup.GetGemsResourceAmounts // (Final|Native|Protected|BlueprintCallable) // @ game+0x11ce4c0
	struct ADeepCSGWorld* GetCSGWorld(); // Function FSD.ProceduralSetup.GetCSGWorld // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11ce2c0
	struct TMap<struct FString, float> GetCollectablesResourceAmounts(); // Function FSD.ProceduralSetup.GetCollectablesResourceAmounts // (Final|Native|Protected|BlueprintCallable) // @ game+0x11ce2f0
	void GenerateRoomsFromGraph_Async(struct AProceduralSetup* setup, struct FLatentActionInfo LatentInfo, int32_t CarvePass); // Function FSD.ProceduralSetup.GenerateRoomsFromGraph_Async // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x11ce1a0
	void GenerateRoomsFromGraph(int32_t CarvePass); // Function FSD.ProceduralSetup.GenerateRoomsFromGraph // (Final|Native|Public|BlueprintCallable) // @ game+0x11ce120
	void GenerateResourceVeins_Async(struct AProceduralSetup* setup, struct FLatentActionInfo LatentInfo); // Function FSD.ProceduralSetup.GenerateResourceVeins_Async // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x11ce040
	void GenerateResourceVeins(); // Function FSD.ProceduralSetup.GenerateResourceVeins // (Final|Native|Public|BlueprintCallable) // @ game+0x11ce020
	void GeneratePostCarveRooms_Async(struct AProceduralSetup* setup, struct FLatentActionInfo LatentInfo); // Function FSD.ProceduralSetup.GeneratePostCarveRooms_Async // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x11cdf40
	void GeneratePostCarveRooms(); // Function FSD.ProceduralSetup.GeneratePostCarveRooms // (Final|Native|Public|BlueprintCallable) // @ game+0x11cdf20
	void GenerateLandscapeFromData(int32_t Seed, struct TArray<struct FRoomNode> Rooms, struct TArray<struct FPathObstacle> obstacles); // Function FSD.ProceduralSetup.GenerateLandscapeFromData // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x158ca90
	void GenerateLandscape(); // Function FSD.ProceduralSetup.GenerateLandscape // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x158ca90
	void GenerateDebrisVeins_Async(struct AProceduralSetup* setup, enum class EDebrisCarvedType carverType, struct FLatentActionInfo LatentInfo); // Function FSD.ProceduralSetup.GenerateDebrisVeins_Async // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x11cdde0
	void GenerateDebrisVeins(enum class EDebrisCarvedType carverType); // Function FSD.ProceduralSetup.GenerateDebrisVeins // (Final|Native|Public|BlueprintCallable) // @ game+0x11cdd60
	struct FVector FindLocationInDirection(struct FVector Origin, struct FVector Direction, float horizontalDeviation, float verticalDeviation, struct FRandRange Distance, float additionalDistance); // Function FSD.ProceduralSetup.FindLocationInDirection // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x11cdb50
	void FindEntrancesForAllConnections(); // Function FSD.ProceduralSetup.FindEntrancesForAllConnections // (Final|Native|Public|BlueprintCallable) // @ game+0x11cdb30
	void FillTunnels_Async(struct AProceduralSetup* setup, struct FLatentActionInfo LatentInfo); // Function FSD.ProceduralSetup.FillTunnels_Async // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x11cda50
	void FillTunnels(); // Function FSD.ProceduralSetup.FillTunnels // (Final|Native|Public|BlueprintCallable) // @ game+0x11cda30
	void DoneCarving(); // Function FSD.ProceduralSetup.DoneCarving // (Final|Native|Public|BlueprintCallable) // @ game+0x8dc380
	bool DoAsyncThreadGeneration(); // Function FSD.ProceduralSetup.DoAsyncThreadGeneration // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11cda00
	void CreateTunnelPaths(); // Function FSD.ProceduralSetup.CreateTunnelPaths // (Final|Native|Public|BlueprintCallable) // @ game+0x11cd960
	int32_t CreateItemDepths(); // Function FSD.ProceduralSetup.CreateItemDepths // (Final|Native|Public|BlueprintCallable) // @ game+0x11cd930
	void CreateGeneratedInfluenceSet(); // Function FSD.ProceduralSetup.CreateGeneratedInfluenceSet // (Final|Native|Public|BlueprintCallable) // @ game+0x11cd910
	void CreateAdditionalRooms(); // Function FSD.ProceduralSetup.CreateAdditionalRooms // (Final|Native|Public|BlueprintCallable) // @ game+0x8dc380
	int32_t ConnectRooms(struct FRoomNode From, struct FRoomNode to, bool hasDirt, struct UTunnelParameters* tunnelParameterOverride); // Function FSD.ProceduralSetup.ConnectRooms // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x11cd2a0
	int32_t ConnectRoomIds(int32_t fromID, int32_t toID, bool hasDirt, struct UTunnelParameters* tunnelParameterOverride); // Function FSD.ProceduralSetup.ConnectRoomIds // (Final|Native|Public|BlueprintCallable) // @ game+0x11cd140
	void CommitCarving(bool finalCommit, bool generateMesh); // Function FSD.ProceduralSetup.CommitCarving // (Final|Native|Public|BlueprintCallable) // @ game+0x11cd070
	void CarveWithGeneratedInstantCarvers(); // Function FSD.ProceduralSetup.CarveWithGeneratedInstantCarvers // (Final|Native|Public|BlueprintCallable) // @ game+0x11cc930
	void CarveTunnels(); // Function FSD.ProceduralSetup.CarveTunnels // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x158ca90
	void BeginLiveGeneration(); // Function FSD.ProceduralSetup.BeginLiveGeneration // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void BeginGenerating(); // Function FSD.ProceduralSetup.BeginGenerating // (Final|Native|Public|BlueprintCallable) // @ game+0x11cc910
	void AddRoomToInitialState(struct FRoomNode RoomNode); // Function FSD.ProceduralSetup.AddRoomToInitialState // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x158ca90
	int32_t AddRoom(struct FVector Location, bool CanHaveEnemies, struct URoomGeneratorBase* RoomGenerator, bool canBeRotated, struct FVector outCenter, struct FRoomNode outRoom, float ResourceMultiplier); // Function FSD.ProceduralSetup.AddRoom // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x11cc3e0
	void AddInfluenceToTunnelEntrances(struct UCaveInfluencer* Influencer, float range); // Function FSD.ProceduralSetup.AddInfluenceToTunnelEntrances // (Final|Native|Public|BlueprintCallable) // @ game+0x11cc310
	void AddImportantLocation(struct FVector Location, float Radius); // Function FSD.ProceduralSetup.AddImportantLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x11cc230
	void AddEnemyDebris(); // Function FSD.ProceduralSetup.AddEnemyDebris // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x11cc210
	int32_t AddDebrisCollider(struct FDebrisCapsule Capsule); // Function FSD.ProceduralSetup.AddDebrisCollider // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x11cc150
	void AddCaveInfluence(struct UCaveInfluencer* Influencer, struct FVector Location, float range); // Function FSD.ProceduralSetup.AddCaveInfluence // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x11cc040
	int32_t AddAirParticlesCollider(struct FDebrisCapsule Capsule); // Function FSD.ProceduralSetup.AddAirParticlesCollider // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x11cbf80
};

// Class FSD.CaveBurner
// Size: 0x4f8 (Inherited: 0x4c0)
struct ACaveBurner : AProceduralSetup {
	float RoomRadius; // 0x4c0(0x04)
	char pad_4C4[0x4]; // 0x4c4(0x04)
	struct FGameplayTagContainer RoomTags; // 0x4c8(0x20)
	bool CanOnlyBeUsedOnce; // 0x4e8(0x01)
	char pad_4E9[0x7]; // 0x4e9(0x07)
	struct URoomGenerator* RoomGenerator; // 0x4f0(0x08)
};

// Class FSD.RoomBurner
// Size: 0x2e0 (Inherited: 0x220)
struct ARoomBurner : AActor {
	bool LiveUpdateEditor; // 0x220(0x01)
	enum class ERoomMirror MirrorTest; // 0x221(0x01)
	char pad_222[0x6]; // 0x222(0x06)
	struct URoomGenerator* RoomGenerator; // 0x228(0x08)
	float RoomRadius; // 0x230(0x04)
	enum class ERoomMirroringSupport MirrorSupport; // 0x234(0x01)
	bool ShowRoomCollider; // 0x235(0x01)
	char pad_236[0x2]; // 0x236(0x02)
	struct FGameplayTagContainer RoomTags; // 0x238(0x20)
	int32_t Seed; // 0x258(0x04)
	char pad_25C[0x4]; // 0x25c(0x04)
	struct UBiome* Biome; // 0x260(0x08)
	struct UDifficultySetting* Difficulty; // 0x268(0x08)
	int32_t ForcePlayerCount; // 0x270(0x04)
	bool GenerateDebris; // 0x274(0x01)
	bool GenerateItems; // 0x275(0x01)
	bool GenerateResources; // 0x276(0x01)
	bool SpawnEncounters; // 0x277(0x01)
	struct UEnemyDescriptor* TestEnemy; // 0x278(0x08)
	int32_t TestEnemyCount; // 0x280(0x04)
	char pad_284[0x4]; // 0x284(0x04)
	struct UMissionMutator* TestMutator; // 0x288(0x08)
	struct TArray<struct UMissionWarning*> TestWarnings; // 0x290(0x10)
	struct USpecialEvent* TestSpecialEvent; // 0x2a0(0x08)
	struct USpecialEvent* TestTreasure; // 0x2a8(0x08)
	struct UMissionTemplate* MissionTemplate; // 0x2b0(0x08)
	struct UMissionTemplate* CustomMissionTemplate; // 0x2b8(0x08)
	struct ADeepCSGWorld* CSGWorld; // 0x2c0(0x08)
	struct AProceduralSetup* PLSLiveEditor; // 0x2c8(0x08)
	char pad_2D0[0x8]; // 0x2d0(0x08)
	struct URoomGenerator* LiveEditRoomGenerator; // 0x2d8(0x08)

	void SpawnEncounter(struct AProceduralSetup* setup); // Function FSD.RoomBurner.SpawnEncounter // (Final|Native|Protected) // @ game+0x109fbc0
	struct URoomGenerator* GetRoomGenerator(); // Function FSD.RoomBurner.GetRoomGenerator // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109f220
};

// Class FSD.InfluenceTester
// Size: 0x230 (Inherited: 0x220)
struct AInfluenceTester : AActor {
	struct UCaveInfluencer* Influencer; // 0x220(0x08)
	struct USphereComponent* Sphere; // 0x228(0x08)
};

// Class FSD.EnemyPawn
// Size: 0x340 (Inherited: 0x2f0)
struct AEnemyPawn : AFSDPawn {
	char pad_2F0[0x8]; // 0x2f0(0x08)
	struct UEnemyHealthComponent* Health; // 0x2f8(0x08)
	struct UPawnStatsComponent* Stats; // 0x300(0x08)
	struct UEnemyPawnAfflictionComponent* Affliction; // 0x308(0x08)
	struct UEnemyComponent* enemy; // 0x310(0x08)
	struct FName CenterMassSocketName; // 0x318(0x08)
	struct FQueuedMontage QueuedMontage; // 0x320(0x10)
	struct TArray<struct UMaterialInterface*> CachedMaterials; // 0x330(0x10)

	struct UMeshComponent* Receive_GetMeshComponent(); // Function FSD.EnemyPawn.Receive_GetMeshComponent // (Event|Protected|BlueprintEvent|Const) // @ game+0x158ca90
	void OnRep_QueuedMontage(); // Function FSD.EnemyPawn.OnRep_QueuedMontage // (Final|Native|Protected) // @ game+0x10d9270
	struct USkeletalMeshComponent* GetMesh(); // Function FSD.EnemyPawn.GetMesh // (Event|Protected|BlueprintEvent|Const) // @ game+0x158ca90
};

// Class FSD.CaveLeech
// Size: 0x3f8 (Inherited: 0x340)
struct ACaveLeech : AEnemyPawn {
	char pad_340[0x8]; // 0x340(0x08)
	struct USkeletalMeshComponent* SkeletalMesh; // 0x348(0x08)
	struct UGrabberComponent* GrabberComponent; // 0x350(0x08)
	float BiteDamage; // 0x358(0x04)
	float BitesPerSecond; // 0x35c(0x04)
	float MaxDistanceXY; // 0x360(0x04)
	float GrapDistance; // 0x364(0x04)
	float GrapDelay; // 0x368(0x04)
	float TentacleSpeed; // 0x36c(0x04)
	float TentacleRetractSpeed; // 0x370(0x04)
	float RetractDuration; // 0x374(0x04)
	float TentaclePullSpeed; // 0x378(0x04)
	float TentacleDropPlayerSpeed; // 0x37c(0x04)
	float TentacleDropGroundDistance; // 0x380(0x04)
	float MaxDropPlayerDuration; // 0x384(0x04)
	float HeadInterpSpeed; // 0x388(0x04)
	float TentacleAttachOffset; // 0x38c(0x04)
	float BiteDistance; // 0x390(0x04)
	float RevivedGracePeriod; // 0x394(0x04)
	struct UPawnAffliction* CaveLeechSenseAffliction; // 0x398(0x08)
	char pad_3A0[0x8]; // 0x3a0(0x08)
	float StateTime; // 0x3a8(0x04)
	enum class ECaveLeechState State; // 0x3ac(0x01)
	char pad_3AD[0x3]; // 0x3ad(0x03)
	struct FVector_NetQuantize TentacleLocation; // 0x3b0(0x0c)
	struct FVector_NetQuantize TentacleVelocity; // 0x3bc(0x0c)
	struct TWeakObjectPtr<struct AActor> Target; // 0x3c8(0x08)
	struct UHealthComponent* HealthTarget; // 0x3d0(0x08)
	struct USceneComponent* TentacleHead; // 0x3d8(0x08)
	char pad_3E0[0x18]; // 0x3e0(0x18)

	void OnRep_State(); // Function FSD.CaveLeech.OnRep_State // (Final|Native|Protected) // @ game+0x10a3330
	struct FVector GetTentacleTargetLocation(); // Function FSD.CaveLeech.GetTentacleTargetLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a3120
	struct FVector GetMouthLocation(); // Function FSD.CaveLeech.GetMouthLocation // (Native|Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x10a2e80
	struct AActor* GetCurrentTarget(); // Function FSD.CaveLeech.GetCurrentTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x10a2d70
	void Died(struct UHealthComponentBase* HealthComponent); // Function FSD.CaveLeech.Died // (Final|Native|Protected) // @ game+0x10a28b0
	void Damaged(float Amount); // Function FSD.CaveLeech.Damaged // (Final|Native|Protected) // @ game+0x10a2830
	void BP_OnStateChanged(enum class ECaveLeechState NewState); // Function FSD.CaveLeech.BP_OnStateChanged // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void BP_OnBite(struct UHealthComponent* TargetHealth); // Function FSD.CaveLeech.BP_OnBite // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
};

// Class FSD.CaveLeechAnimInstance
// Size: 0x2b0 (Inherited: 0x270)
struct UCaveLeechAnimInstance : UAnimInstance {
	float HeadOffset; // 0x268(0x04)
	struct ACaveLeech* CaveLeech; // 0x270(0x08)
	struct USceneComponent* CaveLeechHead; // 0x278(0x08)
	struct FRotator BaseRotation; // 0x280(0x0c)
	struct FVector HeadLocation; // 0x28c(0x0c)
	struct FRotator HeadRotation; // 0x298(0x0c)
	bool bIdle; // 0x2a4(0x01)
	bool bTracking; // 0x2a5(0x01)
	bool bPulling; // 0x2a6(0x01)
	bool bRetracting; // 0x2a7(0x01)
	bool bDying; // 0x2a8(0x01)
	bool bDead; // 0x2a9(0x01)
	bool bFrozen; // 0x2aa(0x01)
	bool bBiting; // 0x2ab(0x01)
};

// Class FSD.CaveObject
// Size: 0x228 (Inherited: 0x220)
struct ACaveObject : AActor {
	bool CanCharacterStandOn; // 0x220(0x01)
	char pad_221[0x7]; // 0x221(0x07)

	void TriggerNetworkUpdate(); // Function FSD.CaveObject.TriggerNetworkUpdate // (Final|Native|Protected|BlueprintCallable) // @ game+0x10a3880
	void ResumeNetworkUpdates(); // Function FSD.CaveObject.ResumeNetworkUpdates // (Final|Native|Protected|BlueprintCallable) // @ game+0x10a3500
	void Recieve_OnGameStarted(); // Function FSD.CaveObject.Recieve_OnGameStarted // (BlueprintAuthorityOnly|Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void PauseNetworkUpdates(); // Function FSD.CaveObject.PauseNetworkUpdates // (Final|Native|Protected|BlueprintCallable) // @ game+0x10a3350
};

// Class FSD.CaveScriptComponent
// Size: 0xb0 (Inherited: 0xb0)
struct UCaveScriptComponent : UActorComponent {
};

// Class FSD.CaveVine
// Size: 0x288 (Inherited: 0x220)
struct ACaveVine : AActor {
	enum class ECollisionChannel GroundCollisionChannel; // 0x220(0x01)
	char pad_221[0x3]; // 0x221(0x03)
	float IdleSwingSpeed; // 0x224(0x04)
	float ChaseSpeed; // 0x228(0x04)
	float MaxReach; // 0x22c(0x04)
	float GroundOffset; // 0x230(0x04)
	float NoiseRadius; // 0x234(0x04)
	float NoiseSpeed; // 0x238(0x04)
	char pad_23C[0x4]; // 0x23c(0x04)
	struct USplineMeshComponent* SplineMeshComponent; // 0x240(0x08)
	struct USceneComponent* VineHead; // 0x248(0x08)
	struct FVector VineVelocity; // 0x250(0x0c)
	struct FVector VineLocation; // 0x25c(0x0c)
	struct FVector VineStartLocation; // 0x268(0x0c)
	struct TWeakObjectPtr<struct UHealthComponent> Target; // 0x274(0x08)
	char pad_27C[0xc]; // 0x27c(0x0c)

	void BP_OnTargetChanged(struct UHealthComponent* NewTarget); // Function FSD.CaveVine.BP_OnTargetChanged // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void BP_OnInitialized(); // Function FSD.CaveVine.BP_OnInitialized // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
};

// Class FSD.CaveWorm
// Size: 0x3a0 (Inherited: 0x380)
struct ACaveWorm : ADeepPathfinderCharacter {
	char pad_380[0x10]; // 0x380(0x10)
	struct USimpleHealthComponent* Health; // 0x390(0x08)
	float SearchChunksRadius; // 0x398(0x04)
	float SearchChunksInterval; // 0x39c(0x04)

	struct AResourceChunk* SpawnResource(struct UObject* WorldContext, struct UResourceData* Data, float Size, struct FTransform Transform, struct FVector Impulse, struct FVector DropOffset); // Function FSD.CaveWorm.SpawnResource // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x10a3640
	void Search(); // Function FSD.CaveWorm.Search // (Final|Native|Protected) // @ game+0x10a3520
	void IncrementKillCount(struct UHealthComponentBase* HealthComponent); // Function FSD.CaveWorm.IncrementKillCount // (Final|Native|Protected) // @ game+0x10a31c0
	void DropResource(struct UResourceData* Data, float Size, struct FVector Impulse, struct FVector DropOffset); // Function FSD.CaveWorm.DropResource // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x10a2930
};

// Class FSD.Maggot
// Size: 0x388 (Inherited: 0x380)
struct AMaggot : ADeepPathfinderCharacter {
	struct USimpleHealthComponent* HealthComponent; // 0x380(0x08)
};

// Class FSD.CellIdFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UCellIdFunctionLibrary : UBlueprintFunctionLibrary {
};

// Class FSD.Test
// Size: 0x270 (Inherited: 0x270)
struct UTest : UAnimInstance {
};

// Class FSD.CharacterCameraController
// Size: 0xd0 (Inherited: 0xb0)
struct UCharacterCameraController : UActorComponent {
	float StartFOV; // 0xb0(0x04)
	float targetFov; // 0xb4(0x04)
	float TargetFOVSpeed; // 0xb8(0x04)
	char pad_BC[0x4]; // 0xbc(0x04)
	struct APlayerCharacter* Character; // 0xc0(0x08)
	struct UCameraComponent* Camera; // 0xc8(0x08)

	void ResetFOV(float FadeSpeed); // Function FSD.CharacterCameraController.ResetFOV // (Final|Native|Public|BlueprintCallable) // @ game+0x10a3470
	void FOVChanged(float NewFOV); // Function FSD.CharacterCameraController.FOVChanged // (Final|Native|Public|BlueprintCallable) // @ game+0x10a2ab0
	void FadeToFOVRelative(float targetFov, float FadeSpeed); // Function FSD.CharacterCameraController.FadeToFOVRelative // (Final|Native|Public|BlueprintCallable) // @ game+0x10a2bf0
	void FadeToFOV(float targetFov, float FadeSpeed); // Function FSD.CharacterCameraController.FadeToFOV // (Final|Native|Public|BlueprintCallable) // @ game+0x10a2b30
};

// Class FSD.CharacterIntoxicationComponent
// Size: 0x100 (Inherited: 0xb0)
struct UCharacterIntoxicationComponent : UActorComponent {
	struct FMulticastInlineDelegate OnIntoxicationChanged; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnPassOutDrunk; // 0xc0(0x10)
	struct APlayerCharacter* Character; // 0xd0(0x08)
	enum class EIntoxicationState CurrentState; // 0xd8(0x01)
	char pad_D9[0x3]; // 0xd9(0x03)
	struct FLerpingPercent IntoxicationPercent; // 0xdc(0x08)
	float IntoxicationLerpSpeed; // 0xe4(0x04)
	float TimeDrunk; // 0xe8(0x04)
	struct FCountDownFloat SoberingUpCoolDown; // 0xec(0x0c)
	char SoberingPercent; // 0xf8(0x01)
	char pad_F9[0x7]; // 0xf9(0x07)

	void ReceiveStateChange(enum class EIntoxicationState NewState); // Function FSD.CharacterIntoxicationComponent.ReceiveStateChange // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void ReceivePassOutDrunk(); // Function FSD.CharacterIntoxicationComponent.ReceivePassOutDrunk // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void ReceiveDrunkTick(float DeltaTime, float DrunkTime); // Function FSD.CharacterIntoxicationComponent.ReceiveDrunkTick // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void ReceiveDrunkEnd(); // Function FSD.CharacterIntoxicationComponent.ReceiveDrunkEnd // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void ReceiveDrunkBegin(); // Function FSD.CharacterIntoxicationComponent.ReceiveDrunkBegin // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void PassOutDrunkSignature__DelegateSignature(struct APlayerCharacter* Player); // DelegateFunction FSD.CharacterIntoxicationComponent.PassOutDrunkSignature__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x158ca90
	bool IsPassOutDrunk(); // Function FSD.CharacterIntoxicationComponent.IsPassOutDrunk // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a3300
	bool IsOnSpaceRig(); // Function FSD.CharacterIntoxicationComponent.IsOnSpaceRig // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a32d0
	bool IsLocallyControlled(); // Function FSD.CharacterIntoxicationComponent.IsLocallyControlled // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a3270
	bool IsDrunk(); // Function FSD.CharacterIntoxicationComponent.IsDrunk // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a3240
	void IntoxicationProgressSignature__DelegateSignature(struct APlayerCharacter* Player, float Progress); // DelegateFunction FSD.CharacterIntoxicationComponent.IntoxicationProgressSignature__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x158ca90
	bool HasAuthority(); // Function FSD.CharacterIntoxicationComponent.HasAuthority // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a3160
	float GetSoberingUpCoolDown(); // Function FSD.CharacterIntoxicationComponent.GetSoberingUpCoolDown // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a30a0
	float GetIntoxicationProgressMapped(struct UCurveFloat* Curve); // Function FSD.CharacterIntoxicationComponent.GetIntoxicationProgressMapped // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a2de0
	float GetIntoxicationProgress(); // Function FSD.CharacterIntoxicationComponent.GetIntoxicationProgress // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a2db0
	int32_t GetAlcoholPct(enum class EDrinkableAlcoholStrength Strength); // Function FSD.CharacterIntoxicationComponent.GetAlcoholPct // (Native|Event|Protected|BlueprintEvent|Const) // @ game+0x10a2cc0
	void Consume(struct UDrinkableDataAsset* Drinkable); // Function FSD.CharacterIntoxicationComponent.Consume // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x10a27b0
	void ClearIntoxication(); // Function FSD.CharacterIntoxicationComponent.ClearIntoxication // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x10a2790
};

// Class FSD.CharacterRecoilComponent
// Size: 0xe0 (Inherited: 0xb0)
struct UCharacterRecoilComponent : UActorComponent {
	struct FVector Recoil; // 0xb0(0x0c)
	struct FVector RecoilVelocity; // 0xbc(0x0c)
	struct FVector PrevError; // 0xc8(0x0c)
	char pad_D4[0xc]; // 0xd4(0x0c)
};

// Class FSD.CharacterSettings
// Size: 0x190 (Inherited: 0x30)
struct UCharacterSettings : UDataAsset {
	struct TArray<SoftClassProperty> RankedHeroClasses; // 0x30(0x10)
	struct TArray<struct APlayerCharacter*> LoadedClasses; // 0x40(0x10)
	struct TArray<struct FText> PlayerRankNames; // 0x50(0x10)
	struct TArray<int32_t> CharacterXPLevels; // 0x60(0x10)
	struct TMap<struct FGuid, struct UPlayerCharacterID*> PlayerCharacterIDMap; // 0x70(0x50)
	struct TArray<struct UPlayerCharacterID*> PlayerCharacterIDs; // 0xc0(0x10)
	struct UPlayerCharacterID* BoscoID; // 0xd0(0x08)
	struct USkeletalMesh* NoHead; // 0xd8(0x08)
	struct USkeletalMesh* DefaultHead; // 0xe0(0x08)
	struct USkeletalMesh* ThickNeck; // 0xe8(0x08)
	struct USkeletalMesh* ThinNeck; // 0xf0(0x08)
	SoftClassProperty CarriableBagClass; // 0xf8(0x28)
	struct UUseAnimationSetting* ThrowItemAnimSettings; // 0x120(0x08)
	struct TMap<struct UPlayerCharacterID*, struct UCharacterVanityItems*> CharacterVanityItems; // 0x128(0x50)
	struct UDialogDataAsset* AutoReloadShout; // 0x178(0x08)
	struct UDebrisPositioning* TeleportPositioning; // 0x180(0x08)
	struct UTerrainPlacementComponent* TeleportPlacement; // 0x188(0x08)

	void PreloadAllInventories(struct UAsyncManager* AsyncManager); // Function FSD.CharacterSettings.PreloadAllInventories // (Final|Native|Public|BlueprintCallable) // @ game+0x10a3370
	struct UPlayerCharacterID* GetPlayerCharacterID(struct FGuid ID); // Function FSD.CharacterSettings.GetPlayerCharacterID // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a2ec0
};

// Class FSD.CharacterSightComponent
// Size: 0x158 (Inherited: 0xb0)
struct UCharacterSightComponent : UActorComponent {
	struct FMulticastInlineDelegate OnTargetChanged; // 0xb0(0x10)
	float TargetMaxDistance; // 0xc0(0x04)
	enum class ECollisionChannel TraceChannel; // 0xc4(0x01)
	char pad_C5[0x3]; // 0xc5(0x03)
	struct TArray<struct TWeakObjectPtr<struct AActor>> IgnoredActors; // 0xc8(0x10)
	struct APlayerCharacter* Character; // 0xd8(0x08)
	struct TWeakObjectPtr<struct AActor> TargetActor; // 0xe0(0x08)
	struct TWeakObjectPtr<struct UPrimitiveComponent> TargetPrimitive; // 0xe8(0x08)
	struct TWeakObjectPtr<struct USimpleObjectInfoComponent> TargetInfo; // 0xf0(0x08)
	struct TWeakObjectPtr<struct UTemperatureComponent> TargetTemperature; // 0xf8(0x08)
	struct TWeakObjectPtr<struct UPawnAfflictionComponent> TargetAfflictions; // 0x100(0x08)
	struct TScriptInterface<None> TargetHealth; // 0x108(0x10)
	struct TScriptInterface<None> TargetTargetable; // 0x118(0x10)
	float TargetTime; // 0x128(0x04)
	struct FReplicatedCharacterData ReplicatedData; // 0x12c(0x18)
	char pad_144[0x14]; // 0x144(0x14)

	void TargetChangedSignature__DelegateSignature(struct AActor* NewTarget, struct UPrimitiveComponent* NewPrimitive); // DelegateFunction FSD.CharacterSightComponent.TargetChangedSignature__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x158ca90
	void Server_UpdateTarget(struct AActor* NewActor, struct UPrimitiveComponent* NewPrimitive); // Function FSD.CharacterSightComponent.Server_UpdateTarget // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x10a3540
	void RemoveIgnoreActor(struct AActor* InActor); // Function FSD.CharacterSightComponent.RemoveIgnoreActor // (Final|Native|Public|BlueprintCallable) // @ game+0x10a33f0
	void ReceiveTargetInSightTick(float DeltaTime); // Function FSD.CharacterSightComponent.ReceiveTargetInSightTick // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void ReceiveTargetChanged(); // Function FSD.CharacterSightComponent.ReceiveTargetChanged // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void GetSightStartAndEnd(float InMaxDistance, struct FVector OutStartLocation, struct FVector OutEndLocation); // Function FSD.CharacterSightComponent.GetSightStartAndEnd // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x10a2f70
	void AddIgnoreActor(struct AActor* InActor); // Function FSD.CharacterSightComponent.AddIgnoreActor // (Final|Native|Public|BlueprintCallable) // @ game+0x10a2710
};

// Class FSD.CharacterStateComponent
// Size: 0x100 (Inherited: 0xb0)
struct UCharacterStateComponent : UActorComponent {
	char pad_B0[0x8]; // 0xb0(0x08)
	char StateId; // 0xb8(0x01)
	char pad_B9[0x7]; // 0xb9(0x07)
	struct APlayerCharacter* Character; // 0xc0(0x08)
	struct UDialogDataAsset* EnterStateShout; // 0xc8(0x08)
	struct UDialogDataAsset* ExitStateShout; // 0xd0(0x08)
	struct UDialogDataAsset* AttentionShout; // 0xd8(0x08)
	struct UPlayerMovementComponent* PlayerMovement; // 0xe0(0x08)
	char pad_E8[0x18]; // 0xe8(0x18)

	void ReceiveStateTick(float DeltaTime); // Function FSD.CharacterStateComponent.ReceiveStateTick // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void ReceiveStateExit(); // Function FSD.CharacterStateComponent.ReceiveStateExit // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void ReceiveStateEnter(); // Function FSD.CharacterStateComponent.ReceiveStateEnter // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	bool IsLocallyControlled(); // Function FSD.CharacterStateComponent.IsLocallyControlled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a32a0
	bool HasAuthority(); // Function FSD.CharacterStateComponent.HasAuthority // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a3190
	float GetStateTime(); // Function FSD.CharacterStateComponent.GetStateTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a3100
	char GetStateID(); // Function FSD.CharacterStateComponent.GetStateID // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a30e0
	bool GetStateActive(); // Function FSD.CharacterStateComponent.GetStateActive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a30c0
	struct UPlayerMovementComponent* GetCharacterMovement(); // Function FSD.CharacterStateComponent.GetCharacterMovement // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a2d50
};

// Class FSD.CharacterUseComponent
// Size: 0x200 (Inherited: 0xb0)
struct UCharacterUseComponent : UActorComponent {
	struct FMulticastInlineDelegate OnDepositingBegin; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnDepositingEnd; // 0xc0(0x10)
	struct FMulticastInlineDelegate OnBeginHoveringEvent; // 0xd0(0x10)
	struct FMulticastInlineDelegate OnEndHoveringEvent; // 0xe0(0x10)
	struct FMulticastInlineDelegate OnBeginUsingEvent; // 0xf0(0x10)
	struct FMulticastInlineDelegate OnEndUsingEvent; // 0x100(0x10)
	struct FMulticastInlineDelegate OnBeginUseNoUsable; // 0x110(0x10)
	struct FMulticastInlineDelegate OnEndUseNoUsable; // 0x120(0x10)
	struct FUsableRepliactional ActiveUsablee; // 0x130(0x10)
	struct UUsableComponentBase* HoveringUsable; // 0x140(0x08)
	struct USceneComponent* HoveringUsableCollider; // 0x148(0x08)
	struct USceneComponent* ActiveUsableCollider; // 0x150(0x08)
	struct USphereComponent* UseCollider; // 0x158(0x08)
	struct USoundBase* AudioBeginDepositing; // 0x160(0x08)
	struct USoundBase* AudioEndDepositing; // 0x168(0x08)
	float UseDistance; // 0x170(0x04)
	char pad_174[0x1]; // 0x174(0x01)
	enum class EUseRestriction UseRestriction; // 0x175(0x01)
	char pad_176[0x2]; // 0x176(0x02)
	struct APlayerCharacter* Character; // 0x178(0x08)
	char pad_180[0x30]; // 0x180(0x30)
	struct TMap<struct UUsableComponentBase*, float> UseCooldownTracker; // 0x1b0(0x50)

	void Server_SetCanUse(enum class EUseRestriction UseRestriction); // Function FSD.CharacterUseComponent.Server_SetCanUse // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x10a7910
	void Server_EndUse(); // Function FSD.CharacterUseComponent.Server_EndUse // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x10a78c0
	void Server_BeginUse(char Key, struct UUsableComponentBase* Usable, struct USceneComponent* UsableCollider); // Function FSD.CharacterUseComponent.Server_BeginUse // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x10a77b0
	void OnRep_ActiveUsablee(struct FUsableRepliactional lastUsable); // Function FSD.CharacterUseComponent.OnRep_ActiveUsablee // (Final|Native|Protected) // @ game+0x10a7610
	void OnCharacterStateChanged(enum class ECharacterState NewState); // Function FSD.CharacterUseComponent.OnCharacterStateChanged // (Final|Native|Protected) // @ game+0x10a7590
	bool IsLookingAtUsable(); // Function FSD.CharacterUseComponent.IsLookingAtUsable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a7560
	bool IsLookingAtDepositable(); // Function FSD.CharacterUseComponent.IsLookingAtDepositable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a7530
	float GetUseProgress(); // Function FSD.CharacterUseComponent.GetUseProgress // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a72b0
	struct AActor* GetLookingAtActor(); // Function FSD.CharacterUseComponent.GetLookingAtActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a70e0
	bool GetIsUsing(); // Function FSD.CharacterUseComponent.GetIsUsing // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x10a6ea0
	bool GetIsDepositing(); // Function FSD.CharacterUseComponent.GetIsDepositing // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x10a6e70
	void All_PlaySingleUse(char Key, struct UUsableComponentBase* Usable); // Function FSD.CharacterUseComponent.All_PlaySingleUse // (Net|Native|Event|NetMulticast|Public) // @ game+0x10a6960
	void AddCustomUsableComponent(struct UUsableComponentBase* Usable, enum class ECustomUsableType eType); // Function FSD.CharacterUseComponent.AddCustomUsableComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x10a68a0
};

// Class FSD.CharacterVanityComponent
// Size: 0x1d8 (Inherited: 0xb0)
struct UCharacterVanityComponent : UActorComponent {
	char pad_B0[0x10]; // 0xb0(0x10)
	struct UCharacterVanityItems* AvailableVanityItems; // 0xc0(0x08)
	struct UBeardColorVanityItem* ShownBeardColor; // 0xc8(0x08)
	struct UMaterialInterface* ArmorMaterial; // 0xd0(0x08)
	struct UMaterialInstanceDynamic* DynamicSkinMaterial; // 0xd8(0x08)
	enum class EHeadVanityType HeadVanityType; // 0xe0(0x01)
	char pad_E1[0x7]; // 0xe1(0x07)
	struct TArray<struct UVanityItem*> EquippedVanity; // 0xe8(0x10)
	struct UMaterialInterface* SkinMaterial; // 0xf8(0x08)
	struct TArray<struct FTattooArmorItem> Tattoos; // 0x100(0x10)
	struct TArray<struct UMaterialInterface*> CachedMaterials; // 0x110(0x10)
	char pad_120[0x58]; // 0x120(0x58)
	struct TMap<enum class EVanitySlot, struct USkeletalMeshComponent*> VanityMeshes; // 0x178(0x50)
	char pad_1C8[0x10]; // 0x1c8(0x10)

	void UpdateMeshes(); // Function FSD.CharacterVanityComponent.UpdateMeshes // (Final|Native|Protected) // @ game+0x10a8060
	void UpdateEquippedVanity(bool applyItems); // Function FSD.CharacterVanityComponent.UpdateEquippedVanity // (Final|Native|Public|BlueprintCallable) // @ game+0x10a7fd0
	void SetEquippedVanityInViewer(struct TArray<struct UVanityItem*> Vanity); // Function FSD.CharacterVanityComponent.SetEquippedVanityInViewer // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x10a7d30
	void Server_SetEquippedVanity(struct TArray<struct UVanityItem*> equippedItems); // Function FSD.CharacterVanityComponent.Server_SetEquippedVanity // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x10a79c0
	struct UVanityItem* Receive_GetEquippedVanityItem(struct UObject* WorldContextObject, struct UPlayerCharacterID* Character, enum class EVanitySlot Slot); // Function FSD.CharacterVanityComponent.Receive_GetEquippedVanityItem // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x10a76c0
	void OnRep_EquippedVanity(); // Function FSD.CharacterVanityComponent.OnRep_EquippedVanity // (Final|Native|Protected) // @ game+0x10a76a0
	struct UVanityItem* GetEquippedVanityItem(enum class EVanitySlot Slot); // Function FSD.CharacterVanityComponent.GetEquippedVanityItem // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a6db0
	struct UCharacterVanityItems* GetAvailableVanityItems(); // Function FSD.CharacterVanityComponent.GetAvailableVanityItems // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a6ca0
	void EnforceValidPaintjob(); // Function FSD.CharacterVanityComponent.EnforceValidPaintjob // (Final|Native|Public|BlueprintCallable) // @ game+0x10a6c80
	void CreateEquippedGear(); // Function FSD.CharacterVanityComponent.CreateEquippedGear // (Final|Native|Public|BlueprintCallable) // @ game+0x10a6c10
};

// Class FSD.CharacterVanityItems
// Size: 0x1a8 (Inherited: 0x30)
struct UCharacterVanityItems : UDataAsset {
	struct TArray<struct UHeadVanityItem*> HeadItems; // 0x30(0x10)
	struct UVanitySchematicBank* HeadSchematicBank; // 0x40(0x08)
	struct TArray<struct UBeardVanityItem*> BeardItems; // 0x48(0x10)
	struct UVanitySchematicBank* BeardSchematicBank; // 0x58(0x08)
	struct TArray<struct UArmorVanityItem*> ArmorItems; // 0x60(0x10)
	struct TArray<struct UArmorMaterialVanityItem*> ArmorMaterialItems; // 0x70(0x10)
	struct TArray<struct UArmorMaterialVanityItem*> ArmorMaterialItemsInTreassures; // 0x80(0x10)
	struct TArray<struct UEyeBrowsVanityItem*> EyebrowsItems; // 0x90(0x10)
	struct UVanitySchematicBank* EyebrowSchematicBank; // 0xa0(0x08)
	struct TArray<struct UMoustacheVanityItem*> MoustacheItems; // 0xa8(0x10)
	struct UVanitySchematicBank* MoustacheSchematicBank; // 0xb8(0x08)
	struct TArray<struct USideburnsVanityItem*> SideburnItems; // 0xc0(0x10)
	struct UVanitySchematicBank* SideburnSchematicBank; // 0xd0(0x08)
	struct TArray<struct UBeardColorVanityItem*> BeardMaterialItems; // 0xd8(0x10)
	struct UVanitySchematicBank* BeardMaterialSchematicBank; // 0xe8(0x08)
	struct TArray<struct USkinColorVanityItem*> SkinMaterialItems; // 0xf0(0x10)
	struct UVanitySchematicBank* SkinMaterialSchematicBank; // 0x100(0x08)
	struct TMap<struct FGuid, struct UVanityItem*> VanityMap; // 0x108(0x50)
	struct TMap<enum class EVanitySlot, struct UVanityItem*> DefaultItems; // 0x158(0x50)

	void SortVanityItems(struct UObject* WorldContextObject, struct UPlayerCharacterID* characterID, struct TArray<struct UVanityItem*> vanityItems); // Function FSD.CharacterVanityItems.SortVanityItems // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x10a7eb0
	struct TArray<struct UVanityItem*> GetVanityItems(struct UObject* WorldContextObject, enum class EVanitySlot Slot, bool onlyStoreItems, struct UPlayerCharacterID* characterID); // Function FSD.CharacterVanityItems.GetVanityItems // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x10a7390
	struct UVanityItem* GetVanityItem(struct FGuid VanityID); // Function FSD.CharacterVanityItems.GetVanityItem // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a72e0
	struct TArray<struct UVanityItem*> GetUnLockedVanityItems(struct UObject* WorldContextObject, enum class EVanitySlot Slot, bool onlyStoreItems, struct UPlayerCharacterID* characterID); // Function FSD.CharacterVanityItems.GetUnLockedVanityItems // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x10a7110
	struct TArray<struct UVanityItem*> GetLockedVanityItems(struct UObject* WorldContextObject, enum class EVanitySlot Slot, struct UPlayerCharacterID* characterID); // Function FSD.CharacterVanityItems.GetLockedVanityItems // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x10a6fa0
	struct TArray<struct UVanityItem*> GetItems(enum class EVanitySlot Slot, bool onlyStoreItems); // Function FSD.CharacterVanityItems.GetItems // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a6ed0
	struct UVanityItem* GetDefaultVanityItem(struct UObject* WorldContext, enum class EVanitySlot Slot, struct UPlayerCharacterID* characterID); // Function FSD.CharacterVanityItems.GetDefaultVanityItem // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x10a6cc0
	void Clean(); // Function FSD.CharacterVanityItems.Clean // (Final|Native|Public|BlueprintCallable) // @ game+0x10a6bf0
};

// Class FSD.CharacterSelectionSwitcher
// Size: 0x220 (Inherited: 0x220)
struct ACharacterSelectionSwitcher : AActor {

	void OnVictoryPoseChanged(struct UVictoryPose* VictoryPose); // Function FSD.CharacterSelectionSwitcher.OnVictoryPoseChanged // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x158ca90
	void OnVanityItemEquipped(enum class EVanitySlot Slot); // Function FSD.CharacterSelectionSwitcher.OnVanityItemEquipped // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x158ca90
	void Hide(); // Function FSD.CharacterSelectionSwitcher.Hide // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	struct AActor* GetViewerActor(); // Function FSD.CharacterSelectionSwitcher.GetViewerActor // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x158ca90
	struct APlayerCharacter* GetActiveCharacter(); // Function FSD.CharacterSelectionSwitcher.GetActiveCharacter // (Event|Public|BlueprintEvent|Const) // @ game+0x158ca90
};

// Class FSD.ChargedWeapon
// Size: 0x778 (Inherited: 0x6e0)
struct AChargedWeapon : AAmmoDrivenWeapon {
	struct FMulticastInlineDelegate OnChargeChanged; // 0x6e0(0x10)
	struct FMulticastInlineDelegate OnHeatChanged; // 0x6f0(0x10)
	char pad_700[0x8]; // 0x700(0x08)
	struct UAnimMontage* FP_OverheatAnim; // 0x708(0x08)
	struct UAnimMontage* FP_ChargeupMontage; // 0x710(0x08)
	struct UFXSystemAsset* ChargeupParticles; // 0x718(0x08)
	struct UFXSystemComponent* ChargeupParticleInstance; // 0x720(0x08)
	struct UFXSystemAsset* ChargeupFireMuzzleFlash; // 0x728(0x08)
	struct USoundCue* NormalFiresound; // 0x730(0x08)
	struct USoundCue* FullyChargedFireSound; // 0x738(0x08)
	float ChargeSpeed; // 0x740(0x04)
	bool Charging; // 0x744(0x01)
	char pad_745[0x3]; // 0x745(0x03)
	float ChargeProgress; // 0x748(0x04)
	int32_t ShotCostAtBelowFullCharge; // 0x74c(0x04)
	int32_t ShotCostAtFullCharge; // 0x750(0x04)
	bool ChargedShotsOnly; // 0x754(0x01)
	bool AutoFireWhenOverheated; // 0x755(0x01)
	char pad_756[0x2]; // 0x756(0x02)
	float TotalHeat; // 0x758(0x04)
	char pad_75C[0x4]; // 0x75c(0x04)
	float CoolingRate; // 0x760(0x04)
	float HeatPerSecondWhileCharging; // 0x764(0x04)
	float HeatPerSecondWhenCharged; // 0x768(0x04)
	float HeatPerNormalShot; // 0x76c(0x04)
	float HeatPerChargedShot; // 0x770(0x04)
	char pad_774[0x4]; // 0x774(0x04)

	void SetOverheated(bool isOverheated); // Function FSD.ChargedWeapon.SetOverheated // (Final|Native|Protected|BlueprintCallable) // @ game+0x10a7de0
	void Server_SetIsCharging(bool isChargingValue); // Function FSD.ChargedWeapon.Server_SetIsCharging // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x10a7a80
	void RecieveChargeProgressChanged(float NewChargeProgress); // Function FSD.ChargedWeapon.RecieveChargeProgressChanged // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void ReceiveOverheatedChanged(bool isOverheated); // Function FSD.ChargedWeapon.ReceiveOverheatedChanged // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	bool GetIsCharging(); // Function FSD.ChargedWeapon.GetIsCharging // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a6e40
};

// Class FSD.ChargedWeaponAnimInstance
// Size: 0x290 (Inherited: 0x270)
struct UChargedWeaponAnimInstance : UAnimInstance {
	bool isCharging; // 0x268(0x01)
	float ChargeupPlayRate; // 0x26c(0x04)
	float ChargeupPlayRateSpeedChange; // 0x270(0x04)
	float ChargedownPlayRateSpeedChange; // 0x274(0x04)
	float MaxChargeupPlayRate; // 0x278(0x04)
	struct AChargedWeapon* Weapon; // 0x280(0x08)
	char pad_289[0x7]; // 0x289(0x07)
};

// Class FSD.ProjectileBase
// Size: 0x2f0 (Inherited: 0x220)
struct AProjectileBase : AActor {
	struct FProjectileImpact ProjectileImpact; // 0x220(0x38)
	bool IsSpawnedFromWeapon; // 0x258(0x01)
	bool Exploded; // 0x259(0x01)
	bool DoOnImpact; // 0x25a(0x01)
	bool DoOnImpact2; // 0x25b(0x01)
	bool DoOnImpact3; // 0x25c(0x01)
	bool DoOnSpawnVar; // 0x25d(0x01)
	char pad_25E[0x12]; // 0x25e(0x12)
	bool IsDorment; // 0x270(0x01)
	char pad_271[0x7]; // 0x271(0x07)
	struct USphereComponent* CollisionComponent; // 0x278(0x08)
	char pad_280[0x4]; // 0x280(0x04)
	float LifeSpan; // 0x284(0x04)
	float VelocityMultiplier; // 0x288(0x04)
	float GravityMultiplier; // 0x28c(0x04)
	bool AffectedByDifficultySpeedModifier; // 0x290(0x01)
	bool SetInitialSpeedToMaxSpeed; // 0x291(0x01)
	bool AutoDisableCollisionOnImpact; // 0x292(0x01)
	char pad_293[0x5]; // 0x293(0x05)
	struct USoundCue* WhizbySound; // 0x298(0x08)
	float WhizByCooldown; // 0x2a0(0x04)
	float WhizByStartDistance; // 0x2a4(0x04)
	char pad_2A8[0x8]; // 0x2a8(0x08)
	enum class EOnProjectileImpactBehaviourEnum EOnImpactBehaviour; // 0x2b0(0x04)
	char pad_2B4[0x3c]; // 0x2b4(0x3c)

	struct UTerrainMaterial* TryGetTerrainMaterial(); // Function FSD.ProjectileBase.TryGetTerrainMaterial // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11d5480
	void StopMovement(); // Function FSD.ProjectileBase.StopMovement // (Final|Native|Public|BlueprintCallable) // @ game+0x11d5460
	void Server_SetState(struct FVector_NetQuantize Position, struct FVector_NetQuantize Velocity); // Function FSD.ProjectileBase.Server_SetState // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x11d4bb0
	void Server_Penetrated(struct FProjectileImpact Impact); // Function FSD.ProjectileBase.Server_Penetrated // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x11d4ae0
	void Server_Impacted(struct FProjectileImpact Impact); // Function FSD.ProjectileBase.Server_Impacted // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x11d4a10
	void OnUpgradeElementAdded(struct UProjectileUpgradeElement* element); // Function FSD.ProjectileBase.OnUpgradeElementAdded // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void OnRep_ProjectileImpact(); // Function FSD.ProjectileBase.OnRep_ProjectileImpact // (Native|Public) // @ game+0x6cb4d0
	void OnRep_IsDorment(bool wasDorment); // Function FSD.ProjectileBase.OnRep_IsDorment // (Native|Public) // @ game+0x11d47d0
	void OnPenetrated(bool PredictedPenetration, struct FHitResult HitResult); // Function FSD.ProjectileBase.OnPenetrated // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x158ca90
	void OnInitialized(); // Function FSD.ProjectileBase.OnInitialized // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void OnImpacted(bool PredictedImpact, struct FHitResult HitResult); // Function FSD.ProjectileBase.OnImpacted // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x158ca90
	void MakeBouncy(); // Function FSD.ProjectileBase.MakeBouncy // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void InitState(struct FVector ShootDirection, struct FVector initialBonusVelocity); // Function FSD.ProjectileBase.InitState // (Native|Public|HasOutParms|HasDefaults) // @ game+0x11d43f0
	void InitComponents(); // Function FSD.ProjectileBase.InitComponents // (Native|Public) // @ game+0x11d43d0
	void IgnoreCollision(struct UPrimitiveComponent* otherCollider); // Function FSD.ProjectileBase.IgnoreCollision // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x11d4350
	bool HasImpactAuthority(); // Function FSD.ProjectileBase.HasImpactAuthority // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11d4320
	float GetGameTimeSinceActivation(); // Function FSD.ProjectileBase.GetGameTimeSinceActivation // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11d42c0
	int32_t GetBoneIndex(); // Function FSD.ProjectileBase.GetBoneIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11d40d0
	void DoOnSpawn(); // Function FSD.ProjectileBase.DoOnSpawn // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void DisableProjectileCollision(struct AProjectileBase* projectileA, struct AProjectileBase* projectileB); // Function FSD.ProjectileBase.DisableProjectileCollision // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x11d3ee0
	void DisableAndDestroy(); // Function FSD.ProjectileBase.DisableAndDestroy // (Native|Public|BlueprintCallable) // @ game+0x11d3ec0
	void DamageArmor(struct UDamageComponent* DamageComponent, struct FHitResult HitResult); // Function FSD.ProjectileBase.DamageArmor // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x11d3da0
	void CustomEvent(struct UItemUpgrade* Event); // Function FSD.ProjectileBase.CustomEvent // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void Client_DrawServersDebugPath(struct FVector Location); // Function FSD.ProjectileBase.Client_DrawServersDebugPath // (Net|NetReliableNative|Event|Protected|HasDefaults|NetClient) // @ game+0x11d3d10
	void Activate(struct AActor* owningActor, struct FVector Origin, struct FVector_NetQuantizeNormal Direction, struct FVector_NetQuantizeNormal initialBonusVelocity); // Function FSD.ProjectileBase.Activate // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x11d3ba0
};

// Class FSD.Projectile
// Size: 0x340 (Inherited: 0x2f0)
struct AProjectile : AProjectileBase {
	struct FProjectileState State; // 0x2f0(0x28)
	char pad_318[0x8]; // 0x318(0x08)
	bool UseArmorDamageBoneCheck; // 0x320(0x01)
	char pad_321[0x7]; // 0x321(0x07)
	struct TArray<struct AActor*> IgnoreActorClasses; // 0x328(0x10)
	struct UFSDProjectileMovementComponent* MovementComponent; // 0x338(0x08)

	struct AProjectileBase* SpawnProjectileFromSelf(struct UObject* WorldContextObject, struct AProjectileBase* projectileClass, struct FVector Origin, struct FRotator velocityDirection); // Function FSD.Projectile.SpawnProjectileFromSelf // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x11d50d0
	struct AProjectileBase* SpawnProjectile(struct UObject* WorldContextObject, struct AProjectileBase* projectileClass, struct APawn* projectileOwner, struct FVector Origin, struct FRotator velocityDirection); // Function FSD.Projectile.SpawnProjectile // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x11d4f40
	struct AProjectileBase* SpawnBallisticProjectile(struct UObject* WorldContextObject, struct AProjectile* projectileClass, struct APawn* projectileOwner, struct FVector Origin, struct FVector Velocity); // Function FSD.Projectile.SpawnBallisticProjectile // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x11d4db0
	void SetHomingTargetComponent(struct USceneComponent* HomingTargetComponent, float Delay); // Function FSD.Projectile.SetHomingTargetComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x11d4ce0
	void Server_DisableHoming(); // Function FSD.Projectile.Server_DisableHoming // (Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x11d49f0
	void OnRep_State(struct FProjectileState oldState); // Function FSD.Projectile.OnRep_State // (Native|Protected|HasOutParms) // @ game+0x11d4920
	void OnPenetration(struct FHitResult HitResult); // Function FSD.Projectile.OnPenetration // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x11d46f0
	void OnImpact(struct FHitResult HitResult); // Function FSD.Projectile.OnImpact // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x11d4610
	void OnBounce(struct FHitResult ImpactResult, struct FVector ImpactVelocity); // Function FSD.Projectile.OnBounce // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x11d44e0
	struct UFSDPhysicalMaterial* FindBoneIndexFromArmor(struct FHitResult HitResult, int32_t outBoneIndex); // Function FSD.Projectile.FindBoneIndexFromArmor // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x11d3f90
};

// Class FSD.ChargedProjectile
// Size: 0x348 (Inherited: 0x340)
struct AChargedProjectile : AProjectile {
	bool ExplodesWhenDead; // 0x340(0x01)
	bool PersistentExplosion; // 0x341(0x01)
	bool AoEDamageInFlight; // 0x342(0x01)
	char pad_343[0x1]; // 0x343(0x01)
	float DirectDamageReduction; // 0x344(0x04)

	void OnAoEDamageEnabled(); // Function FSD.ChargedProjectile.OnAoEDamageEnabled // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
};

// Class FSD.ClaimableRewardEntryWidget
// Size: 0x298 (Inherited: 0x230)
struct UClaimableRewardEntryWidget : UUserWidget {
	struct FMulticastInlineDelegate OnRewardClaimed; // 0x230(0x10)
	struct FClaimableRewardEntry Data; // 0x240(0x58)

	void WidgetDelegate__DelegateSignature(struct UClaimableRewardEntryWidget* EntryWidget); // DelegateFunction FSD.ClaimableRewardEntryWidget.WidgetDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x158ca90
	void SignalRewardClaimed(); // Function FSD.ClaimableRewardEntryWidget.SignalRewardClaimed // (Final|Native|Protected|BlueprintCallable) // @ game+0x10a7e70
	void SetData(struct FClaimableRewardEntry InData); // Function FSD.ClaimableRewardEntryWidget.SetData // (Final|Native|Public|BlueprintCallable) // @ game+0x10a7b40
	void ReceiveDataChanged(); // Function FSD.ClaimableRewardEntryWidget.ReceiveDataChanged // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
};

// Class FSD.ClaimableRewardViewWidget
// Size: 0x2a0 (Inherited: 0x230)
struct UClaimableRewardViewWidget : UUserWidget {
	struct FClaimableRewardView Data; // 0x230(0x70)

	void ReceiveEndFlow(); // Function FSD.ClaimableRewardViewWidget.ReceiveEndFlow // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void ReceiveDataChanged(); // Function FSD.ClaimableRewardViewWidget.ReceiveDataChanged // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void ReceiveBeginFlow(); // Function FSD.ClaimableRewardViewWidget.ReceiveBeginFlow // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void EndRewardFlow(); // Function FSD.ClaimableRewardViewWidget.EndRewardFlow // (Final|Native|Public|BlueprintCallable) // @ game+0x10a6c30
	void BeginRewardFlow(struct FClaimableRewardView InViewData); // Function FSD.ClaimableRewardViewWidget.BeginRewardFlow // (Final|Native|Public|BlueprintCallable) // @ game+0x10a6a30
};

// Class FSD.ExampleActor
// Size: 0x240 (Inherited: 0x220)
struct AExampleActor : AActor {
	struct FMulticastInlineDelegate OnExampleUpdatedEvent; // 0x220(0x10)
	float Field; // 0x230(0x04)
	char pad_234[0xc]; // 0x234(0x0c)

	void Server_ExampleFunction(); // Function FSD.ExampleActor.Server_ExampleFunction // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x10ac7a0
	void Client_ExampleFunction(); // Function FSD.ExampleActor.Client_ExampleFunction // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x10ab220
	void All_ExampleFunction(); // Function FSD.ExampleActor.All_ExampleFunction // (Net|Native|Event|NetMulticast|Public) // @ game+0x10aad30
};

// Class FSD.CollectableResourceData
// Size: 0x138 (Inherited: 0xf0)
struct UCollectableResourceData : UResourceData {
	struct UDebrisPositioning* Positioning; // 0xf0(0x08)
	float Rarity; // 0xf8(0x04)
	float InfluenceRadius; // 0xfc(0x04)
	struct TArray<struct TSoftObjectPtr<struct UDebrisBase>> Debris; // 0x100(0x10)
	bool UseTerrainPlacement; // 0x110(0x01)
	char pad_111[0x7]; // 0x111(0x07)
	struct TArray<SoftClassProperty> CollectableClasses; // 0x118(0x10)
	struct TArray<struct AActor*> CollectableClassesLoaded; // 0x128(0x10)
};

// Class FSD.CharacterShoutsData
// Size: 0xe8 (Inherited: 0x30)
struct UCharacterShoutsData : UDataAsset {
	struct FCharacterShouts Shouts; // 0x30(0xb8)
};

// Class FSD.ShoutWidget
// Size: 0x258 (Inherited: 0x230)
struct UShoutWidget : UUserWidget {
	struct TWeakObjectPtr<struct APlayerCharacter> Sender; // 0x230(0x08)
	struct FText Text; // 0x238(0x18)
	float Duration; // 0x250(0x04)
	bool IsSubtitle; // 0x254(0x01)
	char pad_255[0x3]; // 0x255(0x03)

	void OnShout(); // Function FSD.ShoutWidget.OnShout // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	struct FString GetTimeString(int32_t Seconds); // Function FSD.ShoutWidget.GetTimeString // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x10ab7a0
	void GetSplitTimeString(int32_t Seconds, struct FString MinutesString, struct FString SecondsString); // Function FSD.ShoutWidget.GetSplitTimeString // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x10ab660
	struct FString GetCountDownString(int32_t Seconds); // Function FSD.ShoutWidget.GetCountDownString // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x10ab2f0
};

// Class FSD.CommunicationComponent
// Size: 0x278 (Inherited: 0xb0)
struct UCommunicationComponent : UActorComponent {
	struct FMulticastInlineDelegate OnMissionShout; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnMissionShoutEnd; // 0xc0(0x10)
	struct FMulticastInlineDelegate OnMixerAnnouncement; // 0xd0(0x10)
	struct FMulticastInlineDelegate OnMissionControlFinished; // 0xe0(0x10)
	bool ShoutingEnabled; // 0xf0(0x01)
	char pad_F1[0x7]; // 0xf1(0x07)
	struct UShoutWidget* ShoutWidgetType; // 0xf8(0x08)
	struct UCharacterShoutsData* CharacterShouts; // 0x100(0x08)
	float PitchMultiplier; // 0x108(0x04)
	float MinShoutDelay; // 0x10c(0x04)
	float CloseRangeShoutDistance; // 0x110(0x04)
	char pad_114[0x4]; // 0x114(0x04)
	struct TMap<struct UDialogDataAsset*, float> DelayedShouts; // 0x118(0x50)
	struct FGameplayTagContainer KillShoutAllowedTags; // 0x168(0x20)
	bool bMissionControlPaused; // 0x188(0x01)
	char pad_189[0x7]; // 0x189(0x07)
	struct UAudioComponent* MissionControlAudioComponent; // 0x190(0x08)
	struct TMap<struct APlayerCharacter*, struct UShoutWidget*> ActiveShouts; // 0x198(0x50)
	struct TArray<struct FActiveOutline> ActiveOutlines; // 0x1e8(0x10)
	struct APlayerCharacter* Character; // 0x1f8(0x08)
	struct UDialogDataAsset* LastShout; // 0x200(0x08)
	struct UAudioComponent* ShoutAudioComponent; // 0x208(0x08)
	struct TMap<struct UDialogDataAsset*, float> ShoutHistory; // 0x210(0x50)
	char pad_260[0x8]; // 0x260(0x08)
	struct TArray<struct FMissionShoutQueueItem> MissionShoutQueue; // 0x268(0x10)

	void ShoutCustomOrDefault(struct UDialogDataAsset* CustomShout, enum class EShoutType DefaultShout); // Function FSD.CommunicationComponent.ShoutCustomOrDefault // (Final|Native|Public|BlueprintCallable) // @ game+0x10acb00
	void ShoutCustomLocalOnly(struct UDialogDataAsset* Shout); // Function FSD.CommunicationComponent.ShoutCustomLocalOnly // (Final|Native|Public|BlueprintCallable) // @ game+0x10aca80
	void ShoutCustomClosestDwarf(struct UObject* WorldContext, struct UDialogDataAsset* Shout, struct FVector TargetLocation); // Function FSD.CommunicationComponent.ShoutCustomClosestDwarf // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x10ac980
	void ShoutCustom(struct UDialogDataAsset* Shout); // Function FSD.CommunicationComponent.ShoutCustom // (Final|Native|Public|BlueprintCallable) // @ game+0x10ac900
	void Shout(enum class EShoutType Shout); // Function FSD.CommunicationComponent.Shout // (Final|Native|Public|BlueprintCallable) // @ game+0x10ac880
	void SetMissionControlPaused(bool IsPaused); // Function FSD.CommunicationComponent.SetMissionControlPaused // (Final|Native|Public|BlueprintCallable) // @ game+0x10ac7f0
	void ServerShout(struct UDialogDataAsset* Shout); // Function FSD.CommunicationComponent.ServerShout // (Net|Native|Event|Protected|NetServer|NetValidate) // @ game+0x10ac6e0
	void ServerMixerAnnouncement(struct FMixerAnnouncement Announcement); // Function FSD.CommunicationComponent.ServerMixerAnnouncement // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x10ac5e0
	void ServerMissionShout(struct UDialogDataAsset* Shout, int32_t Index, bool bPriority); // Function FSD.CommunicationComponent.ServerMissionShout // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x10ac4a0
	struct UAudioComponent* PlayPitchedByClass(struct UObject* WorldContextObject, struct APlayerCharacter* CharacterClass, struct USoundBase* Sound, struct UDialogDataAsset* Shout, enum class EShoutType ShoutType, struct UAudioComponent* AudioComponent); // Function FSD.CommunicationComponent.PlayPitchedByClass // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x10ac220
	void PlayPitchedAsync(struct UDialogDataAsset* Shout, enum class EShoutType ShoutType, bool IgnoreCoolDown, struct UAudioComponent* AudioComponent, struct UObject* WorldContextObject, float shoutVolumeMultiplier); // Function FSD.CommunicationComponent.PlayPitchedAsync // (Final|Native|Public|BlueprintCallable) // @ game+0x10ac050
	struct UAudioComponent* PlayPitched(struct USoundBase* Sound, struct UDialogDataAsset* Shout, enum class EShoutType ShoutType, bool IgnoreCoolDown, struct UAudioComponent* AudioComponent, struct UObject* WorldContextObject); // Function FSD.CommunicationComponent.PlayPitched // (Final|Native|Public|BlueprintCallable) // @ game+0x10abe80
	void MixerAnnouncementLocalOnly(struct UObject* WorldContext, struct FMixerAnnouncement Announcement); // Function FSD.CommunicationComponent.MixerAnnouncementLocalOnly // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x10abd60
	void MixerAnnouncement(struct UObject* WorldContext, struct FMixerAnnouncement Announcement); // Function FSD.CommunicationComponent.MixerAnnouncement // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x10abc40
	int32_t MissionShoutLocally(struct UObject* WorldContext, struct UDialogDataAsset* Shout); // Function FSD.CommunicationComponent.MissionShoutLocally // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x10abb80
	void MissionShout(struct UObject* WorldContext, struct UDialogDataAsset* Shout, bool bPriority); // Function FSD.CommunicationComponent.MissionShout // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x10aba80
	bool IsMissionControlSpeaking(); // Function FSD.CommunicationComponent.IsMissionControlSpeaking // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10aba50
	void ClientShout(struct APlayerCharacter* Sender, struct UDialogDataAsset* Shout, int32_t Index); // Function FSD.CommunicationComponent.ClientShout // (Net|Native|Event|Protected|NetClient|NetValidate) // @ game+0x10ab0f0
	void ClientMixerAnnouncement(struct FMixerAnnouncement Announcement); // Function FSD.CommunicationComponent.ClientMixerAnnouncement // (Net|NetReliableNative|Event|Protected|NetClient|NetValidate) // @ game+0x10aaff0
	void ClientMissionShout(struct UDialogDataAsset* Shout, int32_t Index, bool bPriority); // Function FSD.CommunicationComponent.ClientMissionShout // (Net|NetReliableNative|Event|Protected|NetClient|NetValidate) // @ game+0x10aaeb0
};

// Class FSD.CommnuityRewardBundle
// Size: 0x40 (Inherited: 0x30)
struct UCommnuityRewardBundle : UDataAsset {
	struct TArray<struct FCommunityReward> Rewards; // 0x30(0x10)

	void AwardRewards(struct UObject* WorldContext); // Function FSD.CommnuityRewardBundle.AwardRewards // (Final|Native|Public|BlueprintCallable) // @ game+0x10aad70
};

// Class FSD.CommnuityRewardSetup
// Size: 0x40 (Inherited: 0x30)
struct UCommnuityRewardSetup : UDataAsset {
	struct TArray<struct UCommnuityRewardBundle*> TierRewards; // 0x30(0x10)

	struct TMap<struct UResourceData*, int32_t> GetResourcesTierOnlyReward(int32_t Tier); // Function FSD.CommnuityRewardSetup.GetResourcesTierOnlyReward // (Final|Native|Public|BlueprintCallable) // @ game+0x10ab510
	struct TMap<struct UResourceData*, int32_t> GetResourcesReward(int32_t Tier); // Function FSD.CommnuityRewardSetup.GetResourcesReward // (Final|Native|Public|BlueprintCallable) // @ game+0x10ab3c0
	void AwardTierRewards(struct UObject* WorldContext, int32_t Tier); // Function FSD.CommnuityRewardSetup.AwardTierRewards // (Final|Native|Public|BlueprintCallable) // @ game+0x10aadf0
};

// Class FSD.CommunityGoalCategory
// Size: 0x48 (Inherited: 0x30)
struct UCommunityGoalCategory : UDataAsset {
	struct FText Title; // 0x30(0x18)
};

// Class FSD.CommunityGoalFaction
// Size: 0xe8 (Inherited: 0x30)
struct UCommunityGoalFaction : UDataAsset {
	struct FText Title; // 0x30(0x18)
	struct FText Description; // 0x48(0x18)
	struct FText ShortDescription; // 0x60(0x18)
	struct FText JoinHeader; // 0x78(0x18)
	struct FText JoinBody; // 0x90(0x18)
	struct UTexture2D* Icon; // 0xa8(0x08)
	struct UTexture2D* Frame; // 0xb0(0x08)
	struct FSlateColor Color; // 0xb8(0x28)
	enum class EFSDFaction FactionID; // 0xe0(0x01)
	char pad_E1[0x7]; // 0xe1(0x07)
};

// Class FSD.CommunityGoal
// Size: 0x98 (Inherited: 0x30)
struct UCommunityGoal : UDataAsset {
	bool TierValuesAreInitialized; // 0x30(0x01)
	char pad_31[0x3]; // 0x31(0x03)
	struct FGuid SaveGameID; // 0x34(0x10)
	bool Active; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
	struct FText Title; // 0x48(0x18)
	struct FText MetaDescription; // 0x60(0x18)
	struct UCommunityGoalCategory* Category; // 0x78(0x08)
	enum class ECommunityGoalType CommunityGoalType; // 0x80(0x01)
	char pad_81[0x3]; // 0x81(0x03)
	float GoalPerMemberTier1; // 0x84(0x04)
	float GoalPerMemberTier2; // 0x88(0x04)
	float GoalPerMemberTier3; // 0x8c(0x04)
	struct UCommnuityRewardSetup* RewardSetup; // 0x90(0x08)

	float TotalTierProgress(float Value, int32_t Members); // Function FSD.CommunityGoal.TotalTierProgress // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x10acea0
	float TierValue(enum class ECommunityGoalTier Tier, float Value, int32_t Members); // Function FSD.CommunityGoal.TierValue // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x10acd90
	float TierProgress(enum class ECommunityGoalTier Tier, float Value, int32_t Members); // Function FSD.CommunityGoal.TierProgress // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x10acc80
	float TierGoal(enum class ECommunityGoalTier Tier, int32_t Members); // Function FSD.CommunityGoal.TierGoal // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x10acbc0
	int32_t RewardTier(float Value, int32_t Members); // Function FSD.CommunityGoal.RewardTier // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x10ac3d0
	void IncrementGoal(struct UObject* WorldContext, float Value); // Function FSD.CommunityGoal.IncrementGoal // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x10ab980
	struct FText GoalToText(enum class ECommunityGoalType StatType, float Value); // Function FSD.CommunityGoal.GoalToText // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x10ab860
	struct FText GetCategoryTitle(); // Function FSD.CommunityGoal.GetCategoryTitle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10ab240
	bool AreTiersInitialized(); // Function FSD.CommunityGoal.AreTiersInitialized // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10aad50
};

// Class FSD.CommunityGoalWrapper
// Size: 0x240 (Inherited: 0x28)
struct UCommunityGoalWrapper : UObject {
	bool HasCGS; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	struct FCommunityGoalStateData CGSData; // 0x2c(0x10)
	int32_t LastCollectedRewardID; // 0x3c(0x04)
	char pad_40[0x8]; // 0x40(0x08)
	struct FCommunityFactionData FactionData; // 0x48(0x38)
	bool FreeBeerRewardActive; // 0x80(0x01)
	char pad_81[0x7]; // 0x81(0x07)
	struct FMulticastInlineDelegate OnFreeBeerRewardChanged; // 0x88(0x10)
	char pad_98[0x20]; // 0x98(0x20)
	struct FString SteamTicket; // 0xb8(0x10)
	struct FString SteamBranch; // 0xc8(0x10)
	struct FMulticastInlineDelegate OnFactionsDataReceived; // 0xd8(0x10)
	struct FMulticastInlineDelegate OnDiscordCGSDataEvent; // 0xe8(0x10)
	struct FMulticastInlineDelegate UICheck; // 0xf8(0x10)
	struct FMulticastInlineDelegate OnGoalsInitializedDelegate; // 0x108(0x10)
	char pad_118[0x20]; // 0x118(0x20)
	bool AreAllGoalsInitialized; // 0x138(0x01)
	char pad_139[0x107]; // 0x139(0x107)

	void UpdateAllGoalsInitialized(); // Function FSD.CommunityGoalWrapper.UpdateAllGoalsInitialized // (Final|Native|Public|BlueprintCallable) // @ game+0x10b08b0
	bool RewardReceived(); // Function FSD.CommunityGoalWrapper.RewardReceived // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10b0860
	void RequestGoalStateData(); // Function FSD.CommunityGoalWrapper.RequestGoalStateData // (Final|Native|Public|BlueprintCallable) // @ game+0x10b0820
	void RequestFactionsData(); // Function FSD.CommunityGoalWrapper.RequestFactionsData // (Final|Native|Public|BlueprintCallable) // @ game+0x10b0800
	void NextPeriod(); // Function FSD.CommunityGoalWrapper.NextPeriod // (Final|Native|Public|BlueprintCallable) // @ game+0x10b0490
	void InitializeGoalTierTargetValues(struct UCommunityGoal* goalToInitialize); // Function FSD.CommunityGoalWrapper.InitializeGoalTierTargetValues // (Final|Native|Public|BlueprintCallable) // @ game+0x10b0410
	struct UCommunityGoalFaction* GetPlayerCurrentFaction(struct UObject* WorldContext); // Function FSD.CommunityGoalWrapper.GetPlayerCurrentFaction // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x10b0320
	void ClaimRewardMessage(struct UObject* WorldContext, struct FCommunityRewardNotification rewardNotification); // Function FSD.CommunityGoalWrapper.ClaimRewardMessage // (Final|Native|Public|BlueprintCallable) // @ game+0x10afbf0
	void ClaimReward(); // Function FSD.CommunityGoalWrapper.ClaimReward // (Final|Native|Public|BlueprintCallable) // @ game+0x10afbd0
	void CheckUI(); // Function FSD.CommunityGoalWrapper.CheckUI // (Final|Native|Public|BlueprintCallable) // @ game+0x10afbb0
};

// Class FSD.ControllerIconSettings
// Size: 0xc8 (Inherited: 0x38)
struct UControllerIconSettings : UDeveloperSettings {
	struct FInputTranslationTable InputTranslationTable; // 0x38(0x50)
	struct TArray<struct FActionIconMapping> Xbox_KeyIcons; // 0x88(0x10)
	struct TArray<struct FActionIconMapping> Playstation_KeyIcons; // 0x98(0x10)
	struct TArray<struct FActionIconMapping> Playstation5_KeyIcons; // 0xa8(0x10)
	struct TArray<struct FActionIconMapping> MouseKeyboard_KeyIcons; // 0xb8(0x10)

	bool FindMouseKeyboardKeyIcon(struct FKey Key, struct FActionIconMapping KeyIcon); // Function FSD.ControllerIconSettings.FindMouseKeyboardKeyIcon // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x10b0100
	bool FindKeyIcon(struct FKey Key, struct FActionIconMapping KeyIcon); // Function FSD.ControllerIconSettings.FindKeyIcon // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x10aff90
	bool FindControllerKeyIcon(struct FKey Key, struct FActionIconMapping KeyIcon); // Function FSD.ControllerIconSettings.FindControllerKeyIcon // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x10afe20
};

// Class FSD.ConvertedRobot
// Size: 0x6c0 (Inherited: 0x3a0)
struct AConvertedRobot : AEnemyDeepPathfinderCharacter {
	char pad_3A0[0x8]; // 0x3a0(0x08)
	struct UEnemyComponent* EnemyComponent; // 0x3a8(0x08)
	struct UPawnStatsComponent* PawnStats; // 0x3b0(0x08)
	struct UOutlineComponent* outline; // 0x3b8(0x08)
	struct UHitscanComponent* HitScan; // 0x3c0(0x08)
	struct USingleUsableComponent* Usable; // 0x3c8(0x08)
	struct USceneComponent* TurretRoot; // 0x3d0(0x08)
	struct USkeletalMeshComponent* TurretMesh; // 0x3d8(0x08)
	struct UPointLightComponent* MuzzleFlash; // 0x3e0(0x08)
	struct USpotLightComponent* SpotLight; // 0x3e8(0x08)
	struct UStaticMeshComponent* LightCone; // 0x3f0(0x08)
	struct UStaticMeshComponent* LaserBeam; // 0x3f8(0x08)
	struct USceneComponent* ShieldRoot; // 0x400(0x08)
	struct UStaticMeshComponent* InnerShield; // 0x408(0x08)
	struct UStaticMeshComponent* OuterShield; // 0x410(0x08)
	struct UAudioComponent* PulsatingSoundComp; // 0x418(0x08)
	struct UAudioComponent* LaserWarningSound; // 0x420(0x08)
	struct UDamageComponent* Damage; // 0x428(0x08)
	struct FMulticastInlineDelegate OnStateChanged; // 0x430(0x10)
	struct FMulticastInlineDelegate OnShieldChanged; // 0x440(0x10)
	struct FMulticastInlineDelegate OnIntroductionStart; // 0x450(0x10)
	char pad_460[0x10]; // 0x460(0x10)
	bool ForceSit; // 0x470(0x01)
	char pad_471[0x7]; // 0x471(0x07)
	struct USoundBase* LaserSound; // 0x478(0x08)
	struct USoundBase* LastPowerDownSound; // 0x480(0x08)
	struct USoundBase* PowerUpSound; // 0x488(0x08)
	struct TWeakObjectPtr<struct UAudioComponent> LaserSoundComp; // 0x490(0x08)
	char pad_498[0x18]; // 0x498(0x18)
	float IntroductionTime; // 0x4b0(0x04)
	bool IsIntroducing; // 0x4b4(0x01)
	bool IntroductionDone; // 0x4b5(0x01)
	bool IsGrowingShield; // 0x4b6(0x01)
	char pad_4B7[0x1]; // 0x4b7(0x01)
	float AimDownwardsOffset; // 0x4b8(0x04)
	float BigShieldScale; // 0x4bc(0x04)
	float SmallShieldScale; // 0x4c0(0x04)
	float ShieldGrowthRate; // 0x4c4(0x04)
	float LerpExp; // 0x4c8(0x04)
	float MinimumShieldSize; // 0x4cc(0x04)
	float TargetShieldSize; // 0x4d0(0x04)
	float IdleRotationSpeed; // 0x4d4(0x04)
	float LaserScaleRate; // 0x4d8(0x04)
	char pad_4DC[0x4]; // 0x4dc(0x04)
	float MaxSearchAngle; // 0x4e0(0x04)
	char pad_4E4[0x1c]; // 0x4e4(0x1c)
	bool DoSpecialWhenEnemy; // 0x500(0x01)
	bool DoSpecialWhenFriendly; // 0x501(0x01)
	bool PerfectTrackingWhenEnemy; // 0x502(0x01)
	bool PerfectTrackingWhenFriendly; // 0x503(0x01)
	char pad_504[0x2]; // 0x504(0x02)
	bool ReplaceBurstAttack; // 0x506(0x01)
	char pad_507[0x1]; // 0x507(0x01)
	struct USoundBase* GrenadeFireSound; // 0x508(0x08)
	struct UParticleSystem* GrenadeFireParticle; // 0x510(0x08)
	bool IsFiring; // 0x518(0x01)
	char pad_519[0x3]; // 0x519(0x03)
	float TurretSpinSpeed; // 0x51c(0x04)
	struct TArray<struct AActor*> Parasites; // 0x520(0x10)
	int32_t SpawnParasiteNumer; // 0x530(0x04)
	int32_t MaxParasiteSlots; // 0x534(0x04)
	float ChanceToSpawnParasite; // 0x538(0x04)
	char pad_53C[0x4]; // 0x53c(0x04)
	struct AParasiteEnemy* ParasiteClass; // 0x540(0x08)
	char pad_548[0x6]; // 0x548(0x06)
	bool SpinTurret; // 0x54e(0x01)
	char pad_54F[0x11]; // 0x54f(0x11)
	struct AProjectile* SpecialAttackProjectile; // 0x560(0x08)
	struct AProjectile* FriendlyProjectile; // 0x568(0x08)
	char pad_570[0xc]; // 0x570(0x0c)
	bool HasLockedOn; // 0x57c(0x01)
	char pad_57D[0x3]; // 0x57d(0x03)
	struct USoundBase* TargetingSound; // 0x580(0x08)
	struct UAnimSequenceBase* GrenadeShotAnimation; // 0x588(0x08)
	float LockOnTime; // 0x590(0x04)
	char pad_594[0x4]; // 0x594(0x04)
	struct USoundCue* ShootSound; // 0x598(0x08)
	float ShootSoundFadeout; // 0x5a0(0x04)
	char pad_5A4[0x4]; // 0x5a4(0x04)
	struct UAudioComponent* ShootSoundInstance; // 0x5a8(0x08)
	struct USoundCue* ShootSoundTail; // 0x5b0(0x08)
	struct UParticleSystem* MuzzleEffect; // 0x5b8(0x08)
	struct UParticleSystem* TracerEffect; // 0x5c0(0x08)
	struct FRuntimeFloatCurve MuzzleLightCurve; // 0x5c8(0x88)
	char pad_650[0x8]; // 0x650(0x08)
	float GunRange; // 0x658(0x04)
	float FireRate; // 0x65c(0x04)
	float GrenadeFireRate; // 0x660(0x04)
	char pad_664[0x4]; // 0x664(0x04)
	float BurstCooldown; // 0x668(0x04)
	char pad_66C[0x4]; // 0x66c(0x04)
	int32_t MinBurst; // 0x670(0x04)
	int32_t MaxBurst; // 0x674(0x04)
	float TurretLerpSpeed; // 0x678(0x04)
	float DamageWhenFriendly; // 0x67c(0x04)
	float FriendlyFriendlyFireMultiplier; // 0x680(0x04)
	char pad_684[0x4]; // 0x684(0x04)
	bool StartedSpecialAttack; // 0x688(0x01)
	enum class ERobotState TeamState; // 0x689(0x01)
	char pad_68A[0xe]; // 0x68a(0x0e)
	bool IsWalking; // 0x698(0x01)
	bool IsDoingSpecialAttack; // 0x699(0x01)
	char pad_69A[0x6]; // 0x69a(0x06)
	struct UStaticMeshComponent* TurretRotation; // 0x6a0(0x08)
	char pad_6A8[0x8]; // 0x6a8(0x08)
	struct AActor* CurrentTarget; // 0x6b0(0x08)
	char pad_6B8[0x8]; // 0x6b8(0x08)

	void UpdateGunsInsideTerrain(); // Function FSD.ConvertedRobot.UpdateGunsInsideTerrain // (Final|Native|Protected) // @ game+0x10b08d0
	void StartBossFight(); // Function FSD.ConvertedRobot.StartBossFight // (Final|Native|Public|BlueprintCallable) // @ game+0x10b0890
	void ParasiteDamaged(float aDamage); // Function FSD.ConvertedRobot.ParasiteDamaged // (Final|Native|Protected) // @ game+0x10b0780
	void OnWeaponsFired(struct FVector aHitResult); // Function FSD.ConvertedRobot.OnWeaponsFired // (Final|Native|Protected|HasOutParms|HasDefaults) // @ game+0x10b06f0
	void OnUsed(struct APlayerCharacter* aUser, enum class EInputKeys Key); // Function FSD.ConvertedRobot.OnUsed // (Final|Native|Protected) // @ game+0x10b0630
	void OnSeePawn(struct APawn* APawn); // Function FSD.ConvertedRobot.OnSeePawn // (Final|Native|Public) // @ game+0x10b05b0
	void OnRep_TeamState(); // Function FSD.ConvertedRobot.OnRep_TeamState // (Native|Protected) // @ game+0x10877d0
	void OnRep_Target(); // Function FSD.ConvertedRobot.OnRep_Target // (Native|Protected) // @ game+0x1083ef0
	void OnRep_SpinTurret(); // Function FSD.ConvertedRobot.OnRep_SpinTurret // (Final|Native|Protected) // @ game+0x10b0590
	void OnRep_IsIntroducting(); // Function FSD.ConvertedRobot.OnRep_IsIntroducting // (Final|Native|Protected) // @ game+0x10b0570
	void OnRep_IsFiring(); // Function FSD.ConvertedRobot.OnRep_IsFiring // (Final|Native|Protected) // @ game+0x10b0550
	void OnRep_IsDoingSpecialAttack(); // Function FSD.ConvertedRobot.OnRep_IsDoingSpecialAttack // (Final|Native|Protected) // @ game+0x10b0530
	void OnParasiteDeath(struct AActor* AParasiteEnemy); // Function FSD.ConvertedRobot.OnParasiteDeath // (Final|Native|Protected) // @ game+0x10b04b0
	enum class ERobotState GetTeamState(); // Function FSD.ConvertedRobot.GetTeamState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10b03f0
	struct FVector GetPlayerMediumPoint(); // Function FSD.ConvertedRobot.GetPlayerMediumPoint // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x10b03b0
	struct TArray<struct AActor*> GetParasites(); // Function FSD.ConvertedRobot.GetParasites // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10b0290
	bool GetHasPoweredDown(); // Function FSD.ConvertedRobot.GetHasPoweredDown // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10b0270
	void DestroyAttatchPoint(struct USceneComponent* aComponent); // Function FSD.ConvertedRobot.DestroyAttatchPoint // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x10afd90
	void CannonEffects(); // Function FSD.ConvertedRobot.CannonEffects // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x10926c0
	void BP_OnStateChanged(enum class ERobotState TeamState); // Function FSD.ConvertedRobot.BP_OnStateChanged // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void BP_OnShieldChanged(bool isGrowing); // Function FSD.ConvertedRobot.BP_OnShieldChanged // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void BP_OnInstroduce(); // Function FSD.ConvertedRobot.BP_OnInstroduce // (Event|Public|BlueprintEvent) // @ game+0x158ca90
};

// Class FSD.ConvertedRobotAnimInstance
// Size: 0x280 (Inherited: 0x270)
struct UConvertedRobotAnimInstance : UAnimInstance {
	bool HasIntroduced; // 0x26c(0x01)
	bool IsWalking; // 0x26d(0x01)
	bool IsIntroducing; // 0x26e(0x01)
	bool ShouldSit; // 0x26f(0x01)
	bool StopSit; // 0x270(0x01)
	bool ShouldCollapse; // 0x271(0x01)
	bool IsPoweredDown; // 0x272(0x01)
	float WalkingRate; // 0x274(0x04)
	float NormalWalkSpeed; // 0x278(0x04)
	char pad_27F[0x1]; // 0x27f(0x01)
};

// Class FSD.ConvertedRobotTurretAnimInstance
// Size: 0x270 (Inherited: 0x270)
struct UConvertedRobotTurretAnimInstance : UAnimInstance {
	bool ReplaceBurstAttack; // 0x268(0x01)
	bool IsFiringGrenades; // 0x269(0x01)
	bool IsDoingSpecialAttack; // 0x26a(0x01)
	bool ShouldFireBullets; // 0x26b(0x01)
	bool StopFiringBullets; // 0x26c(0x01)
	bool ShouldCannonDeploy; // 0x26d(0x01)
};

// Class FSD.EnemyAIController
// Size: 0x358 (Inherited: 0x358)
struct AEnemyAIController : AFSDAIController {
};

// Class FSD.ConvertedRobotController
// Size: 0x428 (Inherited: 0x358)
struct AConvertedRobotController : AEnemyAIController {
	float CheckRangeInterval; // 0x358(0x04)
	float MaxTimeInRange; // 0x35c(0x04)
	char pad_360[0x4]; // 0x360(0x04)
	float PersonalSpaceRange; // 0x364(0x04)
	char pad_368[0x10]; // 0x368(0x10)
	struct FGameplayTagQuery FriendlyTargetingQuery; // 0x378(0x48)
	float SpecialAttackRange; // 0x3c0(0x04)
	float SpecialAttackFireRate; // 0x3c4(0x04)
	char pad_3C8[0x20]; // 0x3c8(0x20)
	float WaitBeforeSpecial; // 0x3e8(0x04)
	char pad_3EC[0x4]; // 0x3ec(0x04)
	float WaitAfterSpecial; // 0x3f0(0x04)
	char pad_3F4[0x8]; // 0x3f4(0x08)
	float MinSpecialAttackCooldown; // 0x3fc(0x04)
	float MaxSpecialAttackCooldown; // 0x400(0x04)
	char pad_404[0x4]; // 0x404(0x04)
	struct UBehaviorTree* BehaviourTree; // 0x408(0x08)
	float UpdateTargetInterval; // 0x410(0x04)
	char pad_414[0x4]; // 0x414(0x04)
	float PowerDownAfterSeconds; // 0x418(0x04)
	char pad_41C[0xc]; // 0x41c(0x0c)

	void ResetCloseTimer(); // Function FSD.ConvertedRobotController.ResetCloseTimer // (Final|Native|Public|BlueprintCallable) // @ game+0x10b0840
};

// Class FSD.CoolDownItemAggregator
// Size: 0xe8 (Inherited: 0xc8)
struct UCoolDownItemAggregator : UItemAggregator {
	float CooldownDuration; // 0xc8(0x04)
	char pad_CC[0x4]; // 0xcc(0x04)
	struct USoundBase* AudioCoolDownFinished; // 0xd0(0x08)
	float CooldownRemaining; // 0xd8(0x04)
	bool CoolDownIsPaused; // 0xdc(0x01)
	char pad_DD[0x3]; // 0xdd(0x03)
	struct AItem* Item; // 0xe0(0x08)

	void SetPaused(bool IsPaused); // Function FSD.CoolDownItemAggregator.SetPaused // (Final|Native|Public|BlueprintCallable) // @ game+0x10b58d0
	bool IsCoolingDown(); // Function FSD.CoolDownItemAggregator.IsCoolingDown // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10b5300
	float GetCoolDownProgress(); // Function FSD.CoolDownItemAggregator.GetCoolDownProgress // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10b50b0
	void ActivateCoolDown(bool startPaused); // Function FSD.CoolDownItemAggregator.ActivateCoolDown // (Final|Native|Public|BlueprintCallable) // @ game+0x10b4e60
};

// Class FSD.CoolDownProgressWidget
// Size: 0x280 (Inherited: 0x230)
struct UCoolDownProgressWidget : UUserWidget {
	struct FCoolDownProgressStyle Style; // 0x230(0x40)
	struct TWeakObjectPtr<struct UObject> CoolDownObject; // 0x270(0x08)
	bool bIsFinished; // 0x278(0x01)
	char pad_279[0x7]; // 0x279(0x07)

	void UpdateProgress(float Progress); // Function FSD.CoolDownProgressWidget.UpdateProgress // (Final|Native|Protected|BlueprintCallable) // @ game+0x10b5950
	void ReceiveUpdateProgress(float InProgress); // Function FSD.CoolDownProgressWidget.ReceiveUpdateProgress // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void ReceiveInitWidget(); // Function FSD.CoolDownProgressWidget.ReceiveInitWidget // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void Init(struct UObject* InCoolDownObject, struct FCoolDownProgressStyle InStyle); // Function FSD.CoolDownProgressWidget.Init // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x10b51e0
};

// Class FSD.PricingTier
// Size: 0x40 (Inherited: 0x30)
struct UPricingTier : UDataAsset {
	struct FString PriceKey; // 0x30(0x10)
};

// Class FSD.SchematicPricingTier
// Size: 0x40 (Inherited: 0x40)
struct USchematicPricingTier : UPricingTier {
};

// Class FSD.CreditsResourceData
// Size: 0xf0 (Inherited: 0xf0)
struct UCreditsResourceData : UResourceData {
};

// Class FSD.CritterManager
// Size: 0xf8 (Inherited: 0xb0)
struct UCritterManager : UActorComponent {
	bool DisableCritters; // 0xb0(0x01)
	char pad_B1[0x3]; // 0xb1(0x03)
	float ActivationRange; // 0xb4(0x04)
	char pad_B8[0x40]; // 0xb8(0x40)
};

// Class FSD.CrosshairWidget
// Size: 0x230 (Inherited: 0x230)
struct UCrosshairWidget : UUserWidget {

	void SetData(struct AItem* Item); // Function FSD.CrosshairWidget.SetData // (Event|Public|BlueprintEvent) // @ game+0x158ca90
	void OnUpgraded(struct AItem* Item); // Function FSD.CrosshairWidget.OnUpgraded // (Event|Public|BlueprintEvent) // @ game+0x158ca90
};

// Class FSD.CrosshairAggregator
// Size: 0xf0 (Inherited: 0xc8)
struct UCrosshairAggregator : UItemAggregator {
	char pad_C8[0x8]; // 0xc8(0x08)
	struct FMulticastInlineDelegate OnCrosshairCreated; // 0xd0(0x10)
	struct UUserWidget* CrosshairWidget; // 0xe0(0x08)
	struct UUserWidget* CrossHairType; // 0xe8(0x08)

	void SetCrosshair(struct UUserWidget* Widget); // Function FSD.CrosshairAggregator.SetCrosshair // (Final|Native|Public|BlueprintCallable) // @ game+0x10b5850
	struct UUserWidget* GetOrCreateCrosshair(); // Function FSD.CrosshairAggregator.GetOrCreateCrosshair // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x10b51b0
};

// Class FSD.CryosprayItem
// Size: 0x868 (Inherited: 0x6e0)
struct ACryosprayItem : AAmmoDrivenWeapon {
	struct UProjectileLauncherComponent* ProjectileLauncher; // 0x6e0(0x08)
	struct UDamageComponent* DamageComponent; // 0x6e8(0x08)
	struct UStickyFlameSpawner* StickyFlames; // 0x6f0(0x08)
	struct UDamageComponent* AoEColdDamageComponent; // 0x6f8(0x08)
	struct UMotionAudioController* VelocityAudio; // 0x700(0x08)
	struct UParticleSystemComponent* FlameParticleComponent; // 0x708(0x08)
	bool PressurizedProjectileEnabled; // 0x710(0x01)
	char pad_711[0x3]; // 0x711(0x03)
	float PressurizedProjectileDelay; // 0x714(0x04)
	int32_t PressurizeProjectileFullCost; // 0x718(0x04)
	char pad_71C[0xc]; // 0x71c(0x0c)
	struct UParticleSystem* ChargeupParticles; // 0x728(0x08)
	struct UParticleSystemComponent* ChargeupParticleInstance; // 0x730(0x08)
	struct FDecalData ImpactDecal; // 0x738(0x18)
	float DecalDelay; // 0x750(0x04)
	char pad_754[0x4]; // 0x754(0x04)
	struct UParticleSystem* ImpactParticles; // 0x758(0x08)
	struct UParticleSystemComponent* ImpactParticleInstance; // 0x760(0x08)
	struct TArray<struct FName> FlameParameterNames; // 0x768(0x10)
	float DamageSphereRadius; // 0x778(0x04)
	float MaxFlameDistance; // 0x77c(0x04)
	float FlameGrowthPerSecond; // 0x780(0x04)
	float friendlyFireModifier; // 0x784(0x04)
	float ChargeupTime; // 0x788(0x04)
	float ChargeDownTime; // 0x78c(0x04)
	char pad_790[0x1]; // 0x790(0x01)
	bool isCharging; // 0x791(0x01)
	char pad_792[0x2]; // 0x792(0x02)
	float ChargeProgress; // 0x794(0x04)
	bool bRepressurerising; // 0x798(0x01)
	char pad_799[0x3]; // 0x799(0x03)
	float RepressurerisingDoneAtPct; // 0x79c(0x04)
	float ChargeUpFadeOutTime; // 0x7a0(0x04)
	char pad_7A4[0x4]; // 0x7a4(0x04)
	struct UFSDAudioComponent* ChargeUpAudioComponent; // 0x7a8(0x08)
	float PressureTime; // 0x7b0(0x04)
	float PressureDropMultiplier; // 0x7b4(0x04)
	float PressureGainMultiplier; // 0x7b8(0x04)
	float CurrentPressure; // 0x7bc(0x04)
	float RePressureDuration; // 0x7c0(0x04)
	float RePressureProgress; // 0x7c4(0x04)
	struct TArray<struct UItemUpgrade*> upgrades; // 0x7c8(0x10)
	bool LongReachEnabled; // 0x7d8(0x01)
	char pad_7D9[0xf]; // 0x7d9(0x0f)
	bool AoEColdEnabled; // 0x7e8(0x01)
	char pad_7E9[0x7f]; // 0x7e9(0x7f)

	void ServerDoDamage(struct FVector_NetQuantize Start, struct FVector_NetQuantize End, char Power); // Function FSD.CryosprayItem.ServerDoDamage // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x10b5630
	void Server_TriggerAoECold(); // Function FSD.CryosprayItem.Server_TriggerAoECold // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x10b5800
	void Server_PreLaunchProjectile(); // Function FSD.CryosprayItem.Server_PreLaunchProjectile // (Net|NetReliableNative|Event|Protected|NetServer|NetValidate) // @ game+0x10b57b0
	void ReceiveRepressurisingChanged(bool Value); // Function FSD.CryosprayItem.ReceiveRepressurisingChanged // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void OnTargetDamaged(struct UHealthComponentBase* Health, float Amount, struct UPrimitiveComponent* HitComponent, struct UFSDPhysicalMaterial* PhysicalMaterial); // Function FSD.CryosprayItem.OnTargetDamaged // (Final|Native|Protected) // @ game+0x10b54e0
	void OnRep_IsCharging(bool OldValue); // Function FSD.CryosprayItem.OnRep_IsCharging // (Final|Native|Protected) // @ game+0x10b5450
	void OnProjectileSpawned(struct AProjectileBase* Projectile); // Function FSD.CryosprayItem.OnProjectileSpawned // (Final|Native|Protected) // @ game+0x10b53d0
	void OnProjectileLaunched(struct FVector Location); // Function FSD.CryosprayItem.OnProjectileLaunched // (Event|Protected|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x158ca90
	void OnPressurizedPartileShoot(); // Function FSD.CryosprayItem.OnPressurizedPartileShoot // (Final|Native|Protected) // @ game+0x10b53b0
	void OnPreProjectileLaunch(); // Function FSD.CryosprayItem.OnPreProjectileLaunch // (Event|Protected|BlueprintEvent) // @ game+0x158ca90
	void All_PreLaunchProjectile(); // Function FSD.CryosprayItem.All_PreLaunchProjectile // (Net|Native|Event|NetMulticast|Protected) // @ game+0x1092350
};

// Class FSD.CryoSprayAnimInstance
// Size: 0x290 (Inherited: 0x270)
struct UCryoSprayAnimInstance : UAnimInstance {
	struct ACryosprayItem* Weapon; // 0x268(0x08)
	bool IsFiring; // 0x270(0x01)
	float ChargeProgress; // 0x274(0x04)
	struct FRotator ChargeRotation; // 0x278(0x0c)
	float ChargeBlend; // 0x284(0x04)
	float Pressure; // 0x288(0x04)
};

// Class FSD.CustomKeyBindingLibrary
// Size: 0x28 (Inherited: 0x28)
struct UCustomKeyBindingLibrary : UBlueprintFunctionLibrary {
};

// Class FSD.KeyBindingSettings
// Size: 0x50 (Inherited: 0x30)
struct UKeyBindingSettings : UDataAsset {
	struct TArray<struct FCustomKeySetting> KeyboardMouseButtons; // 0x30(0x10)
	struct TArray<struct FCustomKeySetting> ControllerButtons; // 0x40(0x10)
};

// Class FSD.CustomRichTextDecorator
// Size: 0x30 (Inherited: 0x28)
struct UCustomRichTextDecorator : URichTextBlockDecorator {
	struct URichTextBlock* RichTextBlock; // 0x28(0x08)
};

// Class FSD.DailyDealSettings
// Size: 0x40 (Inherited: 0x30)
struct UDailyDealSettings : UDataAsset {
	struct TArray<struct FDailyDealSetup> DailyDeals; // 0x30(0x10)

	bool IsDailyDealBought(struct UObject* WorldContextObject); // Function FSD.DailyDealSettings.IsDailyDealBought // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x10b5330
	int32_t GetDailyDealSeed(); // Function FSD.DailyDealSettings.GetDailyDealSeed // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x10b5180
	void GetDailyDeal(struct FDailyDeal outDeal); // Function FSD.DailyDealSettings.GetDailyDeal // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x10b5100
	bool CanAffordDailyDeal(struct UObject* WorldContextObject); // Function FSD.DailyDealSettings.CanAffordDailyDeal // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x10b5030
	bool BuyDailyDeal(struct UObject* WorldContextObject); // Function FSD.DailyDealSettings.BuyDailyDeal // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x10b4fb0
};

// Class FSD.DamageAttackComponent
// Size: 0xf8 (Inherited: 0xf0)
struct UDamageAttackComponent : UAttackBaseComponent {
	struct UDamageComponent* Damage; // 0xf0(0x08)
};

// Class FSD.DamageBonusBase
// Size: 0x38 (Inherited: 0x30)
struct UDamageBonusBase : UDataAsset {
	struct UDamageCondition* Condition; // 0x30(0x08)

	struct UDamageBonusBase* AddDamageBonusToComponent(struct UDamageBonusBase* damageBonusClass, struct UDamageComponent* DamageComponent); // Function FSD.DamageBonusBase.AddDamageBonusToComponent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x10b4ef0
};

// Class FSD.FlatDamageBonus
// Size: 0x48 (Inherited: 0x38)
struct UFlatDamageBonus : UDamageBonusBase {
	float Damage; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct UDamageClass* DamageClass; // 0x40(0x08)
};

// Class FSD.RangedFlatDamageBonus
// Size: 0x48 (Inherited: 0x38)
struct URangedFlatDamageBonus : UDamageBonusBase {
	struct UCurveFloat* DamageCurve; // 0x38(0x08)
	struct UDamageClass* DamageClass; // 0x40(0x08)
};

// Class FSD.TargetSpecificDamageBonus
// Size: 0x90 (Inherited: 0x38)
struct UTargetSpecificDamageBonus : UDamageBonusBase {
	float Bonus; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct FGameplayTagQuery tagQuery; // 0x40(0x48)
	struct FName Key; // 0x88(0x08)
};

// Class FSD.DamageConversionBonus
// Size: 0x48 (Inherited: 0x38)
struct UDamageConversionBonus : UDamageBonusBase {
	struct UDamageClass* DamageClass; // 0x38(0x08)
	float ConversionPercentage; // 0x40(0x04)
	bool DamageIsAdded; // 0x44(0x01)
	char pad_45[0x3]; // 0x45(0x03)
};

// Class FSD.TargetStateDamageBonus
// Size: 0x48 (Inherited: 0x38)
struct UTargetStateDamageBonus : UDamageBonusBase {
	enum class ETargetStateDamageBonusType TargetState; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	float Bonus; // 0x3c(0x04)
	struct UDamageClass* DamageClass; // 0x40(0x08)
};

// Class FSD.StatusDamageBonus
// Size: 0x58 (Inherited: 0x38)
struct UStatusDamageBonus : UDamageBonusBase {
	struct TArray<struct UStatusEffect*> StatusEffects; // 0x38(0x10)
	float Bonus; // 0x48(0x04)
	char pad_4C[0x4]; // 0x4c(0x04)
	struct UDamageClass* DamageClass; // 0x50(0x08)
};

// Class FSD.StatusAndStateDamageBonus
// Size: 0x68 (Inherited: 0x38)
struct UStatusAndStateDamageBonus : UDamageBonusBase {
	struct TArray<struct UStatusEffect*> StatusEffects; // 0x38(0x10)
	struct TArray<enum class ETargetStateDamageBonusType> TargetStates; // 0x48(0x10)
	float Bonus; // 0x58(0x04)
	char pad_5C[0x4]; // 0x5c(0x04)
	struct UDamageClass* DamageClass; // 0x60(0x08)
};

// Class FSD.PushStatusEffectDamageBonus
// Size: 0x58 (Inherited: 0x38)
struct UPushStatusEffectDamageBonus : UDamageBonusBase {
	char pad_38[0x10]; // 0x38(0x10)
	struct UStatusEffect* StatusEffect; // 0x48(0x08)
	float Chance; // 0x50(0x04)
	bool IgnoreArmorHit; // 0x54(0x01)
	char pad_55[0x3]; // 0x55(0x03)
};

// Class FSD.PushDynamicStatusEffectDamageBonus
// Size: 0x60 (Inherited: 0x38)
struct UPushDynamicStatusEffectDamageBonus : UDamageBonusBase {
	char pad_38[0x10]; // 0x38(0x10)
	struct UStatusEffect* BaseSTE; // 0x48(0x08)
	struct UStatusEffect* StatusEffect; // 0x50(0x08)
	float Chance; // 0x58(0x04)
	char pad_5C[0x4]; // 0x5c(0x04)
};

// Class FSD.FearAoEBonus
// Size: 0x40 (Inherited: 0x38)
struct UFearAoEBonus : UDamageBonusBase {
	float FearFactor; // 0x38(0x04)
	float range; // 0x3c(0x04)
};

// Class FSD.AmmoLeftDamageBonus
// Size: 0x58 (Inherited: 0x48)
struct UAmmoLeftDamageBonus : UFlatDamageBonus {
	struct UCurveFloat* AmmoDamageCurve; // 0x48(0x08)
	char pad_50[0x8]; // 0x50(0x08)
};

// Class FSD.AmmoUsedDamageBonus
// Size: 0x40 (Inherited: 0x38)
struct UAmmoUsedDamageBonus : UDamageBonusBase {
	float DamageBonusPerRoundFired; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// Class FSD.RandomDamageBonus
// Size: 0x40 (Inherited: 0x38)
struct URandomDamageBonus : UDamageBonusBase {
	struct FRandRange RandomDamageRange; // 0x38(0x08)
};

// Class FSD.PercentDamageBonus
// Size: 0x40 (Inherited: 0x38)
struct UPercentDamageBonus : UDamageBonusBase {
	float DamageMultiplier; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// Class FSD.GatlingHotShellsBonus
// Size: 0x48 (Inherited: 0x48)
struct UGatlingHotShellsBonus : UDamageConversionBonus {
};

// Class FSD.BreakIceBonus
// Size: 0x40 (Inherited: 0x38)
struct UBreakIceBonus : UDamageBonusBase {
	float DeFrostAmount; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// Class FSD.KnockbackDamageBonus
// Size: 0x40 (Inherited: 0x38)
struct UKnockbackDamageBonus : UDamageBonusBase {
	float KnockBackHorizontalForce; // 0x38(0x04)
	float KnockBackVerticalForce; // 0x3c(0x04)
};

// Class FSD.CarryElementalStatus
// Size: 0x48 (Inherited: 0x38)
struct UCarryElementalStatus : UDamageBonusBase {
	float CarryBonusAmount; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct UDamageClass* CarriedClass; // 0x40(0x08)
};

// Class FSD.LockCountSTEBonus
// Size: 0x48 (Inherited: 0x38)
struct ULockCountSTEBonus : UDamageBonusBase {
	int32_t MinLockCount; // 0x38(0x04)
	bool UseTotalLockCount; // 0x3c(0x01)
	char pad_3D[0x3]; // 0x3d(0x03)
	struct UStatusEffect* StatusEffect; // 0x40(0x08)
};

// Class FSD.TagDamageBonus
// Size: 0x48 (Inherited: 0x38)
struct UTagDamageBonus : UDamageBonusBase {
	struct TArray<struct UDamageTag*> Tags; // 0x38(0x10)
};

// Class FSD.SpawnOnImpactDamageBonus
// Size: 0x40 (Inherited: 0x38)
struct USpawnOnImpactDamageBonus : UDamageBonusBase {
	struct AActor* ActorToSpawn; // 0x38(0x08)
};

// Class FSD.DamageClass
// Size: 0x50 (Inherited: 0x30)
struct UDamageClass : UDataAsset {
	struct UPawnStat* ResistanceStat; // 0x30(0x08)
	float RagdollScale; // 0x38(0x04)
	bool BypassesShield; // 0x3c(0x01)
	bool AffectedByFriendlyFire; // 0x3d(0x01)
	char pad_3E[0x2]; // 0x3e(0x02)
	struct UTexture2D* IndicatorImage; // 0x40(0x08)
	struct UDialogDataAsset* DamageShout; // 0x48(0x08)
};

// Class FSD.DamageComponent
// Size: 0x1b0 (Inherited: 0xb0)
struct UDamageComponent : UActorComponent {
	struct FMulticastInlineDelegate OnTargetKilledEvent; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnTargetDamagedEvent; // 0xc0(0x10)
	struct FMulticastInlineDelegate OnNoTargetHitEvent; // 0xd0(0x10)
	struct FMulticastInlineDelegate OnHitDeadTarget; // 0xe0(0x10)
	char pad_F0[0x4]; // 0xf0(0x04)
	enum class EDamageComponentType DamageComponentType; // 0xf4(0x01)
	char pad_F5[0x3]; // 0xf5(0x03)
	float Damage; // 0xf8(0x04)
	float ArmorDamageMultiplier; // 0xfc(0x04)
	bool ShattersArmor; // 0x100(0x01)
	char pad_101[0x7]; // 0x101(0x07)
	struct UDamageClass* DamageClass; // 0x108(0x08)
	float WeakpointDamageMultiplier; // 0x110(0x04)
	float FrozenDamageBonusScale; // 0x114(0x04)
	float friendlyFireModifier; // 0x118(0x04)
	float SelfFriendlyFireMultiplier; // 0x11c(0x04)
	struct FGameplayTag FriendlyFireTag; // 0x120(0x08)
	bool StaggerOnlyOnWeakpointHit; // 0x128(0x01)
	char pad_129[0x3]; // 0x129(0x03)
	float StaggerChance; // 0x12c(0x04)
	float StaggerDuration; // 0x130(0x04)
	float FearFactor; // 0x134(0x04)
	struct TArray<struct UDamageBonusBase*> DamageBonuses; // 0x138(0x10)
	struct TArray<struct UDamageModifier*> DamageModifiers; // 0x148(0x10)
	struct TArray<struct UDamageTag*> DamageTags; // 0x158(0x10)
	char pad_168[0x10]; // 0x168(0x10)
	bool UseAreaOfEffect; // 0x178(0x01)
	char pad_179[0x3]; // 0x179(0x03)
	float RadialDamage; // 0x17c(0x04)
	bool NoFriendlyFireFromRadial; // 0x180(0x01)
	char pad_181[0x7]; // 0x181(0x07)
	struct UDamageClass* RadialDamageClass; // 0x188(0x08)
	float MinDamagePct; // 0x190(0x04)
	float DamageRadius; // 0x194(0x04)
	float MaxDamageRadius; // 0x198(0x04)
	char pad_19C[0x14]; // 0x19c(0x14)

	void PreTestDamageConditions(); // Function FSD.DamageComponent.PreTestDamageConditions // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x10b95a0
	struct UDamageComponent* GetDamageComponentCDO(struct UDamageComponent* DamageComponent); // Function FSD.DamageComponent.GetDamageComponentCDO // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x109af60
	float GetDamage(); // Function FSD.DamageComponent.GetDamage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10b9310
	void DamageTargetFromHit(struct FHitResult HitResult); // Function FSD.DamageComponent.DamageTargetFromHit // (Final|BlueprintAuthorityOnly|Native|Public|HasOutParms|BlueprintCallable|Const) // @ game+0x10b9230
	void DamageTarget(struct AActor* Target, struct FVector Location, struct UPrimitiveComponent* HitComponent, struct UFSDPhysicalMaterial* PhysMat); // Function FSD.DamageComponent.DamageTarget // (Final|BlueprintAuthorityOnly|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|Const) // @ game+0x10b90d0
	void DamageArmor_Server(struct AActor* Target, struct UPrimitiveComponent* collider, int32_t BoneIndex, struct FVector impactLocation); // Function FSD.DamageComponent.DamageArmor_Server // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|Const) // @ game+0x10b8f80
	void DamageArmor_All(struct AActor* Target, struct UPrimitiveComponent* collider, int32_t BoneIndex); // Function FSD.DamageComponent.DamageArmor_All // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x10b8e80
	bool ArmorSupportsLocalOnlyCall(struct AActor* Target); // Function FSD.DamageComponent.ArmorSupportsLocalOnlyCall // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10b8df0
};

// Class FSD.DamageCondition
// Size: 0x28 (Inherited: 0x28)
struct UDamageCondition : UObject {
};

// Class FSD.FalseDamageCondition
// Size: 0x28 (Inherited: 0x28)
struct UFalseDamageCondition : UDamageCondition {
};

// Class FSD.MultiDamageCondition
// Size: 0x40 (Inherited: 0x28)
struct UMultiDamageCondition : UDamageCondition {
	struct TArray<struct UDamageCondition*> Conditions; // 0x28(0x10)
	bool RequireAllTrue; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class FSD.RandomDamageCondition
// Size: 0x30 (Inherited: 0x28)
struct URandomDamageCondition : UDamageCondition {
	float Chance; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// Class FSD.LockCountDamageCondition
// Size: 0x30 (Inherited: 0x28)
struct ULockCountDamageCondition : UDamageCondition {
	int32_t MinLockCount; // 0x28(0x04)
	bool UseTotalLockCount; // 0x2c(0x01)
	char pad_2D[0x3]; // 0x2d(0x03)
};

// Class FSD.LocksRemainingDamageCondition
// Size: 0x30 (Inherited: 0x28)
struct ULocksRemainingDamageCondition : UDamageCondition {
	int32_t MaxLocksRemaining; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// Class FSD.TargetStateDamageCondition
// Size: 0x30 (Inherited: 0x28)
struct UTargetStateDamageCondition : UDamageCondition {
	enum class ETargetStateDamageBonusType TargetState; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
};

// Class FSD.TargetSTEDamageCondition
// Size: 0x38 (Inherited: 0x28)
struct UTargetSTEDamageCondition : UDamageCondition {
	struct TArray<struct UStatusEffect*> StatusEffects; // 0x28(0x10)
};

// Class FSD.TargetTagsDamageCondition
// Size: 0x70 (Inherited: 0x28)
struct UTargetTagsDamageCondition : UDamageCondition {
	struct FGameplayTagQuery tagQuery; // 0x28(0x48)
};

// Class FSD.WeakpointDamageCondition
// Size: 0x28 (Inherited: 0x28)
struct UWeakpointDamageCondition : UDamageCondition {
};

// Class FSD.DirectDamageCondition
// Size: 0x30 (Inherited: 0x28)
struct UDirectDamageCondition : UDamageCondition {
	enum class EDirectDamageConditionEnum Type; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
};

// Class FSD.ClipStatusDamageCondition
// Size: 0x30 (Inherited: 0x28)
struct UClipStatusDamageCondition : UDamageCondition {
	int32_t BulletAmount; // 0x28(0x04)
	bool CountBulletsLeft; // 0x2c(0x01)
	char pad_2D[0x3]; // 0x2d(0x03)
};

// Class FSD.ItemTemperatureDamageCondition
// Size: 0x30 (Inherited: 0x28)
struct UItemTemperatureDamageCondition : UDamageCondition {
	int32_t HeatThreshold; // 0x28(0x04)
	bool MustBeUnderThreshold; // 0x2c(0x01)
	char pad_2D[0x3]; // 0x2d(0x03)
};

// Class FSD.PlayerShieldsDamageCondition
// Size: 0x30 (Inherited: 0x28)
struct UPlayerShieldsDamageCondition : UDamageCondition {
	struct FFloatInterval ShieldPercentageRequired; // 0x28(0x08)
};

// Class FSD.PlayerHealthDamageCondition
// Size: 0x30 (Inherited: 0x28)
struct UPlayerHealthDamageCondition : UDamageCondition {
	struct FFloatInterval HealthPercentageRequired; // 0x28(0x08)
};

// Class FSD.CooldownDamageCondition
// Size: 0x30 (Inherited: 0x28)
struct UCooldownDamageCondition : UDamageCondition {
	float CoolDown; // 0x28(0x04)
	char pad_2C[0x4]; // 0x2c(0x04)
};

// Class FSD.BoltActionWeaponDamageCondition
// Size: 0x30 (Inherited: 0x28)
struct UBoltActionWeaponDamageCondition : UDamageCondition {
	enum class EBoltActionWeaponConditions WeaponCondition; // 0x28(0x01)
	char pad_29[0x7]; // 0x29(0x07)
};

// Class FSD.PlasmaCarbineDamageCondition
// Size: 0x30 (Inherited: 0x28)
struct UPlasmaCarbineDamageCondition : UDamageCondition {
	enum class EPlasmaCarbineConditions WeaponCondition; // 0x28(0x01)
	char pad_29[0x3]; // 0x29(0x03)
	int32_t Condition; // 0x2c(0x04)
};

// Class FSD.MaterialDamageMultiplierCondition
// Size: 0x38 (Inherited: 0x28)
struct UMaterialDamageMultiplierCondition : UDamageCondition {
	struct FFloatInterval MultiplierRangeRequired; // 0x28(0x08)
	bool Invert; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class FSD.DamageFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UDamageFunctionLibrary : UBlueprintFunctionLibrary {

	bool IsCorrosiveDeath(struct UDamageClass* DamageClass, struct TArray<struct UDamageTag*> Tags); // Function FSD.DamageFunctionLibrary.IsCorrosiveDeath // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x10b9410
};

// Class FSD.DamageModifier
// Size: 0x48 (Inherited: 0x30)
struct UDamageModifier : UDataAsset {
	struct UDamageCondition* Condition; // 0x30(0x08)
	struct TArray<struct FDamageModifierItem> Modifiers; // 0x38(0x10)
};

// Class FSD.DamageSettings
// Size: 0x140 (Inherited: 0x30)
struct UDamageSettings : UDataAsset {
	float TemperatureChangePerColdDamagePoint; // 0x30(0x04)
	float TemperatureChangePerIceDamagePoint; // 0x34(0x04)
	float TemperatureChangePerHeatDamagePoint; // 0x38(0x04)
	float TemperatureChangePerFireDamagePoint; // 0x3c(0x04)
	float TemperatureShockActivationWindow; // 0x40(0x04)
	float FrozenDamageBonus; // 0x44(0x04)
	struct UStatusEffect* EnemyOnFireStatusEffect; // 0x48(0x08)
	struct UStatusEffect* PlayerOnFireStatusEffect; // 0x50(0x08)
	struct UStatusEffect* TemperatureShockFromFrozenStatusEffect; // 0x58(0x08)
	struct UStatusEffect* TemperatureShockFromBurningStatusEffect; // 0x60(0x08)
	struct UDamageComponent* ArmorShatterDamage; // 0x68(0x08)
	struct UNiagaraSystem* ArmorShatterEmitter; // 0x70(0x08)
	struct USoundCue* ArmorShatterSound; // 0x78(0x08)
	struct TArray<struct FDecalData> ImpactDecals; // 0x80(0x10)
	struct FRuntimeFloatCurve ArmorToArmorDamageBreakingCurve; // 0x90(0x88)
	struct UDamageTag* DetonateFrozen; // 0x118(0x08)
	struct UDamageTag* DetonateOnFire; // 0x120(0x08)
	struct UDamageTag* DirectHit; // 0x128(0x08)
	struct UDamageTag* MeltTarget; // 0x130(0x08)
	struct UDamageTag* IgnoreBodypartDamageReduction; // 0x138(0x08)
};

// Class FSD.DamageSubsystem
// Size: 0x60 (Inherited: 0x30)
struct UDamageSubsystem : UGameInstanceSubsystem {
	struct TArray<struct FDamageSubsystemItem> Items; // 0x30(0x10)
	char pad_40[0x20]; // 0x40(0x20)
};

// Class FSD.DamageTag
// Size: 0x30 (Inherited: 0x30)
struct UDamageTag : UDataAsset {
};

// Class FSD.DanceSettings
// Size: 0x40 (Inherited: 0x30)
struct UDanceSettings : UDataAsset {
	struct TArray<struct FDanceItem> DanceMoves; // 0x30(0x10)
};

// Class FSD.DashPoints
// Size: 0x1d0 (Inherited: 0xb0)
struct UDashPoints : UActorComponent {
	struct FMulticastInlineDelegate OnStartDashEvent; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnStopDashEvent; // 0xc0(0x10)
	char pad_D0[0xc]; // 0xd0(0x0c)
	struct FVector_NetQuantize DashLocation; // 0xdc(0x0c)
	char pad_E8[0x10]; // 0xe8(0x10)
