// WidgetBlueprintGeneratedClass UI_InfoScreen_Overlay_DLC_Season01.UI_InfoScreen_Overlay_DLC_Season01_C
// Size: 0x2a0 (Inherited: 0x230)
struct UUI_InfoScreen_Overlay_DLC_Season01_C : UUserWidget {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x230(0x08)
	struct UWidgetAnimation* Click; // 0x238(0x08)
	struct UWidgetAnimation* Hover; // 0x240(0x08)
	struct UWidgetAnimation* Idle; // 0x248(0x08)
	struct UBasic_Menu_ColorBar_C* Basic_Menu_ColorBar; // 0x250(0x08)
	struct UBasic_Menu_ColorBar_C* Basic_Menu_ColorBar_C; // 0x258(0x08)
	struct UBasic_Menu_ColorBar_C* Basic_Menu_ColorBar_C_1; // 0x260(0x08)
	struct UBlurBackground_C* BlurBackground; // 0x268(0x08)
	struct UButton* Button_Outer; // 0x270(0x08)
	struct UImage* Glow1; // 0x278(0x08)
	struct UImage* Glow2; // 0x280(0x08)
	struct UImage* Image_194; // 0x288(0x08)
	bool NewVar_1; // 0x290(0x01)
	char pad_291[0x7]; // 0x291(0x07)
	struct UGameDLC* dlc; // 0x298(0x08)

	void Construct(); // Function UI_InfoScreen_Overlay_DLC_Season01.UI_InfoScreen_Overlay_DLC_Season01_C.Construct // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x158ca90
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // Function UI_InfoScreen_Overlay_DLC_Season01.UI_InfoScreen_Overlay_DLC_Season01_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature // (BlueprintEvent) // @ game+0x158ca90
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(); // Function UI_InfoScreen_Overlay_DLC_Season01.UI_InfoScreen_Overlay_DLC_Season01_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x158ca90
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature(); // Function UI_InfoScreen_Overlay_DLC_Season01.UI_InfoScreen_Overlay_DLC_Season01_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature // (BlueprintEvent) // @ game+0x158ca90
	void ExecuteUbergraph_UI_InfoScreen_Overlay_DLC_Season01(int32_t EntryPoint); // Function UI_InfoScreen_Overlay_DLC_Season01.UI_InfoScreen_Overlay_DLC_Season01_C.ExecuteUbergraph_UI_InfoScreen_Overlay_DLC_Season01 // (Final|UbergraphFunction) // @ game+0x158ca90
};

